{
  "LastDigestUtc": "2026-01-29T08:14:21.2959674+00:00",
  "CacheNews": [
    {
      "Title": "Roland’s Go:Mixer Studio turns your phone into a mobile music studio",
      "Link": "https://www.theverge.com/entertainment/864095/roland-gomixer-studio-namm",
      "Published": "2026-01-20T08:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Roland now offers a more capable audio mixer for phones and tablets with the launch of the Go:Mixer Studio. The Go:Mixer audio interface lineup has always been a bit limited, better suited for scrappy live streams and capturing quick demos on their phones than professional recording. The Go:Mixer Studio is an attempt to actually reach [\u0026#8230;]"
    },
    {
      "Title": "UK wage growth eases and payrolls drop",
      "Link": "https://www.bbc.com/news/articles/cddgrg87ly5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T07:50:03+00:00",
      "Source": "BBC News",
      "Summary": "Official figures show that the pace of private sector wage growth slowed to the lowest rate in five years."
    },
    {
      "Title": "Surfer injured in fourth shark attack in Australian state in 48 hours",
      "Link": "https://www.bbc.com/news/articles/cqxy3523nq2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T07:05:23+00:00",
      "Source": "BBC News",
      "Summary": "Authorities are warning people to stay out of the Australian state\u0027s waterways after recent rainfall."
    },
    {
      "Title": "\u0027Timid\u0027 Keys overcomes nerves to start title defence",
      "Link": "https://www.bbc.com/sport/tennis/articles/cdxjeleewk4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:49:30+00:00",
      "Source": "BBC News",
      "Summary": "Madison Keys overcomes nerves to begin her Australian Open title defence with victory over Grand Slam debutant Oleksandra Oliynykova."
    },
    {
      "Title": "The day I discovered the Everton contract Revie never signed",
      "Link": "https://www.bbc.com/sport/football/articles/cy8yp1nqd21o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:39:26+00:00",
      "Source": "BBC News",
      "Summary": "This is the story of how an unsigned contract that lay hidden in a bungalow for more than 50 years could have changed the course of English football."
    },
    {
      "Title": "\u0027Just bad luck\u0027: The teenage cousins living with inoperable brain tumours",
      "Link": "https://www.bbc.com/news/articles/c5yqrwn5z3lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:20:12+00:00",
      "Source": "BBC News",
      "Summary": "Lachlan Lindsay and Hazel Dempster were both diagnosed with brain tumours as children. "
    },
    {
      "Title": "Australia parliament votes on tighter gun controls after Bondi shooting",
      "Link": "https://www.bbc.com/news/articles/c20ge5qwdl2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:44:14+00:00",
      "Source": "BBC News",
      "Summary": "Parliament is also debating hate speech reforms after last month\u0027s deadly attack on a Jewish festival."
    },
    {
      "Title": "Spain to hold three days of mourning for victims of high-speed train crash",
      "Link": "https://www.bbc.com/news/articles/c2d7rk0865go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:26:03+00:00",
      "Source": "BBC News",
      "Summary": "At least 40 people died in Sunday\u0027s collision in  southern Spain, the worst crash the country has seen in more than a decade."
    },
    {
      "Title": "The Papers: \u0027Brooklyn goes nuclear\u0027 and UK teenagers \u0027face social media ban\u0027",
      "Link": "https://www.bbc.com/news/articles/c14rpdd3rn8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:14:00+00:00",
      "Source": "BBC News",
      "Summary": "Brooklyn Peltz Beckham\u0027s statement on his strained relationship with his parents features prominently on Tuesday\u0027s papers."
    },
    {
      "Title": "Northern Lights illuminate UK skies in hues of pink and green",
      "Link": "https://www.bbc.com/news/articles/c0q4pj5j729o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T04:13:18+00:00",
      "Source": "BBC News",
      "Summary": "The phenomenon known as the Aurora Borealis is the result of solar eruptions  sending particles that interact with the Earth\u0027s atmosphere."
    },
    {
      "Title": "Goodbye gator, see you later: San Francisco mourns its beloved albino alligator ",
      "Link": "https://www.bbc.com/news/articles/c62r0y2nkllo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:53:40+00:00",
      "Source": "BBC News",
      "Summary": "California names a street after reptile Claude, who won millions of hearts with his albinism."
    },
    {
      "Title": "\u0027Anger is healthy\u0027: Why women are smashing stuff up for fun",
      "Link": "https://www.bbc.com/news/articles/czjgkwvv7dvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:42:19+00:00",
      "Source": "BBC News",
      "Summary": "Why a reportedly growing number of women are paying to smash up old TVs and furniture in rage rooms."
    },
    {
      "Title": "Hidden cameras reveal what hedgehogs really get up to after dark ",
      "Link": "https://www.bbc.com/news/articles/cdjnr7lr7pzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:34:56+00:00",
      "Source": "BBC News",
      "Summary": "Hedgehogs are surprisingly common in UK gardens, with food a powerful attraction, say scientists."
    },
    {
      "Title": "The hospitals where waiting times are getting worse. Is yours one of them?",
      "Link": "https://www.bbc.com/news/articles/ckgjk89n2nyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:31:46+00:00",
      "Source": "BBC News",
      "Summary": "Nearly a quarter of hospital trusts in England have seen waiting times deteriorate in the past year."
    },
    {
      "Title": "More than 100 vehicles pile up on US motorway after crash",
      "Link": "https://www.bbc.com/news/videos/cly9kdklzrlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:15:14+00:00",
      "Source": "BBC News",
      "Summary": "Jack-knifed trucks were left strewn across the road after heavy snow in Ottawa Country, Michigan."
    },
    {
      "Title": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
      "Link": "https://www.bbc.com/news/articles/c0lx7j1lrwro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:04:54+00:00",
      "Source": "BBC News",
      "Summary": "Transatlantic relations aren\u0027t broken, though they are damaged. And if Europeans want to try to cut through with Trump, they\u0027ll have to stick together, writes Europe Editor Katya Adler"
    },
    {
      "Title": "Chris Pratt on new film Mercy: I asked to be locked into an executioner\u0027s chair",
      "Link": "https://www.bbc.com/news/articles/cy05drxx2nwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:37:41+00:00",
      "Source": "BBC News",
      "Summary": "The Marvel star plays a detective with 90 minutes to prove to an AI judge he did not murder his wife."
    },
    {
      "Title": "Ros Atkins on...President Trump\u0027s year in numbers",
      "Link": "https://www.bbc.com/news/videos/cvgpr95npplo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:08:41+00:00",
      "Source": "BBC News",
      "Summary": "Executive orders, pardons, trips and Truth Social posts - the BBC’s Analysis Editor breaks down Donald Trump’s first year back in office, in numbers."
    },
    {
      "Title": "Greenland \u0027will stay Greenland\u0027, former Trump adviser declares",
      "Link": "https://www.bbc.com/news/articles/c98p6m0r53no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:00:23+00:00",
      "Source": "BBC News",
      "Summary": "Donald Trump\u0027s former chief economic adviser said the US president\u0027s actions are a negotiating tactic."
    },
    {
      "Title": "Who has made Troy\u0027s Premier League team of the week?",
      "Link": "https://www.bbc.com/sport/football/articles/c5y34dkjd83o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:37:06+00:00",
      "Source": "BBC News",
      "Summary": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?"
    },
    {
      "Title": "In pictures: Valentino\u0027s life and work - and the stars who shared his journey",
      "Link": "https://www.bbc.com/news/articles/c4gwkdm2w33o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:21:36+00:00",
      "Source": "BBC News",
      "Summary": "His creations have featured at countless red carpets and award ceremonies around the world."
    },
    {
      "Title": "Saved by \u0027special talent\u0027 - but did penalty award wrong Brighton?",
      "Link": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:15:45+00:00",
      "Source": "BBC News",
      "Summary": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?"
    },
    {
      "Title": "I don\u0027t want to reconcile with family, says Brooklyn Peltz Beckham",
      "Link": "https://www.bbc.com/news/articles/ce3ekq4z5dyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:01:22+00:00",
      "Source": "BBC News",
      "Summary": "Speculation has been circulating in the press for months over a rift in the Beckham family."
    },
    {
      "Title": "Stunning late goal earns Brighton draw against Bournemouth",
      "Link": "https://www.bbc.com/sport/football/videos/c1kl81n2mpdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:46:01+00:00",
      "Source": "BBC News",
      "Summary": "Teenager Charalampos Kostoulas scores a stunning overhead kick to deny Bournemouth a rare away victory in the Premier League."
    },
    {
      "Title": "Water companies to face regular MOT-style checks in industry shake-up",
      "Link": "https://www.bbc.com/news/articles/cwygpg281dno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:30:04+00:00",
      "Source": "BBC News",
      "Summary": "The government says the industry will have \u0022nowhere to hide\u0022, but campaigners say the reforms do not go far enough."
    },
    {
      "Title": "UK to consult on social media ban for under 16s",
      "Link": "https://www.bbc.com/news/articles/cgm4xpyxp7lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:30:00+00:00",
      "Source": "BBC News",
      "Summary": "The government said it expected schools to be \u0022phone-free by default\u0022 as a result of the announcement."
    },
    {
      "Title": "Man Utd\u0027s complicated relationship with Class of 92",
      "Link": "https://www.bbc.com/sport/football/articles/cew84renxjgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T21:27:35+00:00",
      "Source": "BBC News",
      "Summary": "Manchester United and the class of 92 have a complicated relationship. But is it a problem?"
    },
    {
      "Title": "OpenAI’s 2026 ‘focus’ is ‘practical adoption’",
      "Link": "https://www.theverge.com/news/864229/openai-focus-practical-adoption-sarah-friar",
      "Published": "2026-01-19T21:05:30+00:00",
      "Source": "The Verge",
      "Summary": "OpenAI plans to focus on \u0022practical adoption\u0022 of AI in 2026, according to a blog post from CFO Sarah Friar. As the company spends a huge amount of money on infrastructure, OpenAI is working on \u0022closing the gap\u0022 on what AI can do and how people actually use it. \u0022The opportunity is large and immediate, [\u0026#8230;]"
    },
    {
      "Title": "Trump: “I No Longer Feel An Obligation To Think Purely Of Peace”",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mvydbn?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T21:01:00+00:00",
      "Source": "BBC News",
      "Summary": "European leaders respond to President Trump’s tariff threat."
    },
    {
      "Title": "How much can a city take?",
      "Link": "https://www.theverge.com/policy/864195/minneapolis-ice-invasion-organizing-immigration",
      "Published": "2026-01-19T21:00:00+00:00",
      "Source": "The Verge",
      "Summary": "I live in Minneapolis. I grew up not far from here, in a suburb of St. Paul; after stints on both coasts, my wife and I settled here to raise our daughters in a freezing state that had always welcomed us warmly. As the ongoing occupation by over 3,000 ICE agents stretches into its third [\u0026#8230;]"
    },
    {
      "Title": "A second US Sphere could come to Maryland",
      "Link": "https://www.theverge.com/tech/864192/sphere-entertainment-mini-venue-maryland-national-harbor",
      "Published": "2026-01-19T19:35:52+00:00",
      "Source": "The Verge",
      "Summary": "Sphere Entertainment, the company behind the eye-catching interactive venue in Las Vegas, has announced its \u0022intent to develop\u0022 another Sphere in Maryland that will be located 15 minutes south of Washington, DC. A timeline and exact location haven\u0027t been finalized, but the Maryland Sphere would be the company\u0027s second venue in the US, following plans [\u0026#8230;]"
    },
    {
      "Title": "Jacob Alon crowned Brits Critics\u0027 Choice winner",
      "Link": "https://www.bbc.com/news/articles/cg5g1gvn335o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T18:51:13+00:00",
      "Source": "BBC News",
      "Summary": "The Scottish folk singer edges out Sienna Spiro and Rose Gray to claim the prestigious prize."
    },
    {
      "Title": "Bungie’s Marathon shooter launches on March 5th",
      "Link": "https://www.theverge.com/news/864146/bungie-marathon-release-date-march-5th-price",
      "Published": "2026-01-19T16:41:50+00:00",
      "Source": "The Verge",
      "Summary": "Bungie is putting an official date on Marathon today, its delayed extraction shooter. The slick-looking shooter from the makers of Halo and Destiny was originally set to release in September, but will now launch on March 5th. Bungie will launch Marathon on Xbox Series S / X, PS5, and PC, priced at $39.99. Bungie initially [\u0026#8230;]"
    },
    {
      "Title": "Steve Rosenberg: Russia gloats over Greenland tensions",
      "Link": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T16:26:34+00:00",
      "Source": "BBC News",
      "Summary": "The BBC\u0027s Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump\u0027s desire to buy Greenland."
    },
    {
      "Title": "Chris Mason: Starmer sticks to his strategy and picks his words carefully",
      "Link": "https://www.bbc.com/news/articles/ckgykp22yk7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T16:07:12+00:00",
      "Source": "BBC News",
      "Summary": "The prime minister is seeking to downplay how he intends to react to Trump\u0027s threat of tariffs."
    },
    {
      "Title": "Gamers love AI in game dev — they just don\u0026#8217;t know it yet, says Razer\u0026#8217;s CEO",
      "Link": "https://www.theverge.com/podcast/863361/razer-ceo-min-liang-tan-ces-2026-ai-gaming-project-ava-interview",
      "Published": "2026-01-19T15:00:00+00:00",
      "Source": "The Verge",
      "Summary": "We’re back to start the year off with a very special live interview with Razer CEO Min-Liang Tan, which we taped in front of a terrific audience at Brooklyn Bowl in Las Vegas during CES.\u0026#160; Razer is obviously best known for making mice, keyboards, and gaming PCs in its signature black and bright green, with [\u0026#8230;]"
    },
    {
      "Title": "This 5-foot lamp is a supersized tribute to the world’s most iconic pen",
      "Link": "https://www.theverge.com/tech/864127/seletti-bic-ballpoint-pen-pendant-lamp-maison-objet",
      "Published": "2026-01-19T14:47:48+00:00",
      "Source": "The Verge",
      "Summary": "Seletti, an Italian design brand known for everything from furniture to tableware, has debuted an unusual tribute to an icon of design: the Bic Cristal pen. To celebrate its 75th anniversary, Seletti has supersized the pen and replaced its ink cartridge with a long LED-filled tube to illuminate your living room, office, or that closet [\u0026#8230;]"
    },
    {
      "Title": "How could Europe respond to tariffs threat?",
      "Link": "https://www.bbc.com/news/articles/cgk8z8xxpgmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T14:13:10+00:00",
      "Source": "BBC News",
      "Summary": "Europe is weighing up how to counter the US president\u0027s move against some of America\u0027s closest allies."
    },
    {
      "Title": "Asus may have made its last phone",
      "Link": "https://www.theverge.com/news/864116/asus-may-have-made-its-last-phone",
      "Published": "2026-01-19T14:10:38+00:00",
      "Source": "The Verge",
      "Summary": "Asus chairman Jonney Shih told Taiwan\u0027s Inside that the company is done making phones for now, marking the end of its Zenfone and ROG Phone lines. \u0022Asus will no longer add new mobile phone models in the future,\u0022 Shih reportedly said (translated with Google Translate). He didn\u0027t entirely rule out a return though, instead saying [\u0026#8230;]"
    },
    {
      "Title": "Animal Crossing: New Horizons added just enough to suck me back in",
      "Link": "https://www.theverge.com/games/863747/animal-crossing-new-horizons-update-3-0-switch-2-quality-of-life",
      "Published": "2026-01-19T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Animal Crossing has always been anti-instant gratification. By design, you have to take your time, wait for days to pass in real time, and complete a seemingly endless list of chores to build a meaningful life with your animal friends. The slowness is part of its appeal. But with New Horizons, some of that slowness [\u0026#8230;]"
    },
    {
      "Title": "Threads overtakes X on mobile, but still lags far behind",
      "Link": "https://www.theverge.com/news/864099/threads-overtakes-x-daily-mobile-ios-android-users",
      "Published": "2026-01-19T11:53:33+00:00",
      "Source": "The Verge",
      "Summary": "After launching almost three years ago, Meta\u0027s Threads is now reportedly attracting more daily mobile users than rival platform X. According to Similarweb data shared by TechCrunch, Threads has 141.5 million daily active iOS and Android global app users as of January 7th, compared to 125 million users for Elon Musk\u0027s mobile platform. Similarweb reports [\u0026#8230;]"
    },
    {
      "Title": "England fans have \u0027every right to be annoyed, I made terrible mistake\u0027 - Brook",
      "Link": "https://www.bbc.com/sport/cricket/articles/c8rm34kxzxmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T08:08:00+00:00",
      "Source": "BBC News",
      "Summary": "Harry Brook says supporters have “every right to be annoyed” by his behaviour after he was punched by a nightclub bouncer on England’s tour of New Zealand that preceded the Ashes."
    },
    {
      "Title": "Out-of-sorts Raducanu beaten at Australian Open",
      "Link": "https://www.bbc.com/sport/tennis/articles/c620l640jz2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T07:47:21+00:00",
      "Source": "BBC News",
      "Summary": "Britain\u0027s Emma Raducanu is below-par in an Australian Open second-round defeat by Austria\u0027s Anastasia Potapova."
    },
    {
      "Title": "\u0027Really scary\u0027: Sydney residents react to shark attacks",
      "Link": "https://www.bbc.com/news/videos/cpwnk040qd1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:39:33+00:00",
      "Source": "BBC News",
      "Summary": "The BBC spoke to people in Sydney about the four shark attacks in 48 hours along Australia\u0027s New South Wales coast."
    },
    {
      "Title": "Mum demands answers over son found dead with stab wounds in a Home Office flat",
      "Link": "https://www.bbc.com/news/articles/cp9j0p1v247o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:19:16+00:00",
      "Source": "BBC News",
      "Summary": "Sheena Millar says she is still seeking answers despite a year-long investigation into the death of her son Mikhail."
    },
    {
      "Title": "Global markets on alert as Europe to suspend approval of US trade deal",
      "Link": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:10:20+00:00",
      "Source": "BBC News",
      "Summary": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland. "
    },
    {
      "Title": "Photos leaked to BBC show faces of hundreds killed in Iran\u0027s brutal protest crackdown",
      "Link": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T05:56:20+00:00",
      "Source": "BBC News",
      "Summary": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones."
    },
    {
      "Title": "The Papers: Europe condemns Trump \u0027new colonialism\u0027 and \u0027Becks bites back\u0027",
      "Link": "https://www.bbc.com/news/articles/cnvg2r32rnno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T05:23:23+00:00",
      "Source": "BBC News",
      "Summary": "European leaders hitting back at Donald Trump\u0027s Greenland threat at the World Economic Forum in Davos dominates Wednesday\u0027s front pages."
    },
    {
      "Title": "Life sentence for man who killed Japan\u0027s ex-PM Shinzo Abe",
      "Link": "https://www.bbc.com/news/articles/c86v5lj39zpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T04:48:18+00:00",
      "Source": "BBC News",
      "Summary": "Abe\u0027s assassination stunned the country where there is virtually no gun crime."
    },
    {
      "Title": "Why is Emmanuel Macron wearing sunglasses indoors at Davos?",
      "Link": "https://www.bbc.com/news/articles/c4g050pdld3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T04:14:41+00:00",
      "Source": "BBC News",
      "Summary": "The French leader drew attention for his rebuke of Trump\u0027s tariff threat - and also his choice of eyewear."
    },
    {
      "Title": "One year in, Big Tech has out-maneuvered MAGA populists",
      "Link": "https://www.theverge.com/column/864759/big-tech-trump-one-year-in",
      "Published": "2026-01-21T03:33:00+00:00",
      "Source": "The Verge",
      "Summary": "Welcome to Regulator, a newsletter for Verge subscribers about the technology and the tech bros upending American politics and the Trump administration. If you\u0027re not a subscriber yet, and you\u0027re interested in Silicon Valley\u0027s adventures in sausage-making, you should do so here! It\u0027s Q1! Surely the corporate budget will allow for it. Precisely one year [\u0026#8230;]"
    },
    {
      "Title": "Will Trump get friendly welcome as world leaders meet in Davos?",
      "Link": "https://www.bbc.com/news/videos/c5y2qv39r3qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T03:23:22+00:00",
      "Source": "BBC News",
      "Summary": "As Trump pushes for Greenland, Davos may not provide the friendly stage he\u0027s accustomed to."
    },
    {
      "Title": "Driver killed in second deadly Spain train crash in days",
      "Link": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T03:00:55+00:00",
      "Source": "BBC News",
      "Summary": "At least 37 people have been injured, five seriously, in a second crash, after Sunday\u0027s two-train collision in Andalusia. "
    },
    {
      "Title": "Woman who was groomed as teen \u0027insulted\u0027 after compensation claims denied",
      "Link": "https://www.bbc.com/news/articles/c4g0ed1v82ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:27:22+00:00",
      "Source": "BBC News",
      "Summary": "Fiona Goddard from Bradford says she feels \u0022gaslit\u0022 as she sought compensation for abuse."
    },
    {
      "Title": "Finger-prick blood test could be early warning for children with type 1 diabetes",
      "Link": "https://www.bbc.com/news/articles/c3684zddgl0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:19:40+00:00",
      "Source": "BBC News",
      "Summary": "A simple finger-prick blood test can find those at risk so they can get the right treatment."
    },
    {
      "Title": "Why doing a mix of exercise could be the key to longer life",
      "Link": "https://www.bbc.com/news/articles/cn0y9pqe2zro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:17:52+00:00",
      "Source": "BBC News",
      "Summary": "Don\u0027t just focus on one activity - doing a variety every week gives you more health benefits, a study suggests."
    },
    {
      "Title": "\u0027It\u0027s harder to sell tickets\u0027: Grassroots music venues struggle to make profit",
      "Link": "https://www.bbc.com/news/articles/c20d1lxlx3go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:04:36+00:00",
      "Source": "BBC News",
      "Summary": "Thirty venues closed last year, and 6,000 staff were laid off as small venues saw their costs soar."
    },
    {
      "Title": "\u0027Good signs\u0027 or just buying time? Spurs remain divided on Frank future",
      "Link": "https://www.bbc.com/sport/football/articles/cj4lqy2np2zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:24:25+00:00",
      "Source": "BBC News",
      "Summary": "Many Tottenham fans have already lost faith in Thomas Frank - but did Tuesday\u0027s 2-0 win over Borussia Dortmund give cause for optimism?"
    },
    {
      "Title": "Sophie Turner on why being at your lowest is liberating",
      "Link": "https://www.bbc.com/news/articles/c2d743r9w7lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:20:01+00:00",
      "Source": "BBC News",
      "Summary": "The Game of Thrones star is leaning into the role of a disgruntled office worker in new drama Steal."
    },
    {
      "Title": "Snap settles social media addiction lawsuit ahead of trial",
      "Link": "https://www.bbc.com/news/articles/c62ndl2ydzxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:17:01+00:00",
      "Source": "BBC News",
      "Summary": "TikTok, YouTube and Meta remain defendants in the case, which is due to kick off next week."
    },
    {
      "Title": "Bellingham responds to partying claims with \u0027joke\u0027 drinking celebration",
      "Link": "https://www.bbc.com/sport/articles/c24g6r250veo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:05:40+00:00",
      "Source": "BBC News",
      "Summary": "Jude Bellingham responds to partying claims with a goal celebration in the Champions League win over Monaco."
    },
    {
      "Title": "Locked exits, panic and desperate calls for help: Survivors tell of mall fire horror",
      "Link": "https://www.bbc.com/news/articles/c1ev4z4n5dzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:03:08+00:00",
      "Source": "BBC News",
      "Summary": "The BBC speaks to eyewitnesses and survivors of the fire that ripped through a busy Pakistan shopping centre. "
    },
    {
      "Title": "Film about Palestinian girl\u0027s desperate plea was a \u0027way to not feel helpless\u0027, says director",
      "Link": "https://www.bbc.com/news/articles/clygr0ym00po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:01:05+00:00",
      "Source": "BBC News",
      "Summary": "Kaouther Ben Hani\u0027s Oscar hopeful, The Voice of Hind Rajab, tells the tale of a girl killed in Gaza."
    },
    {
      "Title": "Trump greenlit tiny Kei cars but will Americans actually buy them?",
      "Link": "https://www.bbc.com/news/articles/c17xvqlx8r8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:42+00:00",
      "Source": "BBC News",
      "Summary": "The president wants to bring to the US tiny vehicles, like those commonly seen on the streets of Japan."
    },
    {
      "Title": "Air India crash plane had record of safety defects, campaigners claim",
      "Link": "https://www.bbc.com/news/articles/czx1p47x589o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:38+00:00",
      "Source": "BBC News",
      "Summary": "Campaigners say they have evidence the plane had previously suffered a series of technical failures, including a fire."
    },
    {
      "Title": "Driving test cheating soars as candidates turn to Bluetooth headsets and impersonators",
      "Link": "https://www.bbc.com/news/articles/cx2g30wwmnno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:33+00:00",
      "Source": "BBC News",
      "Summary": "Experts blamed persistently long waits for practical tests while the DVSA blamed better detection."
    },
    {
      "Title": "The best AirPods to buy",
      "Link": "https://www.theverge.com/tech/645217/best-apple-airpods-pro",
      "Published": "2026-01-21T00:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Whether you’re buying your first pair of AirPods or replacing a well-used older pair, it’s easy to understand why so many iPhone owners prefer Apple’s earbuds and headphones over other options. Apple has spent years gradually adding new features that work best — and sometimes only work at all — with the company’s own devices. [\u0026#8230;]"
    },
    {
      "Title": "\u0027Tears in my eyes\u0027 - Jesus enjoys \u0027dream night\u0027 in San Siro",
      "Link": "https://www.bbc.com/sport/football/articles/cwy1wr2xryxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T23:57:02+00:00",
      "Source": "BBC News",
      "Summary": "Gabriel Jesus says he had \u0022tears in my eyes\u0022 after scoring twice to help Arsenal win 3-1 at Inter Milan for a seventh successive win in the Champions League."
    },
    {
      "Title": "Alleged scam mastermind arrested after being exposed by BBC",
      "Link": "https://www.bbc.com/news/articles/cwy8v31kkv1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T23:43:38+00:00",
      "Source": "BBC News",
      "Summary": "Kuong Li featured in a 2023 BBC Eye investigation into alleged scam compounds in South East Asia."
    },
    {
      "Title": "Netflix earned $1.5 billion from ads in 2025",
      "Link": "https://www.theverge.com/news/864451/netflix-advertising-revenue-doubled-q4-2025-earnings",
      "Published": "2026-01-20T23:06:25+00:00",
      "Source": "The Verge",
      "Summary": "Netflix\u0027s advertising business more than doubled its advertising revenue to $1.5 billion from 2024 to 2025 - and it\u0027s on track to keep growing. \u0022We expect that [advertising] business to roughly double again in \u002726 to about $3 billion,\u0022 Netflix co-CEO Greg Peters said during an earnings call on Tuesday, hours ahead of its live [\u0026#8230;]"
    },
    {
      "Title": "Trump admin admits DOGE employees had access to off-limits Social Security data",
      "Link": "https://www.theverge.com/news/864643/doge-social-security-data-misuse",
      "Published": "2026-01-20T22:52:59+00:00",
      "Source": "The Verge",
      "Summary": "Department of Government Efficiency (DOGE) staffers working at the Social Security Administration (SSA) broke protocols, had more access to sensitive data on Americans than previously disclosed, and were in touch with a political advocacy group hunting for election fraud, the Trump administration admitted in a recent court filing. Justice Department officials told a federal court [\u0026#8230;]"
    },
    {
      "Title": "Netflix will revamp its mobile UI this year",
      "Link": "https://www.theverge.com/news/864646/netflix-mobile-ui-revamp-design-vertical-video",
      "Published": "2026-01-20T22:46:59+00:00",
      "Source": "The Verge",
      "Summary": "Netflix is working on a new mobile UI set to roll out later this year that will \u0022better serve the expansion of our business over the decade to come,\u0022 co-CEO Greg Peters said in an earnings call on Tuesday. The new mobile UI follows last year\u0027s big TV revamp that put a new banner front [\u0026#8230;]"
    },
    {
      "Title": "UK homes to get £15bn for solar and green tech to cut energy bills",
      "Link": "https://www.bbc.com/news/articles/ckgj7me00p0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:32:47+00:00",
      "Source": "BBC News",
      "Summary": "The government has announced the details of its long-awaited Warm Homes Plan which promises to cut energy bills."
    },
    {
      "Title": "FTC says it will appeal Meta antitrust loss",
      "Link": "https://www.theverge.com/news/864622/ftc-meta-antitrust-ruling-appeal",
      "Published": "2026-01-20T22:21:31+00:00",
      "Source": "The Verge",
      "Summary": "The Federal Trade Commission will appeal its loss in a landmark antitrust case against Meta, the agency announced Tuesday. US District Court Judge James Boasberg ruled in November that the government failed to prove that Meta had an illegal monopoly over a subset of social networking services meant for connecting with friends and family online. [\u0026#8230;]"
    },
    {
      "Title": "Spat deepens between Elon Musk and Ryanair\u0027s O\u0027Leary",
      "Link": "https://www.bbc.com/news/articles/ckgyzl4gd1do?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:08:15+00:00",
      "Source": "BBC News",
      "Summary": "Musk and Ryanair boss Michael O\u0027Leary have called each other \u0022idiots\u0022 in recent days"
    },
    {
      "Title": "Beckham vs Peltz Beckham: Could Brooklyn torpedo the family brand?",
      "Link": "https://www.bbc.com/news/articles/c3ve1r2674zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:05:28+00:00",
      "Source": "BBC News",
      "Summary": "Brooklyn\u0027s explosive post about Brand Beckham \u0022has ruptured it from within\u0022, one commentator says."
    },
    {
      "Title": "\u0027Battered in Bodo\u0027 - is this more than just a blip for Man City?",
      "Link": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T21:59:32+00:00",
      "Source": "BBC News",
      "Summary": "Manchester City suffered their very own \u0022hell of a beating\u0022 moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January."
    },
    {
      "Title": "Nova Launcher’s new owner might offer a version with ads",
      "Link": "https://www.theverge.com/news/864585/nova-launcher-instabridge-acquisition-owner-ads",
      "Published": "2026-01-20T20:55:04+00:00",
      "Source": "The Verge",
      "Summary": "Last year, Nova Launcher founder and sole developer Kevin Barry announced he had left Branch Metrics, Nova\u0027s parent company at the time - which followed an announcement from 2024 that nearly everyone working on the project had been laid off. But the launcher is getting new life: in a blog post on Tuesday, the Swedish [\u0026#8230;]"
    },
    {
      "Title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
      "Link": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T20:18:43+00:00",
      "Source": "BBC News",
      "Summary": "Trump\u0027s demands over Greenland are a rude awakening in a moment fraught with risk."
    },
    {
      "Title": "Google has finally killed the Stadia Bluetooth tool — but this person rescued it",
      "Link": "https://www.theverge.com/tech/864543/google-has-finally-killed-the-stadia-bluetooth-tool-but-this-person-rescued-it",
      "Published": "2026-01-20T19:50:46+00:00",
      "Source": "The Verge",
      "Summary": "Did you save your Google Stadia controller like I told you last month? It\u0027s still not too late. This week, Google has finally removed the tool that converts the now-useless controller into a decent Bluetooth gamepad. But there\u0027s another way. Christopher Klay, who previously developed the Stadia Enhanced browser extension, is one of many who [\u0026#8230;]"
    },
    {
      "Title": "Carney says old world order \u0027is not coming back\u0027",
      "Link": "https://www.bbc.com/news/articles/cly3d28p4p8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T18:49:50+00:00",
      "Source": "BBC News",
      "Summary": "Canada\u0027s prime minister said powerful countries are using economic weapons to pursue their interests, while affirming support for Greenland and Nato."
    },
    {
      "Title": "Samsung’s discounted microSD Express card more than doubles your Switch 2 storage",
      "Link": "https://www.theverge.com/gadgets/864404/samsung-p9-microsd-express-card-deal-sale",
      "Published": "2026-01-20T18:36:47+00:00",
      "Source": "The Verge",
      "Summary": "If you buy digital games for the Nintendo Switch 2, Samsung’s P9 microSD Express card offers an easier way to expand your storage without constantly deleting games to make room. It’s cheaper than other microSD cards, and it’s an even better value right now, with the 512GB version priced at $79.99 ($40 off) — just [\u0026#8230;]"
    },
    {
      "Title": "Life is Strange will bring the Max and Chloe story to an end in new game",
      "Link": "https://www.theverge.com/games/864438/life-is-strange-reunion-release-date-max-chloe",
      "Published": "2026-01-20T18:30:00+00:00",
      "Source": "The Verge",
      "Summary": "A little over a decade ago, Life is Strange burst onto the scene with a unique blend of teen drama and interactive storytelling. That first game told the story of Max Caulfield, who had the supernatural ability to reverse time, and her best friend Chloe Price. Now developer Deck Nine Games is finally bringing their [\u0026#8230;]"
    },
    {
      "Title": "Trump accuses UK of \u0022an act of GREAT STUPIDITY!\u0022",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mw2lg4?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T16:17:00+00:00",
      "Source": "BBC News",
      "Summary": "Chief Secretary to the Prime Minister Darren Jones responds to Trump’s Truth Social rant."
    },
    {
      "Title": "Greenland: Could the US regret alienating its Nato allies?",
      "Link": "https://www.bbc.co.uk/sounds/play/w3ct71d5?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump responded, “no comment” when asked if he\u0027d use force to seize Greenland."
    },
    {
      "Title": "Government borrowing falls by more than a third in December, figures show",
      "Link": "https://www.bbc.com/news/articles/clymd1pj887o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:51:46+00:00",
      "Source": "BBC News",
      "Summary": "More money than expected was collected through tax and higher National Insurance Contributions, although public sector spending also increased"
    },
    {
      "Title": "\u0027Ridiculous amount of games\u0027 - has Haaland played too much football?",
      "Link": "https://www.bbc.com/sport/football/articles/cy7mv3eg5nlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:50:56+00:00",
      "Source": "BBC News",
      "Summary": "Erling Haaland made a blistering start to the season but that prolific run of form has ground to a halt with only one goal in his past eight games."
    },
    {
      "Title": "Work for 2026 season \u0027unprecedented\u0027 for McLaren",
      "Link": "https://www.bbc.com/sport/formula1/articles/c3r1755jjx9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:01:32+00:00",
      "Source": "BBC News",
      "Summary": "McLaren team principal Andrea Stella says the world champions have faced an \u0022unprecedented\u0022 amount of work as he looks ahead to the new season."
    },
    {
      "Title": "We were lied to, demeaned and smeared, say hospital inquiry families",
      "Link": "https://www.bbc.com/news/articles/c4g4e17g7yyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:52:39+00:00",
      "Source": "BBC News",
      "Summary": "The families call for those responsible for the issues at the Queen Elizabeth University Hospital in Glasgow to be held to account."
    },
    {
      "Title": "Gymnast Alice Kinsella prepares for rare return to elite competition after baby",
      "Link": "https://www.bbc.com/sport/gymnastics/articles/ckgzjyj4jkqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:26:28+00:00",
      "Source": "BBC News",
      "Summary": "Olympic bronze medalist Alice Kinsella on her hopes of being the first British artistic gymnast to return to elite competition after childbirth."
    },
    {
      "Title": "Djokovic cruises into Australian Open third round",
      "Link": "https://www.bbc.com/sport/tennis/articles/c5y22d8ng29o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:23:06+00:00",
      "Source": "BBC News",
      "Summary": "Novak Djokovic will need to conserve energy if he is to make history at the Australian Open - and he has not dropped a set in the first two rounds."
    },
    {
      "Title": "The Papers: \u0027Trump hails Greenland deal\u0027 and \u0027All I want is a piece of ice\u0027",
      "Link": "https://www.bbc.com/news/articles/cly99w1zx4lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T05:33:23+00:00",
      "Source": "BBC News",
      "Summary": "Donald Trump\u0027s announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday\u0027s front pages."
    },
    {
      "Title": "Ghislaine Maxwell to testify before US Congress in Epstein probe",
      "Link": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T05:14:56+00:00",
      "Source": "BBC News",
      "Summary": "The convicted sex trafficker has previously said she would decline to answer questions unless she is granted immunity."
    },
    {
      "Title": "Hundreds of creatives warn against an AI slop future",
      "Link": "https://www.theverge.com/ai-artificial-intelligence/864951/human-artistry-campaign-ai-licensing-artists",
      "Published": "2026-01-22T05:01:00+00:00",
      "Source": "The Verge",
      "Summary": "Around 800 artists, writers, actors, and musicians signed on to a new campaign against what they call \u0022theft at a grand scale\u0022 by AI companies. The signatories of the campaign - called \u0022Stealing Isn\u0027t Innovation\u0022 - include authors George Saunders and Jodi Picoult, actors Cate Blanchett and Scarlett Johansson, and musicians like the band R.E.M., [\u0026#8230;]"
    },
    {
      "Title": "Bezos\u0027 Blue Origin announces satellite rival to Musk\u0027s Starlink",
      "Link": "https://www.bbc.com/news/articles/cn0yydwe89jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T03:15:27+00:00",
      "Source": "BBC News",
      "Summary": "Blue Origin will be focused on businesses and governments, while Starlink also offers services to individual customers."
    },
    {
      "Title": "US allies won\u0027t forget Trump Greenland crisis",
      "Link": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:52:28+00:00",
      "Source": "BBC News",
      "Summary": "Despite talk of a deal over Greenland, it will be hard for US allies to return to business as usual, writes the BBC’s diplomatic correspondent. "
    },
    {
      "Title": "Massive winter storm expected to bury much of US in snow and ice ",
      "Link": "https://www.bbc.com/news/articles/cg7yy9xm1v1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:26:01+00:00",
      "Source": "BBC News",
      "Summary": "Officials, including airport authorities in several major cities, are warning travellers to brace for significant delays amid the severe winter weather."
    },
    {
      "Title": "Ex-intelligence officer in Austria\u0027s biggest spy trial for years",
      "Link": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:00:06+00:00",
      "Source": "BBC News",
      "Summary": "Egisto Ott, 63, denies charges of handing over information to Russian agents."
    },
    {
      "Title": "Starmer warned of Labour rebellion if leasehold reforms watered down",
      "Link": "https://www.bbc.com/news/articles/czx3gz6pq90o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:57:24+00:00",
      "Source": "BBC News",
      "Summary": "Former minister Justin Madders tells the BBC Labour must stick to its pledge to cap ground rents."
    },
    {
      "Title": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
      "Link": "https://www.bbc.com/news/articles/cx2yd455rd0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:43:18+00:00",
      "Source": "BBC News",
      "Summary": "Nicky Perfect shares three practical tricks she learnt which will help you handle daily parenting battles."
    },
    {
      "Title": "Ashton Kutcher: Hollywood isn\u0027t to blame for pushing unrealistic beauty standards",
      "Link": "https://www.bbc.com/news/articles/cddgrp0yvg1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:40:20+00:00",
      "Source": "BBC News",
      "Summary": "The actor stars in The Beauty,  which explores the negative impact of a world full of beautiful people."
    },
    {
      "Title": "Blockbusters, battles and Brits: Hollywood gears up for Oscar nominations",
      "Link": "https://www.bbc.com/news/articles/ce9yx4d3kjzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:24:18+00:00",
      "Source": "BBC News",
      "Summary": "Sinners, Marty Supreme, Hamnet and One Battle After Another are all in contention this year."
    },
    {
      "Title": "\u0027He came here for these nights\u0027 - Wissa inspires Newcastle",
      "Link": "https://www.bbc.com/sport/football/articles/cy599yy9reyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:24:16+00:00",
      "Source": "BBC News",
      "Summary": "Eddie Howe says Yoane Wissa came to Newcastle \u0022for these nights\u0022 after his first Champions League goal at St James\u0027 Park."
    },
    {
      "Title": "Slot praises Salah return on important night for both",
      "Link": "https://www.bbc.com/sport/football/articles/cn0yyexlvrgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:03:51+00:00",
      "Source": "BBC News",
      "Summary": "Arne Slot praises the return of Mohamed Salah, with Liverpool\u0027s Champions League win in Marseille proving important for both."
    },
    {
      "Title": "Liverpool top English club in Deloitte Football Money League",
      "Link": "https://www.bbc.com/sport/football/articles/cx2kd52yxpdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:01:17+00:00",
      "Source": "BBC News",
      "Summary": "Liverpool become the top-earning Premier League club for the first time, according to analysis from financial firm Deloitte."
    },
    {
      "Title": "Why does Trump want Greenland and what could it mean for Nato and the EU?",
      "Link": "https://www.bbc.com/news/articles/c74x4m71pmjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T23:25:51+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s repeated demands to control Greenland could threaten the Nato military alliance."
    },
    {
      "Title": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
      "Link": "https://www.theverge.com/news/865282/blue-origin-terawave-satellite-6tb",
      "Published": "2026-01-21T23:22:57+00:00",
      "Source": "The Verge",
      "Summary": "SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos\u0027 space company, Blue Origin, has announced the TeraWave network. It says TeraWave will offer bandwidth of up to 6Tb available anywhere on Earth, for both upload and download. The only wrinkle? Even after satellite deployments are scheduled [\u0026#8230;]"
    },
    {
      "Title": "Chris Mason: Latest twist in Trump diplomacy brings relief for Starmer",
      "Link": "https://www.bbc.com/news/articles/c62wwre0jrro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T23:01:41+00:00",
      "Source": "BBC News",
      "Summary": "The row over Greenland risked uprooting the PM\u0027s carefully cultivated relationship with the US president."
    },
    {
      "Title": "Everyone can hear your TV in their headphones using this transmitter",
      "Link": "https://www.theverge.com/tech/864569/sennheiser-bluetooth-auracast-bta1-transmitter-hdr-275-wireless-headphones",
      "Published": "2026-01-21T23:00:00+00:00",
      "Source": "The Verge",
      "Summary": "As we\u0027ve previously lamented, one of Bluetooth\u0027s best modern features isn\u0027t being embraced by the tech world, but that\u0027s changing. Sennheiser has announced a new pair of wireless headphones and a transmitter designed for private TV watching that both use a Bluetooth feature called Auracast. Like tuning into a radio station broadcast from a tower, [\u0026#8230;]"
    },
    {
      "Title": "Here are the best Kindle deals right now",
      "Link": "https://www.theverge.com/21539047/best-amazon-kindle-deals",
      "Published": "2026-01-21T23:00:00+00:00",
      "Source": "The Verge",
      "Summary": "When it comes to finding a device to read ebooks, you have a few options to choose from. You can always buy a tablet or use your phone, but those devices are multipurpose and can be used for a ton of things, like surfing the web or doomscrolling on X or Bluesky. If you are [\u0026#8230;]"
    },
    {
      "Title": "Salah returns as Liverpool score three to beat Marseille",
      "Link": "https://www.bbc.com/sport/football/videos/cvg5w77wyxyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T22:26:57+00:00",
      "Source": "BBC News",
      "Summary": "Mohammad Salah returns to the Liverpool starting XI as Liverpool score three goals, including an intelligent Dominik Szoboszlai free kick, to beat Olympique Marseille."
    },
    {
      "Title": "Apple is reportedly working on an AirTag-sized AI wearable",
      "Link": "https://www.theverge.com/news/865212/apple-ai-pin-wearable-airtag-rumor",
      "Published": "2026-01-21T21:43:27+00:00",
      "Source": "The Verge",
      "Summary": "Apple is working on an AI-powered wearable pin with cameras and microphones designed to pick up a user\u0027s surroundings, according to a report from The Information. The rumored device is reportedly the size of an AirTag, with \u0022thin, flat, circular\u0022 housing made from aluminium and glass. The Information reports that Apple\u0027s rumored AI pin will [\u0026#8230;]"
    },
    {
      "Title": "Seven more countries agree to join Trump\u0027s Board of Peace",
      "Link": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T20:55:33+00:00",
      "Source": "BBC News",
      "Summary": "Seven Muslim-majority countries accept an invitation to Trump\u0027s new organisation, while Russia\u0027s Putin says he\u0027s considering joining."
    },
    {
      "Title": "Anthropic’s new Claude ‘constitution’: be helpful and honest, and don’t destroy humanity",
      "Link": "https://www.theverge.com/ai-artificial-intelligence/865185/anthropic-claude-constitution-soul-doc",
      "Published": "2026-01-21T20:36:18+00:00",
      "Source": "The Verge",
      "Summary": "Anthropic is overhauling Claude\u0027s so-called \u0022soul doc.\u0022 The new missive is a 57-page document titled \u0022Claude\u0027s Constitution,\u0022 which details \u0022Anthropic\u0027s intentions for the model\u0027s values and behavior,\u0022 aimed not at outside readers but the model itself. The document is designed to spell out Claude\u0027s \u0022ethical character\u0022 and \u0022core identity,\u0022 including how it should balance conflicting [\u0026#8230;]"
    },
    {
      "Title": "Apple is turning Siri into an AI bot that\u0026#8217;s more like ChatGPT",
      "Link": "https://www.theverge.com/news/865172/apple-siri-ai-chatbot-chatgpt",
      "Published": "2026-01-21T20:26:47+00:00",
      "Source": "The Verge",
      "Summary": "Apple is planning a big Siri overhaul that will transform the voice assistant into an AI chatbot built directly into its iPhone and Mac, according to Bloomberg reporter Mark Gurman. The update is reportedly coming later this year and will replace the existing Siri interface, allowing users to interact with the assistant by both typing [\u0026#8230;]"
    },
    {
      "Title": "Jibes are wearing thin for many of Europe\u0027s leaders",
      "Link": "https://www.bbc.com/news/articles/cd9ez1nj3n3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T20:03:49+00:00",
      "Source": "BBC News",
      "Summary": "The ball is in the court of European leaders ahead of Thursday\u0027s emergency EU meeting in Brussels, writes Nick Beake."
    },
    {
      "Title": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
      "Link": "https://www.bbc.com/news/articles/c70l9531pd1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T19:54:14+00:00",
      "Source": "BBC News",
      "Summary": "As Australia mourns the Bondi shooting victims, volunteers have been preserving tributes left in their honour."
    },
    {
      "Title": "Faisal Islam: What it was like inside the room for speech",
      "Link": "https://www.bbc.com/news/articles/cm24vjvy3n1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T19:22:59+00:00",
      "Source": "BBC News",
      "Summary": "Our economics editor says there was mixed reaction in the room during Trump\u0027s Davos speech."
    },
    {
      "Title": "Samsung Galaxy S26 battery pack leak points to Qi2 charging support",
      "Link": "https://www.theverge.com/news/865083/samsung-galaxy-s26-battery-pack-qi2-support",
      "Published": "2026-01-21T18:11:41+00:00",
      "Source": "The Verge",
      "Summary": "It looks like Samsung is preparing to launch a new Qi2 battery pack for the upcoming Galaxy S26, which is rumored to support the upgraded charging standard. A report from Winfuture shows off leaked images of what appears to be the new accessory, outfitted with a magnetic Qi2 charging ring that delivers up to 15W [\u0026#8230;]"
    },
    {
      "Title": "Tetchy and emotional exchanges as Harry in court for what could be last time",
      "Link": "https://www.bbc.com/news/articles/c07x53vjegvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T17:59:51+00:00",
      "Source": "BBC News",
      "Summary": "The Duke of Sussex\u0027s manner showed how personal this was to him, delivering terse and sometimes tense answers."
    },
    {
      "Title": "Olivia Dean and Lola Young dominate Brit Award nominations",
      "Link": "https://www.bbc.com/news/articles/cx2yd148wj8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T17:45:05+00:00",
      "Source": "BBC News",
      "Summary": "A new wave of pop stars lead the shortlist, while Pulp pick up their first nomination in 30 years."
    },
    {
      "Title": "Volvo aims for an EV reset with the new EX60 crossover",
      "Link": "https://www.theverge.com/news/864561/volvo-ex60-range-price-specs",
      "Published": "2026-01-21T17:30:00+00:00",
      "Source": "The Verge",
      "Summary": "Volvo\u0027s EX60, with fast-charging capabilities and a brand-new electric architecture, made its official debut today, with the Swedish automaker positioning the crossover EV as a new direction for its battery-powered lineup. With up to 400 miles of estimated range and an 800-volt architecture for ultra-fast charging, the EX60 feels like a concerted effort by Volvo [\u0026#8230;]"
    },
    {
      "Title": "Ubisoft cancels Prince of Persia remake as part of major reorganization",
      "Link": "https://www.theverge.com/news/865060/ubisoft-prince-of-persia-sands-of-time-remake-canceled-reorganization",
      "Published": "2026-01-21T17:23:29+00:00",
      "Source": "The Verge",
      "Summary": "Ubisoft is announcing a major reorganization, and with the changes, it\u0027s refocusing its portfolio and canceling some games, including the beleaguered remake of Prince of Persia: The Sands of Time. With the reorganization, Ubisoft will focus its efforts on big open worlds and live service games and is making \u0022accelerated investments\u0022 in \u0022player-facing Generative AI.\u0022 [\u0026#8230;]"
    },
    {
      "Title": "Oldest cave painting of red claw hand could rewrite human creativity timeline",
      "Link": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T16:00:07+00:00",
      "Source": "BBC News",
      "Summary": "A stencilled outline of a hand found on the Indonesian island of Sulawesi is the world\u0027s oldest known cave painting, researchers say."
    },
    {
      "Title": "US officially leaves World Health Organization",
      "Link": "https://www.bbc.com/news/articles/cn9zznx8qdno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:42:44+00:00",
      "Source": "BBC News",
      "Summary": "Trump ordered the withdrawal a year ago, accusing the UN agency of failing to adopt reforms and mishandling the pandemic."
    },
    {
      "Title": "Social media firms have come to ban \u0027kicking and screaming\u0027, says Australia eSafety boss",
      "Link": "https://www.bbc.com/news/articles/c5y33xjmm3mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:01:41+00:00",
      "Source": "BBC News",
      "Summary": "As other nations consider similar laws, Julie Inman Grant told the BBC the ban is already exceeding expectations."
    },
    {
      "Title": "Botched insulation scheme was \u0027doomed to fail\u0027, say MPs",
      "Link": "https://www.bbc.com/news/articles/c8011kkdn5jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:00:06+00:00",
      "Source": "BBC News",
      "Summary": "Installers should be investigated by the Serious Fraud Office, an influential parliamentary committee has said."
    },
    {
      "Title": "Vietnam\u0027s leader returns to power with bold promises. Can he deliver? ",
      "Link": "https://www.bbc.com/news/articles/c20zzq8we8wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:59:50+00:00",
      "Source": "BBC News",
      "Summary": "To Lam resumes the role of communist party chief, the post he currently holds, for the next five years."
    },
    {
      "Title": "\u0027He\u0027s my son\u0027 - Emery on pushing Tielemans",
      "Link": "https://www.bbc.com/sport/football/articles/cy09974jwx9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:54:54+00:00",
      "Source": "BBC News",
      "Summary": "Aston Villa manager Unai Emery plays down a heated touchline incident with midfielder Youri Tielemans after substituting him against Fenerbahce."
    },
    {
      "Title": "A \u0027reckless teenager\u0027 misusing his confidence - the making of Pimblett",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/articles/cd0yvrl1myzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:38:36+00:00",
      "Source": "BBC News",
      "Summary": "Paddy Pimblett\u0027s journey from reckless teenager to UFC superstar could be completed in Las Vegas on Saturday when he faces Justin Gaethje for the interim lightweight title at UFC 324."
    },
    {
      "Title": "\u0027Emotionally all over the place\u0027 - gritty Sabalenka wins",
      "Link": "https://www.bbc.com/sport/tennis/articles/c8j332v7e9xo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:09:18+00:00",
      "Source": "BBC News",
      "Summary": "World number one Aryna Sabalenka says she was \u0022emotionally all over the place\u0022 as she squeezes into the Australian Open fourth round."
    },
    {
      "Title": "Eight surprise takeaways from the Oscar nominations",
      "Link": "https://www.bbc.com/news/articles/cp3zzv40422o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:07:32+00:00",
      "Source": "BBC News",
      "Summary": "Paul Mescal and Chase Infiniti missed out, while other actors carried their films to a nomination."
    },
    {
      "Title": "\u0027I gave last 46p\u0027: Young people tell how they felt pressure to donate to emerging church",
      "Link": "https://www.bbc.com/news/articles/c8e59zrxrypo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:05:43+00:00",
      "Source": "BBC News",
      "Summary": "Former London ICC members tell the BBC they were pushed into making donations they could not afford."
    },
    {
      "Title": "US president stepped back over Greenland threat because he heard UK’s concerns, says Lammy",
      "Link": "https://www.bbc.com/news/articles/cm244zlnmkvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:59:34+00:00",
      "Source": "BBC News",
      "Summary": "The deputy PM says the US President rowed back on threats after UK stood up for Denmark\u0027s sovereignty."
    },
    {
      "Title": "Dozens of sanctioned Russian tankers navigate Channel despite UK vow of \u0027assertive\u0027 action",
      "Link": "https://www.bbc.com/news/articles/c2d77rr51rko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:58:03+00:00",
      "Source": "BBC News",
      "Summary": "Some 42 sanctioned tankers has passed through the Channel since 11 January, a BBC Verify analysis finds. "
    },
    {
      "Title": "Ukraine is battling to keep the lights on, this nuclear plant is vital in the fight",
      "Link": "https://www.bbc.com/news/articles/cp3zzqzgn28o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:57:55+00:00",
      "Source": "BBC News",
      "Summary": "The BBC gains rare access to the Khmelnytsky plant as Russian pummels Ukraine\u0027s energy grid."
    },
    {
      "Title": "The Papers: Zelensky\u0027s \u0027fiery\u0027 Davos speech and \u0027Operation Stop Burnham\u0027",
      "Link": "https://www.bbc.com/news/articles/cd0yyy1g842o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:56:10+00:00",
      "Source": "BBC News",
      "Summary": "More developments in Davos and the PM\u0027s allies moving to stop a potential leadership bid feature on Friday\u0027s front pages. "
    },
    {
      "Title": "Trump withdraws Canada\u0027s invite to  \u0027Board of Peace\u0027",
      "Link": "https://www.bbc.com/news/articles/cn7jjp8gl0jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:16:46+00:00",
      "Source": "BBC News",
      "Summary": "Trump did not provide a reason for the decision, which comes after Canada\u0027s PM Mark Carney warned of a \u0022rupture\u0022 in the US-led global order. "
    },
    {
      "Title": "\u0027I was in bed\u0027: How British actor Delroy Lindo heard about Oscar nomination",
      "Link": "https://www.bbc.com/news/videos/cy4qqek1ddyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T04:08:33+00:00",
      "Source": "BBC News",
      "Summary": "Lindo and his Sinners co-star Wunmi Mosaku are the only two UK actors nominated for an Oscar this year."
    },
    {
      "Title": "Teens among missing after landslide at  New Zealand campsite",
      "Link": "https://www.bbc.com/news/articles/c14rr5pnd80o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T02:50:33+00:00",
      "Source": "BBC News",
      "Summary": "The search continues for missing people after a landslide hit a popular campsite in Mount Maunganui."
    },
    {
      "Title": "Trump sparks anger over claim Nato troops avoided Afghan front line",
      "Link": "https://www.bbc.com/news/articles/czr444j671vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:34:42+00:00",
      "Source": "BBC News",
      "Summary": "The US president said allied troops had \u0022stayed a little back\u0022 during the war in Afghanistan."
    },
    {
      "Title": "BBC apologises to sacked presenter over homophobic abuse",
      "Link": "https://www.bbc.com/news/articles/cly51dzw86wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:23:13+00:00",
      "Source": "BBC News",
      "Summary": "An internal investigation found there was a case to answer over several incidents raised by former BBC Radio Cornwall presenter Jack Murley. "
    },
    {
      "Title": "Queen Elizabeth II statue will be standing and not on horseback",
      "Link": "https://www.bbc.com/news/articles/cx2ll7z7l22o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:05:34+00:00",
      "Source": "BBC News",
      "Summary": "The national memorial to the late Queen Elizabeth in St James\u0027s Park will not show her riding a horse as previously illustrated."
    },
    {
      "Title": "The TikTok deal is done, finally",
      "Link": "https://www.theverge.com/tech/866437/tiktok-usds-bytedance-sale-oracle-mgx",
      "Published": "2026-01-23T01:01:16+00:00",
      "Source": "The Verge",
      "Summary": "Just over a year after it briefly disappeared from app stores, TikTok in the US is now part of a new entity, TikTok USDS Joint Venture LLC. With approval from both the US and China closing on the schedule laid out in December, ByteDance\u0027s ownership of the new joint venture is now only 19.9 percent [\u0026#8230;]"
    },
    {
      "Title": "Ring can verify videos now, but that might not help you with most AI fakes",
      "Link": "https://www.theverge.com/news/866441/ring-verify-security-camera-ai-fakes-video-verification",
      "Published": "2026-01-23T00:57:41+00:00",
      "Source": "The Verge",
      "Summary": "Ring has launched a new Ring Verify tool that the company says can \u0022verify that Ring videos you receive haven\u0027t been edited or changed.\u0022 But since Ring won\u0027t verify videos that have been altered in any way, it probably won\u0027t be able to verify those videos you see on TikTok that look like they\u0027re from [\u0026#8230;]"
    },
    {
      "Title": "Hundreds of illegal waste tips operating in England - including 11 \u0027super sites\u0027",
      "Link": "https://www.bbc.com/news/articles/c1ev4yg1j1lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:55:46+00:00",
      "Source": "BBC News",
      "Summary": "A BBC investigation uncovers how criminals are operating huge illegal rubbish tips across the country."
    },
    {
      "Title": "Beyond Good and Evil 2 somehow survived the purge at Ubisoft",
      "Link": "https://www.theverge.com/games/866439/beyond-good-and-evil-2-somehow-survived-the-purge-at-ubisoft",
      "Published": "2026-01-23T00:53:25+00:00",
      "Source": "The Verge",
      "Summary": "In what world does Prince of Persia: The Sands of Time Remake get canceled amid corporate restructuring and yet BG\u0026#38;E2 does not? \u0022Beyond Good \u0026#38; Evil 2 remains a priority for us in the context of our strategy centered around Open World Adventures,\u0022 an unnamed Ubisoft spokesperson told Kotaku and Insider Gaming. The original Beyond [\u0026#8230;]"
    },
    {
      "Title": "Behind the scenes of Help 2, the star-studded charity album",
      "Link": "https://www.bbc.com/news/articles/cy4qqdy29d2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:16:04+00:00",
      "Source": "BBC News",
      "Summary": "Olivia Rodrigo, Arctic Monkeys and Pulp are among the artists who recorded new songs for War Child."
    },
    {
      "Title": "I tried hard to \u0027menopause mask\u0027 like so many women - but it can have consequences",
      "Link": "https://www.bbc.com/news/articles/c23e1n3ge29o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:14:56+00:00",
      "Source": "BBC News",
      "Summary": "Concealing symptoms of menopause can have knock-on effects for some women, such as increasing the risk of burnout"
    },
    {
      "Title": "Retired civil servants left in pension limbo ",
      "Link": "https://www.bbc.com/news/articles/cp9jkdx1gp8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:01:15+00:00",
      "Source": "BBC News",
      "Summary": "Civil service pension scheme failed to pay some pensions and lump sums after transferring to a new administrator."
    },
    {
      "Title": "How 55 seconds left Forest\u0027s Europa League hopes in balance",
      "Link": "https://www.bbc.com/sport/football/articles/c9vxx07nwdno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T23:54:47+00:00",
      "Source": "BBC News",
      "Summary": "Nottingham Forest\u0027s hopes of a top-eight finish in the Europa League - and a straight route to the last 16 - are hanging by a thread after 55 costly seconds lead to defeat by Sporting Braga."
    },
    {
      "Title": "Samsung’s smallest Frame TVs have fallen to their lowest prices to date",
      "Link": "https://www.theverge.com/gadgets/866298/samsung-frame-tv-2025-43-50-inch-qled-woot-deal-sale",
      "Published": "2026-01-22T23:51:39+00:00",
      "Source": "The Verge",
      "Summary": "Unless you\u0026#8217;re dead set on picking up a larger panel, Samsung’s forthcoming 2026 Frame lineup represents a fairly minor upgrade. That makes last year’s model an easy rec for those on the hunt for an art-inspired 4K TV, especially given the 43- and 50-inch models are down to the lowest prices we’ve seen at Woot, [\u0026#8230;]"
    },
    {
      "Title": "A national tragedy 30 years ago united Australia. Why hasn\u0027t the Bondi shooting?",
      "Link": "https://www.bbc.com/news/articles/cx2yy4n1vlgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T23:23:32+00:00",
      "Source": "BBC News",
      "Summary": "Political spats brewing since the tragedy last month have overshadowed a national day of mourning."
    },
    {
      "Title": "Chris Mason: Andy Burnham faces tricky run to win Labour crown",
      "Link": "https://www.bbc.com/news/articles/cvg553rk7zvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T22:40:55+00:00",
      "Source": "BBC News",
      "Summary": "The Greater Manchester mayor must overcome substantial obstacles in order to challenge Keir Starmer."
    },
    {
      "Title": "Nintendo is following up Alarmo with a weird Talking Flower in March",
      "Link": "https://www.theverge.com/tech/865618/nintendo-talking-flower-preorder-super-mario-wonder",
      "Published": "2026-01-22T22:17:23+00:00",
      "Source": "The Verge",
      "Summary": "After sharing a brief look at its new Talking Flower during a Nintendo Direct showcase last September that generated more questions than answers, Nintendo has finally revealed more details about what the interactive toy actually does and how much it costs. It shares some functionality with Nintendo\u0027s Alarmo alarm clock, but the Talking Flower seems [\u0026#8230;]"
    },
    {
      "Title": "Vimeo lays off ‘large portion’ of staff after Bending Spoons buyout",
      "Link": "https://www.theverge.com/news/866238/vimeo-layoffs-bending-spoons-acquisition",
      "Published": "2026-01-22T22:02:50+00:00",
      "Source": "The Verge",
      "Summary": "Vimeo is laying off employees around the globe just months after the Italian software company Bending Spoons acquired the platform for $1.38 billion, as reported earlier by Business Insider. Even though it\u0027s not clear how many people were laid off, Dave Brown, Vimeo\u0027s former brand VP, says in a post on LinkedIn that \u0022a large [\u0026#8230;]"
    },
    {
      "Title": "Epic and Google have a secret $800 million Unreal Engine and services deal",
      "Link": "https://www.theverge.com/policy/866140/epic-google-fortnite-android-unreal-deal-antitrust-settlement",
      "Published": "2026-01-22T21:47:07+00:00",
      "Source": "The Verge",
      "Summary": "A judge is questioning whether Epic Games and Google are settling their long-running antitrust fight partly because of a previously unannounced partnership involving the Unreal Engine, Fortnite, and Android. In a hearing in San Francisco today, the court revealed that Epic and Google have struck a new deal that apparently includes \u0022joint product development, joint [\u0026#8230;]"
    },
    {
      "Title": "Could Trump\u0027s bid to become peacemaker-in-chief sideline the struggling UN?",
      "Link": "https://www.bbc.com/news/articles/cn8jj228g2vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T21:40:18+00:00",
      "Source": "BBC News",
      "Summary": "The US president has promised to \u0022end decades of suffering\u0022 but critics dismiss his Board of Peace as a vainglorious project."
    },
    {
      "Title": "Sen. Markey questions OpenAI about ‘deceptive advertising’ in ChatGPT",
      "Link": "https://www.theverge.com/news/865854/senator-ed-markey-ai-companies-chatbots-advertising",
      "Published": "2026-01-22T21:30:00+00:00",
      "Source": "The Verge",
      "Summary": "Sen. Ed Markey (D-MA) is pressing OpenAI about its move to bring ads to ChatGPT, and is asking several other companies whether they have similar plans. In letters to the CEOs of OpenAI, Anthropic, Google, Meta, Microsoft, Snap, and xAI, Markey writes that embedding ads into AI chatbots \u0022raises significant concerns for consumer protection, privacy, [\u0026#8230;]"
    },
    {
      "Title": "Tesla is finally doing unsupervised robotaxi rides",
      "Link": "https://www.theverge.com/transportation/866165/tesla-robotaxi-unsupervised-austin-texas-safety-monitor",
      "Published": "2026-01-22T21:23:19+00:00",
      "Source": "The Verge",
      "Summary": "Tesla is finally doing unsupervised robotaxi trips in Austin, Texas, according to a video posted on X. Elon Musk reposted the video, congratulating Tesla\u0027s AI team for the milestone. For months, Tesla\u0027s robotaxis in Austin and San Francisco have included safety monitors with access to a kill switch in case of emergency - a fallback [\u0026#8230;]"
    },
    {
      "Title": "Ring says it\u0026#8217;s not giving ICE access to its cameras",
      "Link": "https://www.theverge.com/news/866003/ring-ice-camera-access-flock",
      "Published": "2026-01-22T20:30:27+00:00",
      "Source": "The Verge",
      "Summary": "Ring\u0027s partnership with Flock is sparking renewed online backlash this week, with influencers calling for people to smash their Ring cameras and claiming the company is part of the surveillance state amid heightened concerns over ICE actions. Flock is an AI-powered surveillance camera company that has reportedly allowed government agencies - including ICE - to [\u0026#8230;]"
    },
    {
      "Title": "Harry Styles announces global tour ahead of fourth album release",
      "Link": "https://www.bbc.com/news/articles/c70lljdd2l9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T19:43:32+00:00",
      "Source": "BBC News",
      "Summary": "Shania Twain will be among the special guests set to appear on the Together, Together tour later this year."
    },
    {
      "Title": "What actually is Trump\u0027s \u0027Board of Peace\u0027?",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mwlx55?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T19:34:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump has a bumper second day at Davos after Greendland \u0027deal\u0027."
    },
    {
      "Title": "Weekly quiz: How did this cow surprise scientists?",
      "Link": "https://www.bbc.com/news/articles/c86v5nj39g1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T17:42:37+00:00",
      "Source": "BBC News",
      "Summary": "How much attention did you pay to what happened in the world over the past seven days?"
    },
    {
      "Title": "Osaka has tense exchange with Cirstea at end of match",
      "Link": "https://www.bbc.com/sport/tennis/videos/cedww5w2vq2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T16:56:49+00:00",
      "Source": "BBC News",
      "Summary": "Naomi Osaka has stern enounter with Sorana Cirstea, receiving a frosty handshake and a telling-off from the Romanian as she wins 6-3 4-6 6-2 at the Australian Open."
    },
    {
      "Title": "Sutton\u0027s predictions v \u0027Roy Keane\u0027 - Saipan star Hardwicke",
      "Link": "https://www.bbc.com/sport/football/articles/cn8j42l594mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T16:44:15+00:00",
      "Source": "BBC News",
      "Summary": "BBC Sport football expert Chris Sutton takes on actor Éanna Hardwicke, who plays Roy Keane in the new film Saipan - and AI - with his predictions for this week\u0027s Premier League fixtures."
    },
    {
      "Title": "Is Canada leading the global resistance against Trump?",
      "Link": "https://www.bbc.co.uk/programmes/w3ct719x?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump responded, “no comment” when asked if he\u0027d use force to seize Greenland."
    },
    {
      "Title": "The Loch Capsule dishwasher is small, fast, and efficient — it even sanitizes gadgets",
      "Link": "https://www.theverge.com/reviews/866476/loch-capsule-review-counter-dishwasher-vanlife-tiny-house",
      "Published": "2026-01-24T08:00:00+00:00",
      "Source": "The Verge",
      "Summary": "A dishwasher is a luxury item some people can\u0027t live without. It\u0027s one of the first major kitchen devices I bought just as soon as I could afford one. And now that the kids are grown, it\u0027s the appliance I thought I\u0027d miss most in my nomadic vanlife pursuits. Loch sent me its $459.99 / [\u0026#8230;]"
    },
    {
      "Title": "Pentagon to offer \u0027more limited\u0027 support to US allies in defence strategy shift",
      "Link": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T07:57:00+00:00",
      "Source": "BBC News",
      "Summary": "The Pentagon\u0027s new National Defense Strategy also says China is no longer the top security priority for the US."
    },
    {
      "Title": "Surviving bombs and hunger to become a professional tennis player",
      "Link": "https://www.bbc.com/sport/tennis/articles/cvgrrpp93y3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T07:37:50+00:00",
      "Source": "BBC News",
      "Summary": "Tennis is seen as a rich sport. But many stars, including Novak Djokovic and Elina Svitolina, have forged successful careers from humble beginnings."
    },
    {
      "Title": "Gaethje v Pimblett - predictions for UFC title fight",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/articles/c9dvv90759wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:50:30+00:00",
      "Source": "BBC News",
      "Summary": "The world of MMA deliver their predictions for Paddy Pimblett\u0027s UFC lightweight interim title fight against Justin Gaethje on Saturday."
    },
    {
      "Title": "Tottenham, Bayern and a stand made of chairs - Palhinha\u0027s story",
      "Link": "https://www.bbc.com/sport/football/articles/c62ww08l0n6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:21:37+00:00",
      "Source": "BBC News",
      "Summary": "On-loan Tottenham midfielder Joao Palhinha chats to BBC Sport\u0027s Kelly Somers about his life and career."
    },
    {
      "Title": "How \u0027lucky\u0027 Sinner became biggest winner in near 40C Melbourne heat",
      "Link": "https://www.bbc.com/sport/tennis/articles/c1ev96w4xv6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:14:57+00:00",
      "Source": "BBC News",
      "Summary": "Jannik Sinner\u0027s hopes of a third straight Australian Open title looked close to being over - then he benefitted from the heat creeping towards 40C."
    },
    {
      "Title": "Brighton inflict Everton\u0027s sixth straight home defeat in WSL",
      "Link": "https://www.bbc.com/sport/football/videos/cx2yjpy0v9qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:08:13+00:00",
      "Source": "BBC News",
      "Summary": "Everton\u0027s wait for a first point at Goodison Park this season continues after Brighton hand them a sixth consecutive home defeat in the Women\u0027s Super League."
    },
    {
      "Title": "Women filmed in secret for TikTok content - and then harassed online",
      "Link": "https://www.bbc.com/news/articles/cr7jej2elyyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:00:12+00:00",
      "Source": "BBC News",
      "Summary": "So-called manfluencers wearing smart glasses approach women and then post videos to TikTok."
    },
    {
      "Title": "\u0027Anger at Nato troop insult\u0027 and \u0027Trump delays Chagos surrender\u0027",
      "Link": "https://www.bbc.com/news/articles/cn408md7gdmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:16:51+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s remarks about Nato troops in Afghanistan and his part in the Chagos Islands deal top the papers."
    },
    {
      "Title": "Four attacks in 48 hours: How east Australia\u0027s beaches became a \u0027perfect storm\u0027 for sharks",
      "Link": "https://www.bbc.com/news/articles/c0err023g5lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:11:18+00:00",
      "Source": "BBC News",
      "Summary": "Human-shark encounters in Australia are rising - but experts are keen to point out it isn\u0027t the animals\u0027 fault."
    },
    {
      "Title": "Boy, 12, dies from injuries after Sydney shark attack",
      "Link": "https://www.bbc.com/news/articles/c2k98ql703no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:10:24+00:00",
      "Source": "BBC News",
      "Summary": "Nico Antic was swimming in Sydney Harbour when he was attacked last Sunday."
    },
    {
      "Title": "Hundreds of Minnesota businesses close to protest ICE presence",
      "Link": "https://www.bbc.com/news/articles/c1dk67g4q91o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T03:55:30+00:00",
      "Source": "BBC News",
      "Summary": "Thousands of people have joined widespread protests against the weeks-long immigration crackdown in the state."
    },
    {
      "Title": "Are things going to get better for your finances?",
      "Link": "https://www.bbc.com/news/articles/cn42l3g3qvlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T02:37:45+00:00",
      "Source": "BBC News",
      "Summary": "As Sir Keir Starmer makes the cost of living a government priority, we unpack the impact on family finances."
    },
    {
      "Title": "Pokémon cards: The \u0027liquid asset\u0027 increasingly attracting criminals",
      "Link": "https://www.bbc.com/news/articles/c70lk3w9krxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T02:26:57+00:00",
      "Source": "BBC News",
      "Summary": "Cards related to the popular Japanese animation franchise have soared in value over recent years."
    },
    {
      "Title": "Chromebooks train schoolkids to be loyal customers, internal Google document suggests",
      "Link": "https://www.theverge.com/news/867138/google-chromebook-education-expansion-court-filings",
      "Published": "2026-01-24T01:21:41+00:00",
      "Source": "The Verge",
      "Summary": "Internal documents revealed as part of a child safety lawsuit hint at Google\u0027s plan to \u0022onboard kids\u0022 into its ecosystem by investing in schools. In this November 2020 presentation, Google writes that getting kids into its ecosystem \u0022leads to brand trust and loyalty over their lifetime,\u0022 as reported earlier by NBC News. The heavily-redacted documents, [\u0026#8230;]"
    },
    {
      "Title": "Leak: Nvidia is about to challenge ‘Intel Inside’ with as many as eight Arm laptops",
      "Link": "https://www.theverge.com/games/867056/leak-nvidia-n1-n1x-laptops-lenovo-dell",
      "Published": "2026-01-24T01:09:10+00:00",
      "Source": "The Verge",
      "Summary": "Intel and AMD have split the Windows laptop market for years, but the x86 players may be getting outnumbered. It\u0027s not just Apple MacBooks and MediaTek-based Chromebooks using Arm chips anymore. There are finally competent Qualcomm Snapdragon laptops running Windows, and - as soon as this spring - Nvidia will finally power Windows consumer laptops [\u0026#8230;]"
    },
    {
      "Title": "Explosive bust-ups, secret relationships and extreme reactions: The Traitors\u0027 best moments",
      "Link": "https://www.bbc.com/news/articles/cq84dp4zvy1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:12:54+00:00",
      "Source": "BBC News",
      "Summary": "As another series ends, we look back at the most memorable moments from Stephen\u0027s facial expressions to Matt\u0027s proposition."
    },
    {
      "Title": "Stuck between the US and Russia, Canada must prove it can defend its Arctic territory",
      "Link": "https://www.bbc.com/news/articles/c9vx0p77pn8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:05:27+00:00",
      "Source": "BBC News",
      "Summary": "Canada has been boosting its forces in the Arctic in the face of new threats - and US concerns. "
    },
    {
      "Title": "Tragic chapter on the trains sends rail superpower Spain into crisis",
      "Link": "https://www.bbc.com/news/articles/c0keelnyrvro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:03:57+00:00",
      "Source": "BBC News",
      "Summary": "Spain\u0027s vaunted reputation for its high-speed network has been humbled by disaster on the railways."
    },
    {
      "Title": "\u0027Half of my friends were killed\u0027 - the girls returning to a school caught up in war",
      "Link": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:03:52+00:00",
      "Source": "BBC News",
      "Summary": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies."
    },
    {
      "Title": "The Traitors stars serve up drama in nail-biting final",
      "Link": "https://www.bbc.com/news/articles/c301jg2dlmdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T23:08:35+00:00",
      "Source": "BBC News",
      "Summary": "After three weeks, the latest series of The Traitors came to its dramatic climax in Friday\u0027s finale."
    },
    {
      "Title": "Police officers to be told they must get work licence or face dismissal",
      "Link": "https://www.bbc.com/news/articles/cn0kelpx734o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:52:28+00:00",
      "Source": "BBC News",
      "Summary": "The plans are part of a raft of measures aimed at the reform of police forces in England and Wales. "
    },
    {
      "Title": "Chagos Islands debate delayed as Tories call for halt to bill",
      "Link": "https://www.bbc.com/news/articles/cp372wz0z2zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:48:04+00:00",
      "Source": "BBC News",
      "Summary": "The legislation was due to be debated in Lords on Monday. "
    },
    {
      "Title": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested after years on the run",
      "Link": "https://www.bbc.com/news/articles/cj0nd8z1z59o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:24:59+00:00",
      "Source": "BBC News",
      "Summary": "Wedding, who had been on the FBI\u0027s Ten Most Wanted Fugitives list, is accused of running a transnational drug trafficking operation."
    },
    {
      "Title": "\u0027Trump should apologise\u0027: Anger of veterans and relatives",
      "Link": "https://www.bbc.com/news/articles/c20gzjnv9l5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:10:03+00:00",
      "Source": "BBC News",
      "Summary": "A total of 457 British service personnel were killed fighting in Afghanistan. "
    },
    {
      "Title": "Congress doesn’t seem to know if the TikTok deal complies with its law",
      "Link": "https://www.theverge.com/news/866977/tiktok-deal-congress-china",
      "Published": "2026-01-23T22:08:43+00:00",
      "Source": "The Verge",
      "Summary": "TikTok finally closed a deal meant to bring it into compliance with the law that should have banned it a year ago, and the lawmakers who passed that law still don\u0027t seem to know what\u0027s going on. The company announced Tuesday that its US service is now part of the separate TikTok USDS Joint Venture [\u0026#8230;]"
    },
    {
      "Title": "Chris Mason: Starmer\u0027s strongest rebuke yet for Trump",
      "Link": "https://www.bbc.com/news/articles/c9dvnlvzjw7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:04:12+00:00",
      "Source": "BBC News",
      "Summary": "This past week could mark a turning point in the relationship between the UK prime minister and the US president."
    },
    {
      "Title": "Harry says sacrifices by Nato troops in Afghanistan deserve \u0027respect\u0027 after Trump comments",
      "Link": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T21:50:47+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s comments have been condemned by international allies, including UK veterans and politicians."
    },
    {
      "Title": "England fans\u0027 World Cup arrest record shows Infantino joke inaccurate",
      "Link": "https://www.bbc.com/sport/football/articles/cj0nn0nzvmro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T20:39:49+00:00",
      "Source": "BBC News",
      "Summary": "Did Fifa president Gianni Infantino lean into stereotypes about England fans being arrested at the World Cup?"
    },
    {
      "Title": "Watch: Starmer condemns Trump\u0027s remarks",
      "Link": "https://www.bbc.com/news/videos/c5y3jvrz3zko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T20:11:52+00:00",
      "Source": "BBC News",
      "Summary": "The UK was among several allies to join the US in Afghanistan from 2001, after it invoked Nato\u0027s collective security clause following the 9/11 terror attacks."
    },
    {
      "Title": "Meta is stopping teens from chatting with its AI characters",
      "Link": "https://www.theverge.com/news/866906/meta-teens-ai-characters-stop-block-new-version",
      "Published": "2026-01-23T19:50:59+00:00",
      "Source": "The Verge",
      "Summary": "Meta is \u0022temporarily pausing\u0022 the ability for teens to chat with its AI characters as it develops a \u0022new version\u0022 of the characters that will offer a \u0022better experience.\u0022 The company made the announcement in an update to a blog post from October where the company had detailed more parental controls for teen AI use. [\u0026#8230;]"
    },
    {
      "Title": "What TikTok’s new owners mean for your feed",
      "Link": "https://www.theverge.com/tech/866868/tiktok-usds-new-owners-algorithm-explained",
      "Published": "2026-01-23T19:10:51+00:00",
      "Source": "The Verge",
      "Summary": "TikTok is officially under new ownership in the US, and that could spell big changes for the video-sharing app. On January 22nd, ByteDance - TikTok\u0027s Chinese parent company - and a group of investors closed a $14 billion deal to spin off the platform\u0027s US operations, introducing a new slate of American executives. The Silver [\u0026#8230;]"
    },
    {
      "Title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
      "Link": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T19:02:50+00:00",
      "Source": "BBC News",
      "Summary": "Brits, Canadians and Danes were among those who saw the toughest fighting, writes the BBC\u0027s security correspondent."
    },
    {
      "Title": "Rayner to back calls for Burnham to be allowed to stand in by-election",
      "Link": "https://www.bbc.com/news/articles/c77kexz6k5zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T18:33:50+00:00",
      "Source": "BBC News",
      "Summary": "The Greater Manchester mayor has until Saturday afternoon to decide if he wants to enter the contest to be Labour\u0027s candidate."
    },
    {
      "Title": "Former Tory councillor pleads guilty to drugging and raping wife over 13 years",
      "Link": "https://www.bbc.com/news/articles/c4grr3368n3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T18:18:11+00:00",
      "Source": "BBC News",
      "Summary": "Philip Young admitted committing a number of sexual offences against Joanne Young over 13 years."
    },
    {
      "Title": "Casio teased a retro gaming-inspired sampler",
      "Link": "https://www.theverge.com/news/866709/casio-sx-c1-retro-gaming-inspired-sampler-at-namm",
      "Published": "2026-01-23T18:10:28+00:00",
      "Source": "The Verge",
      "Summary": "Casio showed up to NAMM (CES for music gear nerds) this year with a prototype sampler called the SX-C1 that looks every bit the lovechild of a Game Boy and an SP-404. The top has a directional pad and four buttons just like you\u0027d find on a game controller, flanking a 1.3-inch OLED screen. But [\u0026#8230;]"
    },
    {
      "Title": "The best instant cameras you can buy right now",
      "Link": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
      "Published": "2026-01-23T18:01:09+00:00",
      "Source": "The Verge",
      "Summary": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera [\u0026#8230;]"
    },
    {
      "Title": "Hang on, there’s a Trump Phone Ultra coming too?",
      "Link": "https://www.theverge.com/news/866601/trump-mobile-t1-ultra-phone-don-hendrickson-interview",
      "Published": "2026-01-23T17:27:22+00:00",
      "Source": "The Verge",
      "Summary": "Where\u0027s the Trump Phone? We\u0027re going to keep talking about it every week. We\u0027ve reached out, as usual, to ask about the Trump Phone\u0027s whereabouts. As usual, we\u0027re still waiting for a response. In the meantime, it turns out we might have two Trump Phones to worry about. The Trump Phone may be no more [\u0026#8230;]"
    },
    {
      "Title": "Robbie Williams breaks The Beatles\u0027 chart record",
      "Link": "https://www.bbc.com/news/articles/c93vv02wz3ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T16:59:47+00:00",
      "Source": "BBC News",
      "Summary": "The star\u0027s latest album, Britpop, debuts at number one, giving Williams his 16th solo UK chart-topper."
    },
    {
      "Title": "Marshall’s new hub connects to multiple Bluetooth speakers without pairing",
      "Link": "https://www.theverge.com/tech/866640/marshall-music-streaming-hub-heddon-bluetooth-auracast-speakers",
      "Published": "2026-01-23T16:54:01+00:00",
      "Source": "The Verge",
      "Summary": "Marshall has announced a new music streaming hub called the Heddon that can broadcast to multiple speakers using the Bluetooth Auracast feature that\u0027s finally starting to catch on. Similar to Sennheiser\u0027s BTA1 TV Transmitter announced earlier this week, the Heddon doesn\u0027t require wireless audio devices to go through a pairing process to stream audio, as [\u0026#8230;]"
    },
    {
      "Title": "Brooklyn Beckham\u0027s wedding DJ speaks about \u0027awkward\u0027 dance",
      "Link": "https://www.bbc.com/news/articles/cp8220err46o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T13:10:09+00:00",
      "Source": "BBC News",
      "Summary": "The groom has said his mother Victoria \u0022danced very inappropriately on me in front of everyone\u0022."
    },
    {
      "Title": "First all-female British team completes 8,000km Dakar Rally",
      "Link": "https://www.bbc.com/news/articles/c0erx543ww5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T16:43:36+00:00",
      "Source": "BBC News",
      "Summary": "Marcella Kirk and Helen Tait-Wright complete the 8,000km (4,970-mile) Dakar Rally in Saudi Arabia."
    },
    {
      "Title": "The retired silversmith turning used candles into stoves for Ukraine",
      "Link": "https://www.bbc.com/news/articles/ce9yvd290l4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:29:56+00:00",
      "Source": "BBC News",
      "Summary": "Mark Stevens has supplied thousands of candles to war damaged areas of Ukraine."
    },
    {
      "Title": "The 3,500-mile love story that started in an online horror game",
      "Link": "https://www.bbc.com/news/articles/cn42lnl4yw9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:13:20+00:00",
      "Source": "BBC News",
      "Summary": "Despite living in the same house, they are no longer able to video game together because of childcare."
    },
    {
      "Title": "Climber Alex Honnold scales 101-floor skyscraper without safety gear",
      "Link": "https://www.bbc.com/news/articles/c4gl0njzxjdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T08:06:16+00:00",
      "Source": "BBC News",
      "Summary": "Alex Honnold has become the first person to climb the Taiwanese building alone without safety equipment."
    },
    {
      "Title": "Jovic, 18, sets up Sabalenka quarter-final in Melbourne",
      "Link": "https://www.bbc.com/sport/tennis/articles/ce8gn94jq3jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T08:03:45+00:00",
      "Source": "BBC News",
      "Summary": "Teenager Iva Jovic is \u0022excited\u0022 to test herself against \u0022the best\u0022 after booking an Australian Open quarter-final against Aryna Sabalenka."
    },
    {
      "Title": "\u0027I know my role\u0027 - O\u0027Sullivan on Liverpool challenge",
      "Link": "https://www.bbc.com/sport/football/articles/c701kj7p757o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:49:56+00:00",
      "Source": "BBC News",
      "Summary": "It was an \u0022emotional\u0022 decision by Denise O\u0027Sullivan to leave North Carolina Courage but the challenge at Liverpool was an exciting one."
    },
    {
      "Title": "\u0027British FBI\u0027 to take over terror and fraud probes in reforms to police",
      "Link": "https://www.bbc.com/news/articles/cm2yr95md71o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:35:29+00:00",
      "Source": "BBC News",
      "Summary": "The home secretary says policing is stuck \u0022in a different century\u0022 and the new body will form part of wider reforms. "
    },
    {
      "Title": "Storm damage forces closure of railway line",
      "Link": "https://www.bbc.com/news/articles/ce8gldd9zyyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:33:25+00:00",
      "Source": "BBC News",
      "Summary": "The Dawlish railway line is closed \u0022until further notice\u0022 after a sea wall partially collapsed."
    },
    {
      "Title": "Fancy buying a home that inspired a Turner painting? It\u0027s yours for £1.5m",
      "Link": "https://www.bbc.com/news/articles/c3dm87v8dp8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:32:58+00:00",
      "Source": "BBC News",
      "Summary": "The Grade II-listed watermill dates back hundreds of years and inspired the renowned artist."
    },
    {
      "Title": "Arrests after protesters breach London prison grounds",
      "Link": "https://www.bbc.com/news/articles/cvgdky8j43lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:23:59+00:00",
      "Source": "BBC News",
      "Summary": "The group were protesting in support of an alleged Palestine Action prisoner on a hunger strike at HMP Wormwood Scrubs, police say."
    },
    {
      "Title": "NFL play-off predictions - who will make the Super Bowl?",
      "Link": "https://www.bbc.com/sport/american-football/articles/c801jernd09o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:14:08+00:00",
      "Source": "BBC News",
      "Summary": "See who BBC Sport\u0027s panel of experts have picked out to make Super Bowl 60 from Sunday\u0027s Championship games, and make your selections."
    },
    {
      "Title": "White hails Pimblett\u0027s toughness in loss to Gaethje",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/videos/c7v0jv219vqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T07:12:47+00:00",
      "Source": "BBC News",
      "Summary": "UFC president Dana White credits Paddy Pimblett\u0027s toughness, but believes he \u0022did not have the right game plan\u0022 during his loss to Justin Gaethje at UFC 324."
    },
    {
      "Title": "Bereaved parents fear delays to social media ban could harm children",
      "Link": "https://www.bbc.com/news/articles/cp825p2g2rgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T06:36:16+00:00",
      "Source": "BBC News",
      "Summary": "The mothers of Brianna Ghey and Jools Roome say Ofcom needs to do more to protect young people."
    },
    {
      "Title": "Gaethje bloodies and breaks Pimblett\u0027s heart at UFC 324",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/articles/c8j3xndjzn7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T06:30:04+00:00",
      "Source": "BBC News",
      "Summary": "A bloodied Paddy Pimblett loses to Justin Gaethje as the American claims the interim lightweight UFC title in Las Vegas."
    },
    {
      "Title": "Labour\u0027s \u0027heated rivalry\u0027 and \u0027Trump backs down\u0027",
      "Link": "https://www.bbc.com/news/articles/cdre244g35eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T04:36:55+00:00",
      "Source": "BBC News",
      "Summary": "Andy Burnham\u0027s decision to run for a by-election and the latest on Trump\u0027s Nato comments lead the papers."
    },
    {
      "Title": "What we know about fatal shooting of Alex Pretti by federal agents in Minneapolis",
      "Link": "https://www.bbc.com/news/articles/c20zjyxep99o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T04:19:46+00:00",
      "Source": "BBC News",
      "Summary": "Trump officials says federal agents shot in self-defence, as Pretti\u0027s parents accuse them of \u0022sickening lies\u0022."
    },
    {
      "Title": "Video shows moments around fatal shooting in Minneapolis",
      "Link": "https://www.bbc.com/news/videos/cp372pqq2rlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T03:34:28+00:00",
      "Source": "BBC News",
      "Summary": "Officials identified the man who was shot as 37-year-old Alex Pretti, a nurse and US citizen."
    },
    {
      "Title": "Woman \u0027violated\u0027 by webcam in Giggling Squid loos",
      "Link": "https://www.bbc.com/news/articles/c79rxy9npj4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T02:16:46+00:00",
      "Source": "BBC News",
      "Summary": "The woman finds a recording device connected to the internet under a toilet seat."
    },
    {
      "Title": "Let public buy war bonds to raise £20bn for defence, say Lib Dems ",
      "Link": "https://www.bbc.com/news/articles/cq5y7edg169o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T02:12:17+00:00",
      "Source": "BBC News",
      "Summary": "Liberal Democrat leader Sir Ed Davey says the bonds would \u0022give ordinary people the opportunity to contribute to Britain\u0027s security\u0022. "
    },
    {
      "Title": "The day of the second killing",
      "Link": "https://www.theverge.com/policy/867410/minneapolis-ice-protest-alex-pretti-killing",
      "Published": "2026-01-25T02:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Steven Garcia, as told to Gaby Del Valle: I was in the middle of a frozen lake when I got the notification from the Minnesota Star Tribune that there had been a shooting. I was on assignment at a pond hockey event, and someone who was supposed to play later that evening said he probably [\u0026#8230;]"
    },
    {
      "Title": "Cosmetic surgeon sorry for picking apart singer Troye Sivan\u0027s looks on TikTok",
      "Link": "https://www.bbc.com/news/articles/czx11kw42jeo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T01:58:38+00:00",
      "Source": "BBC News",
      "Summary": "The singer hit out at Dr Zayn Khalid Majeed - who says he will try to have a positive impact with his content."
    },
    {
      "Title": "Ros Atkins on... How popular is President Trump?",
      "Link": "https://www.bbc.com/news/videos/cn8jje0pypro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T01:33:57+00:00",
      "Source": "BBC News",
      "Summary": "BBC Analysis Editor Ros Atkins explores how Americans feel about their president during a nonstop start to 2026 shaped by pivotal events at home and abroad."
    },
    {
      "Title": "Five ways weight-loss jabs are changing spending habits",
      "Link": "https://www.bbc.com/news/articles/cj6wy85l3x5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T01:11:19+00:00",
      "Source": "BBC News",
      "Summary": "With GLP-1 drugs rising in popularity, how are businesses adapting to a new type of consumer?"
    },
    {
      "Title": "Knitwear, jumpsuits and Cluedo: Traitors fashion explained",
      "Link": "https://www.bbc.com/news/articles/ce9y1747z3go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T01:04:21+00:00",
      "Source": "BBC News",
      "Summary": "It\u0027s not just what they say or how they act that influences their fellow contestants - it\u0027s how they dress, too."
    },
    {
      "Title": "\u0027We knew the truth\u0027: How parents uncovered Scottish hospital\u0027s infected water scandal",
      "Link": "https://www.bbc.com/news/articles/cdxje77782jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T01:00:40+00:00",
      "Source": "BBC News",
      "Summary": "Dozens of patients became more unwell and some died with infections picked up at Glasgow\u0027s Queen Elizabeth University Hospital."
    },
    {
      "Title": "I joined the Tories for the partying, says Kemi Badenoch",
      "Link": "https://www.bbc.com/news/articles/crkrrknxe08o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T00:54:33+00:00",
      "Source": "BBC News",
      "Summary": "The Tory leader opens up about her life and career - and chooses her favourite music - on Radio 4\u0027s Desert Island Discs."
    },
    {
      "Title": "As the world inches back to a pre-WW2 order, the \u0027middle powers\u0027 face a grave new challenge",
      "Link": "https://www.bbc.com/news/articles/c99kkerr93ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T00:25:51+00:00",
      "Source": "BBC News",
      "Summary": "With economic stagnation and extremes of inequality comes corrosion of trust in democratic institutions. So Trump may be a symptom, not a cause, of what Carney called a \u0022rupture\u0022 with the post-WW2 order"
    },
    {
      "Title": "Peace talks on Russia-Ukraine war end as fighting rages ",
      "Link": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T23:37:38+00:00",
      "Source": "BBC News",
      "Summary": "No breakthrough is reported at the first three-way talks but reports suggest they will resume next month."
    },
    {
      "Title": "Microsoft handed the government encryption keys for customer data",
      "Link": "https://www.theverge.com/news/867244/microsoft-bitlocker-privacy-fbi",
      "Published": "2026-01-24T22:39:57+00:00",
      "Source": "The Verge",
      "Summary": "The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam - and Microsoft complied. Typically, companies resist handing over encryption keys to authorities. Most famously, [\u0026#8230;]"
    },
    {
      "Title": "Trump says UK soldiers in Afghanistan \u0027among greatest of all\u0027 after anger over Nato remarks",
      "Link": "https://www.bbc.com/news/articles/c3edwx37pd9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T20:48:34+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s praise follows his claim that allied forces avoided the front lines during the Afghanistan conflict. "
    },
    {
      "Title": "\u0027Joyless and toxic\u0027 - will Spurs put Frank out of his misery?",
      "Link": "https://www.bbc.com/sport/football/articles/cd7z0jplzd9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T19:58:07+00:00",
      "Source": "BBC News",
      "Summary": "Tottenham manager Thomas Frank remains in deep trouble despite his side rescuing a late draw at Burnley, writes Phil McNulty."
    },
    {
      "Title": "Andy Burnham seeks permission to stand in by-election to become MP",
      "Link": "https://www.bbc.com/news/articles/cn408vmxrg8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T19:13:36+00:00",
      "Source": "BBC News",
      "Summary": "He says in a statement that he wants to back the Labour government \u0022not undermine it\u0022."
    },
    {
      "Title": "MicroSD Express cards and Anker’s travel adapter rule the deal roost this week",
      "Link": "https://www.theverge.com/gadgets/866788/anker-nano-travel-adapter-samsung-p9-microsd-express-card-deal-sale",
      "Published": "2026-01-24T18:21:02+00:00",
      "Source": "The Verge",
      "Summary": "Welcome to the weekend, friends! We’re still in a bit of a deals lull before the Presidents Day and V-Day sales begin, the bulk of which we anticipate kicking off the first week of February. However, for now, we’re still seeing some solid discounts on a few newer gadgets and some old, Verge-approved favorites. Anker’s [\u0026#8230;]"
    },
    {
      "Title": "Gmail’s spam filter and automatic sorting are broken",
      "Link": "https://www.theverge.com/tech/867247/gmails-spam-filter-broken",
      "Published": "2026-01-24T17:54:10+00:00",
      "Source": "The Verge",
      "Summary": "Some Gmail users may have noticed that promotional emails that normally go to their own siloed tab have started flooding their inbox. Reports hit the Google forums and Reddit that messages are bypassing the Updates and Promotional filters and went straight to Gmail inboxes. Some also reported seeing a banner at the top of some [\u0026#8230;]"
    },
    {
      "Title": "ICE has killed another person in Minneapolis",
      "Link": "https://www.theverge.com/news/867245/ice-has-killed-another-person-in-minneapolis",
      "Published": "2026-01-24T16:54:32+00:00",
      "Source": "The Verge",
      "Summary": "Federal agents in Minneapolis repeatedly punched a man, forced him to the ground, and then shot him multiple times. The man was later pronounced dead. This is just the latest incident of deadly violence involving ICE, which has grown increasingly frequent, especially on the streets of Minneapolis. It\u0027s been less than three weeks since an [\u0026#8230;]"
    },
    {
      "Title": "Gaming\u0026#8217;s most fun sales data is full of old and obscure games",
      "Link": "https://www.theverge.com/games/867004/circana-gaming-sales-data-mat-piscatella-one-copy-obscure-games",
      "Published": "2026-01-24T16:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Every month, Circana video game analyst Mat Piscatella posts fascinating data about video game sales on Bluesky, highlighting trends like November\u0027s historically bad month for game hardware and Battlefield 6\u0027s big launch in October. But he doesn\u0027t just share data about what is selling the most; as of late, he\u0027s also posted delightful lists of [\u0026#8230;]"
    },
    {
      "Title": "I have to go home and tell my children it\u0027s not nice to lie, says The Traitors\u0027 Rachel",
      "Link": "https://www.bbc.com/news/articles/c8e5g57dpx0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T15:12:31+00:00",
      "Source": "BBC News",
      "Summary": "From poker faces to genuine shock, Rachel\u0027s game face was on par to get her through some serious heat amongst fellow competitors. "
    },
    {
      "Title": "Get ready for the AI ad-pocalypse",
      "Link": "https://www.theverge.com/report/866775/ai-generated-ads-slop-human-creativity",
      "Published": "2026-01-24T15:00:00+00:00",
      "Source": "The Verge",
      "Summary": "I\u0027ll confess, with no shame whatsoever, that I really love ads. Artsy ones, funny ones, weird ones, emotional ones - TV commercials were my childhood TikTok before any of us were using terms like \u0022short-form video.\u0022 But like most creative things in my life, AI is sucking the joy out of it. And it\u0027s only [\u0026#8230;]"
    },
    {
      "Title": "This coming-of-age adventure game made me feel a little too seen",
      "Link": "https://www.theverge.com/entertainment/865082/perfect-tides-station-to-station-review-steam",
      "Published": "2026-01-24T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "There\u0027s a lot about Perfect Tides: Station to Station\u0027s Mara that I find relatable. Like me, she\u0027s recently moved to a place simply called \u0022the City\u0022 from the middle of nowhere, and like me, she\u0027s an avid writer. But these biographical details aren\u0027t the important thing; it\u0027s the way she\u0027s painted by the game\u0027s incredibly [\u0026#8230;]"
    },
    {
      "Title": "Gemini with Personal Intelligence is awfully familiar",
      "Link": "https://www.theverge.com/tech/866931/gemini-personal-intelligence-ai",
      "Published": "2026-01-24T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "By lots of metrics, Gemini is winning. It has raced ahead of OpenAI, become scarily good at creating convincing imagery, and even won Apple\u0027s business. So last week\u0027s news that it was enabling something called Personal Intelligence felt like a victory lap. Personal Intelligence allows Gemini to reference past conversations and access your data in [\u0026#8230;]"
    },
    {
      "Title": "Get stuff done by yelling at your phone",
      "Link": "https://www.theverge.com/tech/866946/todoist-ramble-nexphone-crossplay-installe",
      "Published": "2026-01-24T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Hi, friends! Welcome to Installer No. 113, your guide to the best and Verge-iest stuff in the world. (If you\u0027re new here, welcome, please send hot cocoa to my freezing-cold house, and also you can read all the old editions at the Installer homepage.) This week, I\u0027ve been reading about private garbage collectors and vintage [\u0026#8230;]"
    },
    {
      "Title": "Labour wants to shake up the police - but will that solve \u0027everyday crime epidemic\u0027?",
      "Link": "https://www.bbc.com/news/articles/c2k98jw3xnxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T12:27:09+00:00",
      "Source": "BBC News",
      "Summary": "The home secretary is promising the biggest policing reform in centuries, but she faces a fight, writes Laura Kuenssberg."
    },
    {
      "Title": "The Traitors moves from TV to theatre with \u0027bold\u0027 West End show",
      "Link": "https://www.bbc.com/news/articles/c0r4jwkl2vqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T08:00:07+00:00",
      "Source": "BBC News",
      "Summary": "The TV show\u0027s makers hope its dramatic twists and huge popularity will translate into a theatre hit."
    },
    {
      "Title": "Pegula ends Keys title defence to win \u0027gross\u0027 apple pie bet",
      "Link": "https://www.bbc.com/sport/tennis/articles/cp3z8dxzjjdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T07:41:16+00:00",
      "Source": "BBC News",
      "Summary": "Jessica Pegula ends Madison Keys\u0027 Australian Open title defence to reach the quarter-finals and win a \u0022gross\u0022 apple pie bet."
    },
    {
      "Title": "Minneapolis protesters march against ICE as governor demands Trump remove agents",
      "Link": "https://www.bbc.com/news/articles/cr571qg4m61o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T07:31:46+00:00",
      "Source": "BBC News",
      "Summary": "Tim Walz says the city\u0027s second fatal shooting this month is an \u0022inflection point\u0022 as protests spread over the death of Alex Pretti. "
    },
    {
      "Title": "Make sure pupils don\u0027t ever use phones at school, Phillipson tells teachers",
      "Link": "https://www.bbc.com/news/articles/cgk827r8mrzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T07:31:23+00:00",
      "Source": "BBC News",
      "Summary": "The education secretary says phones should not been seen during lessons, breaktimes or lunchtime."
    },
    {
      "Title": "Second body found in search for missing Christmas Day swimmers",
      "Link": "https://www.bbc.com/news/articles/cn7j8k012kxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T06:51:46+00:00",
      "Source": "BBC News",
      "Summary": "The recovered body is believed to be a 64-year-old man from Budleigh Salterton."
    },
    {
      "Title": "F1 testing begins - but why all the secrecy?",
      "Link": "https://www.bbc.com/sport/formula1/articles/cgl8dxrr302o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T06:33:23+00:00",
      "Source": "BBC News",
      "Summary": "BBC F1 correspondent Andrew Benson looks ahead to the first F1 test of 2026, which is happening in private in Barcelona."
    },
    {
      "Title": "\u0027Starmer triggers Labour civil war\u0027 and \u0027Republicans break ranks\u0027",
      "Link": "https://www.bbc.com/news/articles/c07x0d8283no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T05:47:31+00:00",
      "Source": "BBC News",
      "Summary": "Labour\u0027s move to block Andy Burnham\u0027s return to parliament dominates Sunday\u0027s papers."
    },
    {
      "Title": "At least seven dead and 800,000 without power as major winter storm hits US",
      "Link": "https://www.bbc.com/news/articles/c1klrmz90yjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T04:38:19+00:00",
      "Source": "BBC News",
      "Summary": "Almost half of US states have declared emergencies as officials warn of \u0022life threatening conditions\u0022 that could affect 180 million people."
    },
    {
      "Title": "Fifteen dead after Philippines ferry with 300 passengers sinks",
      "Link": "https://www.bbc.com/news/articles/cwy1vpqpy23o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T04:06:14+00:00",
      "Source": "BBC News",
      "Summary": "The local coast guard is still searching for 28 missing passengers of the MV Trisha Kerstin."
    },
    {
      "Title": "Seahawks to face Patriots in Super Bowl 60",
      "Link": "https://www.bbc.com/sport/american-football/articles/cdxjdyrn1wpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T03:58:52+00:00",
      "Source": "BBC News",
      "Summary": "The Seattle Seahawks will face the New England Patriots in Super Bowl 60 after claiming a thrilling victory over the Los Angeles Rams on Sunday."
    },
    {
      "Title": "\u0027This is horrifying\u0027 - Minneapolis residents reel from second deadly shooting",
      "Link": "https://www.bbc.com/news/articles/cvg50vv1ezko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T03:50:14+00:00",
      "Source": "BBC News",
      "Summary": "Two people have been shot dead by federal agents in the city in recent weeks, leaving many angry and frustrated."
    },
    {
      "Title": "Tearful goodbyes as Japan returns pandas to China amid worsening ties ",
      "Link": "https://www.bbc.com/news/articles/c8d0l778dero?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T03:08:21+00:00",
      "Source": "BBC News",
      "Summary": "The twin cubs\u0027 departure will leave Japan without any pandas for the first time since 1972."
    },
    {
      "Title": "Gold tops $5,000 for first time ever, adding to historic rally",
      "Link": "https://www.bbc.com/news/articles/cvgd8kj2y2po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T01:02:44+00:00",
      "Source": "BBC News",
      "Summary": "Gold is seen as a so-called safe-haven asset that investors buy in times of uncertainty and low interest rates."
    },
    {
      "Title": "\u0027I spent £2,000 on one event\u0027: Why Gen Z is obsessed with Hyrox",
      "Link": "https://www.bbc.com/news/articles/cj0nmj72v8ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T00:45:40+00:00",
      "Source": "BBC News",
      "Summary": "How young millennials and Generation Z - people in their twenties to early forties - have become obsessed with this fitness craze."
    },
    {
      "Title": "UK to join major wind farm project with nine European countries",
      "Link": "https://www.bbc.com/news/articles/cp372d37gxgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T00:43:21+00:00",
      "Source": "BBC News",
      "Summary": "For the first time, the new wind farms will be connected to more than one country through undersea cables."
    },
    {
      "Title": "Thousands of children facing \u0027catastrophic\u0027 waits for NHS community care",
      "Link": "https://www.bbc.com/news/articles/c1kllz30ek7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T00:37:45+00:00",
      "Source": "BBC News",
      "Summary": "A quarter of the 300,000 children waiting for community NHS care have spent more than a year waiting."
    },
    {
      "Title": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret",
      "Link": "https://www.bbc.com/news/articles/c1w94v205y2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T00:25:19+00:00",
      "Source": "BBC News",
      "Summary": "Can the state, especially when it is implicated in killing, be trusted as the arbiter of what should remain confidential?"
    },
    {
      "Title": "Russia using Interpol\u0027s wanted list to target critics abroad, leak reveals",
      "Link": "https://www.bbc.com/news/articles/c20gg729y1yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T00:15:03+00:00",
      "Source": "BBC News",
      "Summary": "A leak exposes for the first time the extent of Russia’s misuse of Interpol to request the arrest of critics."
    },
    {
      "Title": "\u0027Another unbelievable result\u0027 - but what\u0027s different about Man Utd now?",
      "Link": "https://www.bbc.com/sport/football/articles/c62vk5l68x3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T23:26:18+00:00",
      "Source": "BBC News",
      "Summary": "MOTD pundit Danny Murphy explains how Manchester United earned their impressive win at Premier League leaders Arsenal, and how he feels the Gunners will react."
    },
    {
      "Title": "Mahmood to call for more police patrols and faster responses to 999 calls",
      "Link": "https://www.bbc.com/news/articles/c4gwx2271xzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T22:33:55+00:00",
      "Source": "BBC News",
      "Summary": "The Home Office says its plans to cut red tape will see officers spending more time out on the streets."
    },
    {
      "Title": "NRA stresses right to carry weapons in wake of Minneapolis shooting",
      "Link": "https://www.bbc.com/news/articles/cnvg812n01no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T22:29:48+00:00",
      "Source": "BBC News",
      "Summary": "The gun-lobby group, typically aligned with Trump, criticises a suggestion that those who carry guns risk being lawfully shot."
    },
    {
      "Title": "Liverpool\u0027s Robertson unlikely to move to Spurs",
      "Link": "https://www.bbc.com/sport/football/articles/c6205841mngo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T22:19:48+00:00",
      "Source": "BBC News",
      "Summary": "Liverpool left-back Andy Robertson looks set to remain at Anfield after the Reds decide they are currently unable to proceed with a deal to sell him to Tottenham."
    },
    {
      "Title": "Analysing the shooting frame by frame",
      "Link": "https://www.bbc.com/news/videos/cg4e0r1el5yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T22:04:22+00:00",
      "Source": "BBC News",
      "Summary": "BBC Verify has analysed footage of the shooting from multiple angles, piecing together a detailed picture of what happened."
    },
    {
      "Title": "Labour Block Andy Burnham From Standing",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mx4v36?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T21:33:00+00:00",
      "Source": "BBC News",
      "Summary": "Andy Burnham \u0027disappointed\u0027 after bid to become MP blocked"
    },
    {
      "Title": "Venezuela frees dozens of political prisoners, human rights group says",
      "Link": "https://www.bbc.com/news/articles/clymr3pz2kxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T18:29:57+00:00",
      "Source": "BBC News",
      "Summary": "It is the latest batch of detainees freed since the US seized Venezuelan President Nicolás Maduro in a raid."
    },
    {
      "Title": "Chris Mason: Burnham saga unlikely to be last act in drama of Starmer\u0027s leadership",
      "Link": "https://www.bbc.com/news/articles/cpwnjdnz2n5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T17:41:21+00:00",
      "Source": "BBC News",
      "Summary": "In a show of brute power, No 10 has scuppered Burnham’s attempted run from Manchester to Westminster."
    },
    {
      "Title": "Creators and communities everywhere take a stand against ICE",
      "Link": "https://www.theverge.com/policy/867451/creators-and-communities-take-a-stand-against-ice",
      "Published": "2026-01-25T17:21:43+00:00",
      "Source": "The Verge",
      "Summary": "It\u0027s not surprising when the guy who\u0027s been yelling about the horrors of late-stage capitalism on Instagram for the last five years turns his ire towards ICE. But something different has been happening over the week or so, following the most recent shootings of civilians by federal agents - even accounts that stay laser focused [\u0026#8230;]"
    },
    {
      "Title": "It doesn’t matter if Alex Pretti had a gun",
      "Link": "https://www.theverge.com/policy/867455/dhs-ice-border-patrol-minneapolis-alex-pretti",
      "Published": "2026-01-25T17:01:38+00:00",
      "Source": "The Verge",
      "Summary": "Shortly after federal agents killed Alex Pretti Saturday morning, the Department of Homeland Security began to run with the story that the dead man had been armed and dangerous. He had a gun, DHS said. (A Bellingcat analysis of the video concludes that Pretti was unarmed when he was shot.) He had approached the agents [\u0026#8230;]"
    },
    {
      "Title": "Trusting your phone to Abxylute’s mobile controller requires a big leap of faith",
      "Link": "https://www.theverge.com/tech/864821/abxylute-m4-snap-on-mobile-controller-magsafe-magnetic-bluetooth",
      "Published": "2026-01-25T16:00:00+00:00",
      "Source": "The Verge",
      "Summary": "As a retro gaming fan, I was thrilled when Apple opened its App Store to emulators in 2024, but I\u0027ve yet to find a controller that makes me want to fully embrace retro gaming on my phone. Clamp-on controllers like the Backbone Pro are a bit too bulky, and I don\u0027t want to prop my [\u0026#8230;]"
    },
    {
      "Title": "Why won’t anyone stop ICE from masking?",
      "Link": "https://www.theverge.com/policy/867202/ice-mask-ban-no-secret-police-california",
      "Published": "2026-01-25T15:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Americans do not like masked secret police. There is really no other way to put it. The reasons why are manifold: accountability, trust in law enforcement, and just plain overall vibes. More concretely, not being able to tell who\u0027s a cop and who\u0027s not is dangerous. An assassin masquerading as law enforcement killed Minnesota legislator [\u0026#8230;]"
    },
    {
      "Title": "Sony’s first clip earbuds don’t quite hit the mark",
      "Link": "https://www.theverge.com/tech/866975/sony-linkbuds-clip-open-earbuds-review",
      "Published": "2026-01-25T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "The Sony LinkBuds Clip are the company\u0027s first clip earbuds. They follow the innovative donut-hole LinkBuds and LinkBuds Open and, like their predecessors, allow you to listen to music or podcasts, make phone calls, or be active outdoors while still maintaining awareness of your surroundings. The clip design has become more popular over the past [\u0026#8230;]"
    },
    {
      "Title": "The great e-bike crackdown has begun",
      "Link": "https://www.theverge.com/column/866218/e-bike-crackdown",
      "Published": "2026-01-25T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on the e-bike movement, follow Andrew J. Hawkins. The Stepback arrives in our subscribers\u0027 inboxes at 8AM ET. Opt in for The Stepback here. How it started Last week, I did something I don\u0027t typically do, which [\u0026#8230;]"
    },
    {
      "Title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
      "Link": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T12:24:31+00:00",
      "Source": "BBC News",
      "Summary": "He has been described as an avid outdoorsman who loved mountain biking."
    },
    {
      "Title": "Are ICE immigration agents acting outside the law?",
      "Link": "https://www.bbc.co.uk/sounds/play/w3ct8bz1?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T16:16:00+00:00",
      "Source": "BBC News",
      "Summary": "Immigration raids in Minneapolis are dividing America"
    },
    {
      "Title": "Ground rent to be capped at £250 in England and Wales",
      "Link": "https://www.bbc.com/news/articles/cdjn7jdvn7no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T08:07:09+00:00",
      "Source": "BBC News",
      "Summary": "The reforms for England and Wales will be published in a draft bill, which will be introduced later."
    },
    {
      "Title": "India and EU announce landmark trade deal",
      "Link": "https://www.bbc.com/news/articles/crrnee01r9jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T07:43:20+00:00",
      "Source": "BBC News",
      "Summary": "The long-awaited deal comes as both Delhi and Brussels contend with economic and geopolitical pressure from the US."
    },
    {
      "Title": "Philippines\u0027 Duterte fit to face ICC proceedings, judges say",
      "Link": "https://www.bbc.com/news/articles/c0lx2pj84l4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T07:12:55+00:00",
      "Source": "BBC News",
      "Summary": "The 80-year-old is accused of crimes of humanity over his bloody war on drugs that left thousands killed."
    },
    {
      "Title": "Fifty Labour MPs sign letter objecting to Burnham decision",
      "Link": "https://www.bbc.com/news/articles/ce3e53e34klo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T06:54:46+00:00",
      "Source": "BBC News",
      "Summary": "Labour\u0027s ruling National Executive Committee blocked the Greater Manchester mayor from standing in a by-election."
    },
    {
      "Title": "BBC at protests outside hotel where Trump\u0027s immigration chief believed to be staying",
      "Link": "https://www.bbc.com/news/videos/crmlpnjjk28o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T06:11:08+00:00",
      "Source": "BBC News",
      "Summary": "Protesters spent the evening banging drums and chanting outside the hotel where immigration official Gregory Bovino is reportedly staying, the BBC\u0027s Tom Bateman reports."
    },
    {
      "Title": "Only one known person in the world can save my life",
      "Link": "https://www.bbc.com/news/articles/c2lggpjrw8jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T06:07:31+00:00",
      "Source": "BBC News",
      "Summary": "Sian Chathyoka is preparing to receive a lifesaving donation from a \u0022selfless stranger\u0022."
    },
    {
      "Title": "I accused a police officer of rape, but I ended up on trial",
      "Link": "https://www.bbc.com/news/articles/c4gl0r0052po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T06:01:09+00:00",
      "Source": "BBC News",
      "Summary": "How a secret audio recording played in court helped clear a woman accused of making a false rape allegation."
    },
    {
      "Title": "\u0027Trophy or nothing\u0027 - Sabalenka overpowers teenager Jovic to reach semis",
      "Link": "https://www.bbc.com/sport/tennis/articles/c5y27pg54zdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T05:56:45+00:00",
      "Source": "BBC News",
      "Summary": "Aryna Sabalenka says it is \u0022trophy or nothing\u0022 after brushing aside teenage star Iva Jovic to reach the Australian Open semi-finals."
    },
    {
      "Title": "Instagram, Facebook and WhatsApp to trial premium subscriptions",
      "Link": "https://www.bbc.com/news/articles/ce8rpdmm284o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T05:37:52+00:00",
      "Source": "BBC News",
      "Summary": "Under the plan, access to Meta platforms\u0027 core services would remain free to use."
    },
    {
      "Title": "The Papers: \u0027Burnham rebellion growing\u0027 and \u0027Clan united\u0027",
      "Link": "https://www.bbc.com/news/articles/clye95952dko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T05:35:03+00:00",
      "Source": "BBC News",
      "Summary": "Fallout following the decision to block Andy Burnham from standing in a forthcoming by-election has continued."
    },
    {
      "Title": "Immigration chief at centre of Trump\u0027s crackdown set to leave Minneapolis",
      "Link": "https://www.bbc.com/news/articles/cgrdlr70qg4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T04:31:59+00:00",
      "Source": "BBC News",
      "Summary": "The US president is sending border tsar Tom Homan to the city in an apparent shift in tone from the White House."
    },
    {
      "Title": "Chris Mason: Both Tories and Labour feel the Reform heebie-jeebies",
      "Link": "https://www.bbc.com/news/articles/c5yv97e7j5lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T03:50:27+00:00",
      "Source": "BBC News",
      "Summary": "Both of Westminster\u0027s mega brands, Labour and the Conservatives, are feeling discombobulated, the BBC\u0027s political editor writes."
    },
    {
      "Title": "Trump raises US tariffs on South Korea imports to 25%",
      "Link": "https://www.bbc.com/news/articles/cwyw3ynwe37o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T03:06:18+00:00",
      "Source": "BBC News",
      "Summary": "Trump has accused Seoul of \u0022not living up\u0022 to a trade deal that was reached last year."
    },
    {
      "Title": "Starmer says he won\u0027t \u0027choose between\u0027 the US or China",
      "Link": "https://www.bbc.com/news/articles/cp3zp58wqlno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T02:55:36+00:00",
      "Source": "BBC News",
      "Summary": "Sir Keir says ignoring China \u0022wouldn\u0027t be sensible\u0022 as he prepares to visit the country."
    },
    {
      "Title": "Singing can overcome teenage isolation, says Grammy-winner ",
      "Link": "https://www.bbc.com/news/articles/cpwnjpvyyvxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T02:34:20+00:00",
      "Source": "BBC News",
      "Summary": "Jacob Collier, speaking at the launch of BBC Get Singing, says music \u0022embeds confidence\u0022 in young people."
    },
    {
      "Title": "Travelling with a man I\u0027d known for two days changed my life forever",
      "Link": "https://www.bbc.com/news/articles/cg4enzg27xdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T02:26:58+00:00",
      "Source": "BBC News",
      "Summary": "Three people share how one event reshaped their lives and how they rebuilt their identity and confidence."
    },
    {
      "Title": "TikTok is still down, here are all the latest updates",
      "Link": "https://www.theverge.com/news/868379/tiktok-us-trump-oracle-broken-rumors-power-outage",
      "Published": "2026-01-27T02:10:25+00:00",
      "Source": "The Verge",
      "Summary": "More than a day after TikTok’s issues began, TikTok USDS says the problems are the result of a power outage at a data center and subsequent cascading systems failure. Starting early Sunday morning, TikTok’s now under new ownership US arm started breaking down just a couple of days after Oracle \u0026#38; Co took the reins. [\u0026#8230;]"
    },
    {
      "Title": "Damaged homes and snowy roadways as winter storm hits US",
      "Link": "https://www.bbc.com/news/videos/c1klrkknrdyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T01:36:43+00:00",
      "Source": "BBC News",
      "Summary": "Several people have died as sub-zero temperatures and heavy snow disrupt roads and knock out power across a number of states."
    },
    {
      "Title": "What to expect from today\u0027s Bafta nominations",
      "Link": "https://www.bbc.com/news/articles/cjrz09lx91vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T00:07:55+00:00",
      "Source": "BBC News",
      "Summary": "Emma Stone, Timothée Chalamet and Wunmi Mosaku are among the actors who could be nominated later."
    },
    {
      "Title": "Menopause linked to Alzheimer\u0027s-like brain changes",
      "Link": "https://www.bbc.com/news/articles/c9qpp1g5ylvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T00:04:46+00:00",
      "Source": "BBC News",
      "Summary": "Menopause is linked to a loss of grey matter in regions involved with memory and emotion, study suggests."
    },
    {
      "Title": "Tech giants face landmark trial over social media addiction claims",
      "Link": "https://www.bbc.com/news/articles/c24g8v6qr1mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T00:01:49+00:00",
      "Source": "BBC News",
      "Summary": "Defendants include Meta, which owns Instagram and Facebook, TikTok\u0027s owner ByteDance and YouTube parent Google."
    },
    {
      "Title": "NI to become first in the UK to introduce graduated driving licences ",
      "Link": "https://www.bbc.com/news/articles/cew87q890pyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T00:01:23+00:00",
      "Source": "BBC News",
      "Summary": "The new rules will be introduced in October and are described as the most significant reform of driver licensing for 70 years."
    },
    {
      "Title": "Airlines pay out millions after initially rejecting claims",
      "Link": "https://www.bbc.com/news/articles/cvg5079yr20o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T00:00:37+00:00",
      "Source": "BBC News",
      "Summary": "Passengers accuse carriers of \u0022confusing\u0022 them into dropping compensation claims for cancelled flights."
    },
    {
      "Title": "China has purged its highest-ranked military general. Why?",
      "Link": "https://www.bbc.com/news/articles/c8d0l0g8yz5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T23:19:47+00:00",
      "Source": "BBC News",
      "Summary": "Zhang Youxia had been seen as a close ally of China\u0027s leader, Xi Jinping."
    },
    {
      "Title": "X faces EU investigation over Grok’s sexualized deepfakes",
      "Link": "https://www.theverge.com/news/868239/x-grok-sexualized-deepfakes-eu-investigation",
      "Published": "2026-01-26T22:47:34+00:00",
      "Source": "The Verge",
      "Summary": "X is facing an investigation from the European Commission over the sexualized deepfakes generated by its Grok AI chatbot. In its announcement, the Commission says it will evaluate whether X \u0022properly assessed and mitigated risks\u0022 associated with Grok\u0027s image-generating capabilities in the EU, as reported earlier by The New York Times. Advocacy groups and lawmakers [\u0026#8230;]"
    },
    {
      "Title": "Legendary reggae drummer Sly Dunbar dies at 73",
      "Link": "https://www.bbc.com/news/articles/cn56300z220o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T22:35:45+00:00",
      "Source": "BBC News",
      "Summary": "The drummer and producer played with everyone from Bob Marley to The Rolling Stones and Madonna."
    },
    {
      "Title": "Barry goal rescues draw for Everton against Leeds",
      "Link": "https://www.bbc.com/sport/football/videos/cwy8j44xndvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T22:30:04+00:00",
      "Source": "BBC News",
      "Summary": "Watch Premier League highlights as Everton\u0027s Thierno Barry continues his good run of form with a second-half goal to earn the Toffees a 1-1 draw with Leeds United."
    },
    {
      "Title": "New Iran videos show bodies piled in hospital and snipers on roofs",
      "Link": "https://www.bbc.com/news/articles/c1m7kde3y3zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T21:34:40+00:00",
      "Source": "BBC News",
      "Summary": "Footage from a hospital in Tehran shows at least 31 bodies piled inside and seven body bags outside."
    },
    {
      "Title": "Anthony Zurcher: Trump abandons attack mode as Minneapolis shooting backlash grows",
      "Link": "https://www.bbc.com/news/articles/ckgn9q1wp0yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T21:18:39+00:00",
      "Source": "BBC News",
      "Summary": "The White House has shifted how it talks about Alex Pretti\u0027s killing as more Republicans express concern over the deadly encounter.  "
    },
    {
      "Title": "Bayern Munich open talks to extend Kane contract",
      "Link": "https://www.bbc.com/sport/football/articles/cm245j0ldn5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T21:15:45+00:00",
      "Source": "BBC News",
      "Summary": "Bayern Munich sporting director Max Eberl says the German club are in talks with Harry Kane about extending the striker\u0027s contract."
    },
    {
      "Title": "New F1 cars \u0027look really cool\u0027 - Russell",
      "Link": "https://www.bbc.com/sport/formula1/articles/cdrem2m11plo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-26T20:54:54+00:00",
      "Source": "BBC News",
      "Summary": "McLaren and Red Bull release images of their 2026 Formula 1 cars as pre-season testing begins in Spain."
    },
    {
      "Title": "The best Bluetooth trackers for Apple and Android phones",
      "Link": "https://www.theverge.com/23769840/best-bluetooth-trackers",
      "Published": "2026-01-26T20:01:17+00:00",
      "Source": "The Verge",
      "Summary": "Some people rarely lose things. Wallets are always exactly where they’re supposed to be, keys never go missing, and remotes never slip between the couch cushions. And then there’s the rest of us — the folks who can’t ever seem to find the thing that was right there a few seconds ago. For us, there [\u0026#8230;]"
    },
    {
      "Title": "OpenAI’s president is a Trump mega-donor",
      "Link": "https://www.theverge.com/ai-artificial-intelligence/867947/openai-president-greg-brockman-trump-super-pac",
      "Published": "2026-01-26T19:57:08+00:00",
      "Source": "The Verge",
      "Summary": "OpenAI\u0027s co-founder and longtime president, Greg Brockman, didn\u0027t just make a run-of-the-mill donation to the main pro-Trump super PAC - together, he and his wife Anna\u0027s September 2025 donations equaled the largest of them all, totaling $25 million to \u0022MAGA Inc.,\u0022 per a recent filing. The Brockmans\u0027 donations made up nearly one-fourth of the six-month [\u0026#8230;]"
    },
    {
      "Title": "Google will settle its Assistant spying lawsuit for $68 million",
      "Link": "https://www.theverge.com/news/868078/google-assistant-lawsuit-settlement",
      "Published": "2026-01-26T19:45:53+00:00",
      "Source": "The Verge",
      "Summary": "Google could owe you some money, now that it\u0027s moving to settle a class-action lawsuit over how it handled recordings captured when its devices were activated by something other than Google Assistant\u0027s actual trigger word, \u0022Ok Google.\u0022 German outlet VRT NWS\u0027s 2019 report exposed the issue, and court filings from last Friday say the proposed [\u0026#8230;]"
    },
    {
      "Title": "Apple’s luxe AirPods Max have dropped to one of their lowest prices ever",
      "Link": "https://www.theverge.com/gadgets/868017/apple-airpods-max-usb-c-best-buy-flash-deal-sale",
      "Published": "2026-01-26T19:38:39+00:00",
      "Source": "The Verge",
      "Summary": "If you prefer over-ear headphones to earbuds and own an iPhone or another Apple device, the AirPods Max with USB-C are worth a look, especially now that you can buy them at Best Buy as part of a flash deal for $429.99 ($120 off) through tomorrow, January 27th. That’s $30 shy of their lowest price [\u0026#8230;]"
    },
    {
      "Title": "Even the big dick subreddit is mad about ICE",
      "Link": "https://www.theverge.com/news/867967/ice-shooting-minneapolis-reddit-communities-activism",
      "Published": "2026-01-26T18:31:13+00:00",
      "Source": "The Verge",
      "Summary": "\u0022Fuck ICE first, second, third, and fourth. Then worry about fucking me,\u0022 a Reddit post reads. \u0022Immigrants of any status are my friends, neighbors, and colleagues.\u0022 Across the internet - and in the streets - the sentiment is unavoidable, especially after a federal immigration agent shot and killed Alex Pretti, a 37-year-old nurse, in Minneapolis [\u0026#8230;]"
    },
    {
      "Title": "Tattle TV has turned a Hitchcock classic into a vertical video ‘microdrama’",
      "Link": "https://www.theverge.com/entertainment/867844/tattle-tv-the-lodger-hitchcock",
      "Published": "2026-01-26T18:00:29+00:00",
      "Source": "The Verge",
      "Summary": "Most vertical video microdrama apps have been focused on putting out newly produced series meant to be watched on your phone. But Tattle TV thinks that people might also be interested in checking out bite-size pieces of cinematic history. Though Tattle TV - a UK-based streaming platform created by filmmakers Philip McGoldrick and Marina Elderton [\u0026#8230;]"
    },
    {
      "Title": "MCP unites Claude chat with apps like Slack, Figma, and Canva",
      "Link": "https://www.theverge.com/news/867673/claude-mcp-app-interactive-slack-figma-canva",
      "Published": "2026-01-26T18:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Anthropic\u0027s Claude got a bit livelier today thanks to a new extension to MCP, the open-source protocol that allows AI agents to easily access tools and data across the internet. Users will now be able to interact with apps directly inside the Claude chatbot, letting you draft and format Slack messages to colleagues and create [\u0026#8230;]"
    },
    {
      "Title": "TikTokers are heading to UpScrolled following US takeover",
      "Link": "https://www.theverge.com/news/867958/tiktok-upscrolled-app-us-takeover",
      "Published": "2026-01-26T17:47:31+00:00",
      "Source": "The Verge",
      "Summary": "TikTok\u0027s takeover in the US has prompted users to join an alternative social platform called UpScrolled. The app, which is available on Android and iOS, currently holds the 12th spot in Apple\u0027s App Store, and it\u0027s struggling to keep up with an influx of new traffic. \u0022You showed up so fast our servers tapped out,\u0022 [\u0026#8230;]"
    },
    {
      "Title": "Braverman Backs Reform",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mxb5dn?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-25T21:33:00+00:00",
      "Source": "BBC News",
      "Summary": "Braverman is the third sitting Tory MP to defect to Reform in the last eleven days."
    },
    {
      "Title": "More than 100 flood warnings as Storm Chandra disruption continues",
      "Link": "https://www.bbc.com/news/articles/cy8p2yey0gdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T08:06:33+00:00",
      "Source": "BBC News",
      "Summary": "A major incident has been declared in Somerset, with weather warnings for ice across much of the country."
    },
    {
      "Title": "Five prisoners serving indefinite sentences to be referred to Court of Appeal",
      "Link": "https://www.bbc.com/news/articles/c89q3keee79o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:34:37+00:00",
      "Source": "BBC News",
      "Summary": "New IPP sentences were scrapped in 2012, but remain in place for around 2,800 people."
    },
    {
      "Title": "EasyJet warned over \u0027misleading\u0027 £5.99 cabin bag fee",
      "Link": "https://www.bbc.com/news/articles/cddgp9jgjz1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:33:47+00:00",
      "Source": "BBC News",
      "Summary": "The airline said the fact there were no bags available for less than £5.99 meant the claim was not misleading."
    },
    {
      "Title": "\u0027We don\u0027t want to be that team\u0027 - how can Newcastle cure travel sickness?",
      "Link": "https://www.bbc.com/sport/football/articles/c4g06vj2zg1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:33:43+00:00",
      "Source": "BBC News",
      "Summary": "Newcastle United have only won three away games in all competitions this season and head coach Eddie Howe wants his side to rise to the challenge as they face European champions Paris St-Germain in the Champions League on Wednesday."
    },
    {
      "Title": "South Korea\u0027s ex-first lady jailed 20 months for bribery",
      "Link": "https://www.bbc.com/news/articles/cevnppplkjjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:16:59+00:00",
      "Source": "BBC News",
      "Summary": "Kim Keon Hee was also ordered to return a Graff diamond necklace and pay back 12.85m won in cash."
    },
    {
      "Title": "Minnesota congresswoman Ilhan Omar attacked with unknown liquid during town hall",
      "Link": "https://www.bbc.com/news/articles/cn9zpee3llxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:15:12+00:00",
      "Source": "BBC News",
      "Summary": "Omar was uninjured and continued to speak at the event following the incident."
    },
    {
      "Title": "Starmer speaks to Burnham after by-election row",
      "Link": "https://www.bbc.com/news/articles/cp3zp2p8qwzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T07:07:27+00:00",
      "Source": "BBC News",
      "Summary": "Sir Keir rejects claims that Andy Burnham was told in advance he would not be accepted as a by-election candidate."
    },
    {
      "Title": "\u0027I was on my way home\u0027 - Djokovic scrapes into semis after Musetti injury",
      "Link": "https://www.bbc.com/sport/tennis/articles/c2k922e290jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T06:59:42+00:00",
      "Source": "BBC News",
      "Summary": "Novak Djokovic\u0027s bid for more tennis history is still alive as he scrapes into the Australian Open semi-finals as Lorenzo Musetti retires injured at two sets up."
    },
    {
      "Title": "\u0027I think she\u0027d be flattered\u0027 - Claudia Winkleman model appears on garden fence",
      "Link": "https://www.bbc.com/news/articles/cd7zpg3z723o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T06:40:35+00:00",
      "Source": "BBC News",
      "Summary": "The Traitors presenter becomes an artist\u0027s latest creation in Stowmarket, Suffolk."
    },
    {
      "Title": "Moeen lauds anti-racism steps as he joins Yorkshire",
      "Link": "https://www.bbc.com/sport/cricket/articles/clyep2g5dplo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T06:30:23+00:00",
      "Source": "BBC News",
      "Summary": "Former England all-rounder Moeen Ali says there was \u0022no doubt in my mind\u0022 about joining Yorkshire despite historical racism, as he abandons his retirement from county cricket."
    },
    {
      "Title": "A string of scandals and luxury handbags: Who is South Korea\u0027s former first lady?",
      "Link": "https://www.bbc.com/news/articles/cj3vpe8zme8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T06:23:41+00:00",
      "Source": "BBC News",
      "Summary": "Kim was accused of accepting luxury bags, a diamond necklace and other gifts as bribes."
    },
    {
      "Title": "Trump says government will \u0027de-escalate\u0027 in Minnesota following Pretti shooting",
      "Link": "https://www.bbc.com/news/articles/c0q425vg4qzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T05:38:48+00:00",
      "Source": "BBC News",
      "Summary": "The killing of Alex Pretti over the weekend led Minnesota officials and locals to renew calls for Trump to end his immigration operation there. "
    },
    {
      "Title": "The Papers:  \u0027Half measures\u0027 and \u0027Fake jobs for sale\u0027",
      "Link": "https://www.bbc.com/news/articles/c1lz2rg0923o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T05:14:04+00:00",
      "Source": "BBC News",
      "Summary": "Chancellor Rachel Reeves\u0027 \u0022long-awaited\u0022 support package for British pubs makes Wednesday\u0027s front pages. "
    },
    {
      "Title": "Swiatek\u0027s career Grand Slam bid falls flat against Rybakina",
      "Link": "https://www.bbc.com/sport/tennis/articles/c3ve27yq3y4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T04:57:13+00:00",
      "Source": "BBC News",
      "Summary": "Iga Swiatek\u0027s bid to complete a clean sweep of the four majors is ended by Elena Rybakina in the Australian Open quarter-finals."
    },
    {
      "Title": "Neil Young offers Greenlanders free access to his archives",
      "Link": "https://www.bbc.com/news/articles/crmlpl0w2z2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T03:34:43+00:00",
      "Source": "BBC News",
      "Summary": "Young says he hopes the offer will \u0022ease some of the unwarranted stress and threats\u0022 Greenlanders feel over Trump\u0027s threats to the territory."
    },
    {
      "Title": "Amazon accidentally sends email confirming layoffs",
      "Link": "https://www.bbc.com/news/articles/cx2ywzxlxnlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T03:19:23+00:00",
      "Source": "BBC News",
      "Summary": "The message was apparently sent in error hours before workers were expecting thousands of job cuts to be announced."
    },
    {
      "Title": "Mexico president asks South Korea for more BTS concerts",
      "Link": "https://www.bbc.com/news/articles/cz7y2gy4p24o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T03:07:18+00:00",
      "Source": "BBC News",
      "Summary": "About a million fans were vying for 150,000 concert tickets, which sold out in less than 40 minutes."
    },
    {
      "Title": "Republicans criticise immigration force but steer clear of Trump attacks",
      "Link": "https://www.bbc.com/news/articles/cj3vp84j1l3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T02:29:26+00:00",
      "Source": "BBC News",
      "Summary": "Lawmakers are questioning the crackdown while anger grows over two citizens killed by federal agents."
    },
    {
      "Title": "Six English clubs, one huge night - all to play for in Champions League",
      "Link": "https://www.bbc.com/sport/football/articles/c3ve1gnk26eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T01:24:45+00:00",
      "Source": "BBC News",
      "Summary": "With the league phase of the Champions League almost over, which teams can join Arsenal and Bayern Munich in the top eight?"
    },
    {
      "Title": "\u0027OCD made me feel terrified\u0027: Here\u0027s how to spot the signs",
      "Link": "https://www.bbc.com/news/articles/czejjr7wz6ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T01:18:01+00:00",
      "Source": "BBC News",
      "Summary": "Dr Nina Higson-Sweeney, who was diagnosed with OCD when she was 10, explains when you should seek help."
    },
    {
      "Title": "The crypto bill is falling apart in Congress",
      "Link": "https://www.theverge.com/column/868941/clarity-act-congress-shutdown",
      "Published": "2026-01-28T01:09:33+00:00",
      "Source": "The Verge",
      "Summary": "Hello and welcome to Regulator, the Verge newsletter about the technology politics happening in our nation\u0027s capital. I hope our snowstorm-affected readers are safe, warm, and haven\u0027t reenacted The Shining at home yet. Do you know what prevents that? Subscribing to The Verge. Last week, when I was tracking Coinbase\u0027s opposition to the Clarity Act, [\u0026#8230;]"
    },
    {
      "Title": "\u0027We all know someone who was killed\u0027 -  Iran protesters tell BBC of brutal crackdown",
      "Link": "https://www.bbc.com/news/articles/cy8y2jxx9ppo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T00:46:53+00:00",
      "Source": "BBC News",
      "Summary": "Young Iranians able tell the BBC how they saw friends and other people die as security forces crushed protests earlier this month."
    },
    {
      "Title": "The best Android phones",
      "Link": "https://www.theverge.com/23674658/best-android-phone",
      "Published": "2026-01-28T00:27:47+00:00",
      "Source": "The Verge",
      "Summary": "The Android ecosystem is all about choice. While iPhone owners have a smaller pool of new devices to pick from when it’s time to upgrade, there’s a wider range of choices on Android. Some Android phones even fold in half! Imagine. On the flip side, all that choice can make for some hard decisions. Here’s [\u0026#8230;]"
    },
    {
      "Title": "Vulnerable people missing out on benefits because of online tool",
      "Link": "https://www.bbc.com/news/articles/c33827k6elxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T00:06:29+00:00",
      "Source": "BBC News",
      "Summary": "Benefits calculators can leave some people confused and in a dire financial state, say campaigners. "
    },
    {
      "Title": "AI boom will produce victors and carnage, tech boss warns",
      "Link": "https://www.bbc.com/news/articles/cr57p2ve8glo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T00:01:19+00:00",
      "Source": "BBC News",
      "Summary": "Cisco chief executive Chuck Robbins compares AI to the dotcom bubble of the early 2000s."
    },
    {
      "Title": "Two fans in hospital as Chelsea urge caution after Naples \u0027incident\u0027",
      "Link": "https://www.bbc.com/sport/football/articles/c74wdw5n4e5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T23:58:39+00:00",
      "Source": "BBC News",
      "Summary": "Travelling Chelsea fans in Naples for Wednesday\u0027s Champions League game are told to \u0022exercise extreme caution\u0022 after two supporters suffer injuries."
    },
    {
      "Title": "Meta is spending millions to convince people that data centers are cool and you like them",
      "Link": "https://www.theverge.com/news/869008/meta-data-centers-ad-campaign",
      "Published": "2026-01-27T23:53:53+00:00",
      "Source": "The Verge",
      "Summary": "Over the last few months of 2025, Meta spent $6.4 million on an ad campaign running in cities across the country, from Sacramento to Washington, with a clear mission: win over viewers on the construction of new data centers. As the New York Times reports, the ad campaign is anchored by short, folksy video spotlights [\u0026#8230;]"
    },
    {
      "Title": "Moltbot, the AI agent that \u0026#8216;actually does things,\u0026#8217; is tech’s new obsession",
      "Link": "https://www.theverge.com/report/869004/moltbot-clawdbot-local-ai-agent",
      "Published": "2026-01-27T23:28:11+00:00",
      "Source": "The Verge",
      "Summary": "An open-source AI agent that \u0022actually does things\u0022 is taking off, with people across the web sharing how they\u0027re using the agent to do a whole bunch of things, like manage reminders, log health and fitness data, and even communicate with clients. The tool, called Moltbot (formerly Clawdbot), runs locally on a variety of devices, [\u0026#8230;]"
    },
    {
      "Title": "The best budget robot vacuums",
      "Link": "https://www.theverge.com/23846479/best-budget-robot-vacuum-robot-mop",
      "Published": "2026-01-27T23:09:23+00:00",
      "Source": "The Verge",
      "Summary": "Today’s robot vacuums are becoming a bit like cars: with all the features, upgrades, and fancy trimmings available these days, it’s easy to forget that they can just be simple machines that get us from point A to point B. Yes, some bots blow hot air on their bums (mop pads), deftly navigate dog poop, [\u0026#8230;]"
    },
    {
      "Title": "Vets may have to publish prices of common pet treatments",
      "Link": "https://www.bbc.com/news/articles/cd7zpgn5n47o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T22:30:20+00:00",
      "Source": "BBC News",
      "Summary": "The government sets out proposals as data finds vet prices rose at nearly twice the inflation rate."
    },
    {
      "Title": "The winter storm tested power grids straining to accommodate AI data centers",
      "Link": "https://www.theverge.com/report/868859/electricity-rates-power-grid-ai-data-center-winter-storm",
      "Published": "2026-01-27T22:28:58+00:00",
      "Source": "The Verge",
      "Summary": "The colossal winter storm that swept across 34 states left hundreds of thousands of people without electricity. Bitterly cold temperatures lingering after Winter Storm Fern are still testing power grids, already under stress from a rush of new AI data centers. Over the weekend, wholesale electricity prices soared in Virginia, the state with the most [\u0026#8230;]"
    },
    {
      "Title": "Famous Up Helly Aa festival sets Shetland\u0027s skies ablaze",
      "Link": "https://www.bbc.com/news/articles/cy8p2rjeyveo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T21:59:40+00:00",
      "Source": "BBC News",
      "Summary": "During the event local \u0022guizers\u0022 throw their torches at a replica of a Viking long ship until it is consumed by flames. "
    },
    {
      "Title": "The best fitness trackers and watches we’ve tested",
      "Link": "https://www.theverge.com/22985108/best-fitness-tracker",
      "Published": "2026-01-27T21:51:15+00:00",
      "Source": "The Verge",
      "Summary": "Fitness trackers have come a long way from the simple bands that tracked steps and little else. Modern trackers can monitor everything from your heart health to how well you’ve recovered from a hard bout of training. Even flagship smartwatches, which used to be lackluster trackers, have become pretty adept workout companions. Whatever your fitness [\u0026#8230;]"
    },
    {
      "Title": "Who is Tom Homan, Trump\u0027s \u0027border tsar\u0027 deployed to Minneapolis?",
      "Link": "https://www.bbc.com/news/articles/cjw1pn4lwjqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T21:17:35+00:00",
      "Source": "BBC News",
      "Summary": "The US border tsar has long been a ferocious defender of Donald Trump\u0027s immigration policies. "
    },
    {
      "Title": "British Army officer dies after incident during live fire training",
      "Link": "https://www.bbc.com/news/articles/cly9p153kv9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T20:03:09+00:00",
      "Source": "BBC News",
      "Summary": "The 25-year-old died on Sunday after the incident at an army training site in Northumberland."
    },
    {
      "Title": "Razer’s testing a new tool for customizing its keyboards in your browser",
      "Link": "https://www.theverge.com/tech/868843/razer-synapse-web-beta-browser-chromium-configure-settings",
      "Published": "2026-01-27T19:38:19+00:00",
      "Source": "The Verge",
      "Summary": "Razer has announced the beta release of a new online customization tool compatible with several versions of its Huntsman V3 Pro keyboards at launch. Razer Synapse Web isn\u0027t a full replacement for the company\u0027s Synapse 4 desktop app. It\u0027s instead designed to be a streamlined alternative accessible through a browser for situations where you\u0027re not [\u0026#8230;]"
    },
    {
      "Title": "Amazon shutters all of its physical Go and Fresh stores",
      "Link": "https://www.theverge.com/news/868800/amazon-go-and-fresh-stores-closed",
      "Published": "2026-01-27T18:55:55+00:00",
      "Source": "The Verge",
      "Summary": "Amazon Go and Fresh physical store locations will soon be no more, with Amazon announcing on Tuesday that it\u0027s closing the majority of the stores and converting others into Whole Foods Market locations. Customers will still be able to order from Amazon Fresh online, but won\u0027t be able to shop at physical stores with the [\u0026#8230;]"
    },
    {
      "Title": "Pornhub to restrict access for UK users from next week",
      "Link": "https://www.bbc.com/news/articles/czr428rxg57o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-27T18:38:43+00:00",
      "Source": "BBC News",
      "Summary": "The changes mean only those who have a Pornhub account and have verified their age will be able to access it in the UK soon."
    },
    {
      "Title": "A former Netflix game studio went indie to reach more players",
      "Link": "https://www.theverge.com/entertainment/868711/spry-fox-netflix-game-studio-indie-spirit-crossing",
      "Published": "2026-01-27T18:30:00+00:00",
      "Source": "The Verge",
      "Summary": "When Netflix first acquired cozy game developer Spry Fox in 2022, it made a lot of sense. The studio had been around for over a decade and had several hits with mobile games like Triple Town and Alphabear. That approachable style of puzzle game seemed like a good fit for Netflix\u0027s mobile-first strategy, and, as [\u0026#8230;]"
    },
    {
      "Title": "Serena Williams refuses to rule out tennis comeback",
      "Link": "https://www.bbc.com/sport/tennis/articles/cx2k6rz20lno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T08:01:38+00:00",
      "Source": "BBC News",
      "Summary": "Serena Williams refuses to rule out returning to professional tennis after recently filing the necessary paperwork."
    },
    {
      "Title": "\u0027Why can\u0027t women have experience?\u0027 New Bridgerton series tackles sex taboo",
      "Link": "https://www.bbc.com/news/articles/c4g9g1119q2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T08:00:33+00:00",
      "Source": "BBC News",
      "Summary": "Bridgerton is back, with Francesca on the hunt for sex tips and Benedict finally meeting his match."
    },
    {
      "Title": "WBA champion Gervonta Davis arrested in Miami after two-week search",
      "Link": "https://www.bbc.com/sport/boxing/articles/c74wyqq2w3go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T06:57:17+00:00",
      "Source": "BBC News",
      "Summary": "WBA lightweight champion Gervonta Davis is arrested in Miami for alleged false imprisonment, battery and attempted kidnapping."
    },
    {
      "Title": "What could happen if the US strikes Iran? Here are seven scenarios",
      "Link": "https://www.bbc.com/news/articles/ce3kenge1k9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T06:43:49+00:00",
      "Source": "BBC News",
      "Summary": "From regime change to retaliation, the BBC\u0027s Frank Gardner outlines possible outcomes of US strikes on Iran."
    },
    {
      "Title": "Border agents involved in fatal shooting of Alex Pretti placed on leave",
      "Link": "https://www.bbc.com/news/articles/ckgn0w129lqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T06:33:41+00:00",
      "Source": "BBC News",
      "Summary": "As Trump and the Minneapolis Mayor spar over social media on immigration law enforcement, the US continues to be roiled by the killing of nurse Alex Pretti."
    },
    {
      "Title": "China executes 11 members of Myanmar scam mafia",
      "Link": "https://www.bbc.com/news/articles/cx2gdrvy9gjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T06:30:35+00:00",
      "Source": "BBC News",
      "Summary": "China executes 11 members of the Ming family that ran scam centres in Myanmar, state media report."
    },
    {
      "Title": "Family wants action after man electrocuted by faulty power cable while out jogging",
      "Link": "https://www.bbc.com/news/articles/cy092x1n7w0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T06:10:21+00:00",
      "Source": "BBC News",
      "Summary": "The family of Harry Oates, who died in 2023, say organisations are \u0022hiding behind process\u0022."
    },
    {
      "Title": "The Papers:  \u0027Countdown to conflagration\u0027 and \u0027Restore high streets or lose election\u0027",
      "Link": "https://www.bbc.com/news/articles/cn7j5m4kmx8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T05:40:23+00:00",
      "Source": "BBC News",
      "Summary": "Many of the papers have headlined on Iran, following threats from US President Donald Trump."
    },
    {
      "Title": "Tesla cuts car models in shift to robots and AI",
      "Link": "https://www.bbc.com/news/articles/c620177qdg5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T02:35:07+00:00",
      "Source": "BBC News",
      "Summary": "Multi-billionaire Elon Musk\u0027s electric car maker also said its annual revenue had fallen for the first time."
    },
    {
      "Title": "Chris Hemsworth and Mark Ruffalo: We\u0027re like a couple of naughty school kids",
      "Link": "https://www.bbc.com/news/articles/cn9z4xnv544o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T02:19:27+00:00",
      "Source": "BBC News",
      "Summary": "The pair star in Crime 101, a tense thriller that swaps superhero spectacle for a game of psychological cat and mouse."
    },
    {
      "Title": "Keep suspended pupils in school instead of at home, ministers say",
      "Link": "https://www.bbc.com/news/articles/c0r425pyl57o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T02:02:03+00:00",
      "Source": "BBC News",
      "Summary": "Changes to England\u0027s school system say on-site suspensions should be used for non-violent behaviour."
    },
    {
      "Title": "Bill Belichick: A Super Bowl god\u0027s fall from grace",
      "Link": "https://www.bbc.com/news/articles/clywp0wy21lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T01:37:57+00:00",
      "Source": "BBC News",
      "Summary": "He is one of the most winningest coaches in NFL history, but his snub from the Pro Football Hall of Fame adds to a growing list of defeats. "
    },
    {
      "Title": "A \u0027miracle\u0027 moment - how Mourinho\u0027s Benfica stunned Real Madrid",
      "Link": "https://www.bbc.com/sport/football/articles/c8j329y9yk2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:44:50+00:00",
      "Source": "BBC News",
      "Summary": "Goalkeeper Anatoly Trubin\u0027s header gives Jose Mourinho an unforgettable moment as Benfica beat Real Madrid to stay alive in the Champions League."
    },
    {
      "Title": "Why have English teams dominated the Champions League so far?",
      "Link": "https://www.bbc.com/sport/football/articles/cy0520ey7jjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:24:07+00:00",
      "Source": "BBC News",
      "Summary": "Five of the eight teams to qualify automatically for the Champions League were from the Premier League, so why have they been so dominant?"
    },
    {
      "Title": "Facebook-owner Meta to nearly double AI spending",
      "Link": "https://www.bbc.com/news/articles/cn8jkyk78gno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:16:17+00:00",
      "Source": "BBC News",
      "Summary": "Mark Zuckerberg\u0027s spending plans hint at further layoffs and changes within Facebook, Instagram and WhatsApp."
    },
    {
      "Title": "Yes, you can be friends with an ex - but there are rules",
      "Link": "https://www.bbc.com/news/articles/c7vm192vr53o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:11:24+00:00",
      "Source": "BBC News",
      "Summary": "The four questions you should ask before deciding whether to stay friends or go no contact."
    },
    {
      "Title": "\u0027You don\u0027t feel judged\u0027: Why we buy more at self-service terminals",
      "Link": "https://www.bbc.com/news/articles/cy9y1wvq3pdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:05:18+00:00",
      "Source": "BBC News",
      "Summary": "How restaurants and retailers use behavioural science to get us to increase our spending."
    },
    {
      "Title": "Water bills to rise again: Use our tool to find out by how much",
      "Link": "https://www.bbc.com/news/articles/cn56p0qkky7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:03:04+00:00",
      "Source": "BBC News",
      "Summary": "The average annual household bill in England and Wales will increase by £33 from April."
    },
    {
      "Title": "Vehicle production in the UK falls to 73-year low",
      "Link": "https://www.bbc.com/news/articles/clymp4ynldlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-29T00:01:35+00:00",
      "Source": "BBC News",
      "Summary": "The industry has \u0022the toughest year in a generation\u0022 as vehicle making falls back to 1952 levels."
    },
    {
      "Title": "Halide co-founder Sebastiaan de With is joining Apple\u0026#8217;s design team",
      "Link": "https://www.theverge.com/tech/869926/apple-hires-sebastiaan-de-with-design-team-halide-lux",
      "Published": "2026-01-28T23:59:45+00:00",
      "Source": "The Verge",
      "Summary": "Sebastiaan de With, known for his work on apps like Halide, Kino, and Orion as the co-founder of Lux, is joining Apple\u0027s design team, he announced today. \u0022So excited to work with the very best team in the world on my favorite products,\u0022 de With says in his post. de With is well-known for his [\u0026#8230;]"
    },
    {
      "Title": "Rare night of joy for Salah and Slot amid turbulent season",
      "Link": "https://www.bbc.com/sport/football/articles/c5y2zdwjzkvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T23:48:08+00:00",
      "Source": "BBC News",
      "Summary": "After sweeping their way into the last 16, chief football writer Phil McNulty asks can the Champions League rescue Liverpool\u0027s season of turmoil?"
    },
    {
      "Title": "Mark Zuckerberg is all in on AI as the new social media",
      "Link": "https://www.theverge.com/news/869882/mark-zuckerberg-meta-earnings-q4-2025",
      "Published": "2026-01-28T23:26:41+00:00",
      "Source": "The Verge",
      "Summary": "Meta CEO Mark Zuckerberg\u0027s metaverse dreams seem to have been replaced by a new vision: an AI-generated social feed. In an earnings call on Wednesday, Zuckerberg reiterated his belief that AI will become the next big media format, making feeds \u0022more immersive and interactive:\u0022 We started with text, and then moved to photos when we [\u0026#8230;]"
    },
    {
      "Title": "Driverless taxis set to launch in UK as soon as September",
      "Link": "https://www.bbc.com/news/articles/czej9n578k9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T23:22:48+00:00",
      "Source": "BBC News",
      "Summary": "Waymo has laid out plans for a robotaxi service in London with a pilot scheme due to begin in April."
    },
    {
      "Title": "Windows 11 has reached 1 billion users faster than Windows 10",
      "Link": "https://www.theverge.com/news/869889/microsoft-windows-11-1-billion-users",
      "Published": "2026-01-28T23:17:14+00:00",
      "Source": "The Verge",
      "Summary": "Windows 11 now has 1 billion users. Microsoft hit the milestone during the recent holiday quarter, meaning Windows 11 has managed to reach 1 billion users faster than Windows 10 did nearly six years ago. \u0022Windows reached a big milestone, 1 billion Windows 11 users,\u0022 said Microsoft CEO Satya Nadella on the company\u0027s fiscal Q2, [\u0026#8230;]"
    },
    {
      "Title": "Watch: How Alex Pretti shooting led Trump to shift course in Minneapolis",
      "Link": "https://www.bbc.com/news/videos/cj6wgelw62do?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T23:10:05+00:00",
      "Source": "BBC News",
      "Summary": "BBC analysis editor Ros Atkins looks at why tensions have been running so high in the city - and how we got here."
    },
    {
      "Title": "At least five killed after Storm Kristin hits Portugal",
      "Link": "https://www.bbc.com/news/articles/c205yl3kvzmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T22:59:48+00:00",
      "Source": "BBC News",
      "Summary": "The storm toppled trees, damaged homes and left more than 800,000 people without power."
    },
    {
      "Title": "Tesla discontinuing Model S and Model X to make room for robots",
      "Link": "https://www.theverge.com/transportation/869872/tesla-model-s-model-x-discontinue-optimus-robot-factory",
      "Published": "2026-01-28T22:49:50+00:00",
      "Source": "The Verge",
      "Summary": "Tesla will discontinue the Model S and Model X in the second quarter of 2026, Elon Musk said in an earnings call with investors today. No advance word was given about the cancellations, making it an abrupt ending for Tesla\u0027s two original flagship EVs. Musk said the reasons for cancelling the vehicle programs was to [\u0026#8230;]"
    },
    {
      "Title": "The best iPhones",
      "Link": "https://www.theverge.com/23618862/best-iphone-camera-battery-screen-guide",
      "Published": "2026-01-28T22:45:37+00:00",
      "Source": "The Verge",
      "Summary": "If you’ve been holding off on getting a new iPhone, now’s the perfect time to size up your options. Apple’s 2025 iPhone lineup is now widely available, which includes the iPhone 17, 17 Pro, 17 Pro Max, and a brand-new model, the ultra-thin iPhone Air. These new phones offer a number of new features over [\u0026#8230;]"
    },
    {
      "Title": "Watch Benfica keeper score stoppage-time goal against Real Madrid",
      "Link": "https://www.bbc.com/sport/football/videos/ce8ek9k56e7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T22:22:55+00:00",
      "Source": "BBC News",
      "Summary": "Goalkeeper Anatoliy Trubin scores in the 98th minute to give Benfica a 4-2 win over Real Madrid - a goal which also secured Jose Mourinho\u0027s side a place in the last 16 play-offs of the Champions League on goal difference."
    },
    {
      "Title": "The best Xbox controller to buy right now",
      "Link": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
      "Published": "2026-01-28T21:46:54+00:00",
      "Source": "The Verge",
      "Summary": "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing between [\u0026#8230;]"
    },
    {
      "Title": "Google adds Gemini AI-powered ‘auto browse’ to Chrome",
      "Link": "https://www.theverge.com/news/869731/google-gemini-ai-chrome-auto-browse",
      "Published": "2026-01-28T21:32:07+00:00",
      "Source": "The Verge",
      "Summary": "Google is launching a new \u0022auto browse\u0022 feature inside Chrome that can perform multi-step tasks on your behalf. The Gemini AI-powered capability is coming to Google AI Pro and Ultra subscribers in the US, and can do things like research hotel and flight costs, schedule appointments, fill out online forms, manage subscriptions, and more. The [\u0026#8230;]"
    },
    {
      "Title": "Tesla says production-ready Optimus robot is coming soon",
      "Link": "https://www.theverge.com/transportation/869746/tesla-optimus-gen-3-q1-2026-earnings",
      "Published": "2026-01-28T21:28:45+00:00",
      "Source": "The Verge",
      "Summary": "In its earnings report, Tesla says that the third-generation version of its Optimus humanoid robot \u0022meant for mass production\u0022 will be unveiled in the first quarter of 2026. This new version of Optimus will include \u0022major upgrades from version 2.5, including our latest hand design.\u0022 And the company is making preparations for the first production [\u0026#8230;]"
    },
    {
      "Title": "Microsoft reports strong cloud earnings in Q2 as gaming declines",
      "Link": "https://www.theverge.com/news/869493/microsoft-q2-2026-earnings-revenue-profits-windows-xbox-gaming-surface",
      "Published": "2026-01-28T21:23:36+00:00",
      "Source": "The Verge",
      "Summary": "Microsoft just posted the second quarter of its 2026 fiscal financial results. The software maker made $81.3 billion in revenue and a net income of $30.9 billion during Q3. Revenue is up 17 percent, and net income has increased by 23 percent. The holiday quarter saw PC shipments grow unexpectedly amid an ongoing RAM shortage. [\u0026#8230;]"
    },
    {
      "Title": "Tesla hits a grim milestone: its second straight year of decline",
      "Link": "https://www.theverge.com/transportation/869603/tesla-q4-2025-earnings-revenue-profit-musk-robotaxis",
      "Published": "2026-01-28T21:08:42+00:00",
      "Source": "The Verge",
      "Summary": "Tesla just reported its second consecutive year of declining revenue and profits, further complicating Elon Musk\u0027s $1 trillion effort to transform his company into a leader in AI and robotics. Meanwhile, the global EV market continues to grow, seemingly in spite of the pioneering company\u0027s setbacks. Tesla said it earned $840 million in net income [\u0026#8230;]"
    },
    {
      "Title": "Assisted dying bill has no hope of passing unless Lords change approach, warns peer",
      "Link": "https://www.bbc.com/news/articles/cr57j47811yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T21:00:09+00:00",
      "Source": "BBC News",
      "Summary": "Lord Falconer said the bill has \u0022absolutely no hope\u0022 of passing without a \u0022fundamental change\u0022 in approach."
    },
    {
      "Title": "Judi Dench and Stanley Tucci among stars at premiere of King\u0027s film",
      "Link": "https://www.bbc.com/news/articles/c62wepw43k3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T17:30:28+00:00",
      "Source": "BBC News",
      "Summary": "King Charles explains his philosophy of harmony in a film for Amazon Prime Video."
    },
    {
      "Title": "Why China views the UK visit as part of something bigger",
      "Link": "https://www.bbc.com/news/articles/c3wz2x7ppz7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-28T12:16:59+00:00",
      "Source": "BBC News",
      "Summary": "Sir Keir Starmer is one of a number of world leaders heading to Beijing"
    }
  ],
  "Prices": []
}