{
  "LastDigestUtc": "2026-01-24T08:07:53.0429777+00:00",
  "CacheNews": [
    {
      "Title": "UK economy grew by 0.3% in November, beating forecasts",
      "Link": "https://www.bbc.com/news/articles/c8d041pp85mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T08:07:55+00:00",
      "Source": "BBC News",
      "Summary": "The economy was boosted by a rebound in car production and from the services sector."
    },
    {
      "Title": "Regulator launches investigation into South East Water as thousands remain without supply",
      "Link": "https://www.bbc.com/news/articles/cq6vm1rp2pjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T08:07:30+00:00",
      "Source": "BBC News",
      "Summary": "South East Water says some customers in Kent and Sussex may not see supplies return until Friday. "
    },
    {
      "Title": "Polls open in tense Uganda election amid widespread delays ",
      "Link": "https://www.bbc.com/news/articles/cx2xn1yvgr4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:50:52+00:00",
      "Source": "BBC News",
      "Summary": "The election is a rematch between Bobi Wine and Yoweri Museveni, who has been president for 40 years."
    },
    {
      "Title": "X to stop Grok AI from undressing images of real people after backlash",
      "Link": "https://www.bbc.com/news/articles/ce8gz8g2qnlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:43:56+00:00",
      "Source": "BBC News",
      "Summary": "Grok will no longer allow users to remove clothing from images of real people in jurisdictions where it is illegal."
    },
    {
      "Title": "Twenty-two English councils ask for election delays",
      "Link": "https://www.bbc.com/news/articles/cd7z892jzdeo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:40:49+00:00",
      "Source": "BBC News",
      "Summary": "A third of eligible authorities say they want to postpone local polls scheduled for May."
    },
    {
      "Title": "New Zealand sack \u0027gutted\u0027 head coach Robertson",
      "Link": "https://www.bbc.com/sport/rugby-union/articles/cgrd9wgpzkyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:30:50+00:00",
      "Source": "BBC News",
      "Summary": "Scott Robertson is sacked as head coach of New Zealand after two years in charge of the All Blacks, following an internal review of the 2025 season."
    },
    {
      "Title": "ICE agent shoots Minneapolis man in leg after alleged attack, officials say",
      "Link": "https://www.bbc.com/news/articles/c205677pxvxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:30:47+00:00",
      "Source": "BBC News",
      "Summary": "The City of Minneapolis confirmed a man was shot and taken to hospital for non-life threatening injuries."
    },
    {
      "Title": "Wrongly jailed postmaster hopeful after receiving treatment for cancer ",
      "Link": "https://www.bbc.com/news/articles/cqj2qkv2d8eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T07:24:23+00:00",
      "Source": "BBC News",
      "Summary": "Noel Thomas, from Anglesey, was jailed for nine months in 2006 when his books fell short by £48,000."
    },
    {
      "Title": "WSL players make confessions including Toone, Shaw and Kelly",
      "Link": "https://www.bbc.com/sport/videos/cp37kp55eyzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:56:42+00:00",
      "Source": "BBC News",
      "Summary": "The best moments from BBC Sport’s Confession Cam featuring WSL stars Khadija Shaw, Ella Toone, Chloe Kelly and more."
    },
    {
      "Title": "Raducanu given potential Sabalenka obstacle in Melbourne",
      "Link": "https://www.bbc.com/sport/tennis/articles/crleznxxl5wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:54:01+00:00",
      "Source": "BBC News",
      "Summary": "Emma Raducanu is handed a potential third-round match against world number one Aryna Sabalenka at the Australian Open."
    },
    {
      "Title": "\u0027It was terrifying\u0027: Residents describe carnage after Thai train crash",
      "Link": "https://www.bbc.com/news/articles/cm2yvnen1qyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:46:02+00:00",
      "Source": "BBC News",
      "Summary": "The BBC arrived at a grim scene in the evening, with rescuers still pulling bodies out of the mangled train."
    },
    {
      "Title": "GB\u0027s Fery qualifies for first overseas Grand Slam",
      "Link": "https://www.bbc.com/sport/tennis/articles/ce8g3e34zyqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:42:37+00:00",
      "Source": "BBC News",
      "Summary": "Britain\u0027s Arthur Fery qualifies for his first overseas Grand Slam by beating Dino Prizmic to reach the Australian Open main draw."
    },
    {
      "Title": "Rift at top of the Taliban: BBC reveals clash of wills behind Afghan internet shutdown",
      "Link": "https://www.bbc.com/news/articles/cg7vdpy1l2vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:05:57+00:00",
      "Source": "BBC News",
      "Summary": "The Taliban leader once warned of a split: A BBC investigation reveals how attitudes to women, the internet and religion are dividing the group at the very top."
    },
    {
      "Title": "Hospital alert after fake doctor-endorsed videos",
      "Link": "https://www.bbc.com/news/articles/c3dm1yy0k8po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:00:39+00:00",
      "Source": "BBC News",
      "Summary": "Guy\u0027s and St Thomas\u0027 NHS Trust says online videos falsely show clinicians promoting weight loss patches."
    },
    {
      "Title": "The Papers: \u0027World on the brink\u0027 and Trump intent on \u0027conquering\u0027 Greenland",
      "Link": "https://www.bbc.com/news/articles/c5ydl1vpp8zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T05:39:13+00:00",
      "Source": "BBC News",
      "Summary": "The global tensions from Greenland and Iran feature prominently on Thursday\u0027s front pages."
    },
    {
      "Title": "Labubu toy manufacturer exploited workers, labour group claims",
      "Link": "https://www.bbc.com/news/articles/cn4037v0w12o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T05:36:45+00:00",
      "Source": "BBC News",
      "Summary": "Investigators allege that a factory making Pop Mart products neglected staff safety and welfare."
    },
    {
      "Title": "Trump told \u0027killing has stopped\u0027 in Iran after violent protest crackdown",
      "Link": "https://www.bbc.com/news/articles/c07xpndjdd8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T04:57:26+00:00",
      "Source": "BBC News",
      "Summary": "The US president does not rule out military action in Iran, as Tehran temporarily shuts its airspace to nearly all flights. "
    },
    {
      "Title": "Concern for couple jailed in Tehran as British embassy closes",
      "Link": "https://www.bbc.com/news/articles/cn0k2l5krd8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T04:41:50+00:00",
      "Source": "BBC News",
      "Summary": "Joe Bennett says his parents are in a \u0022dangerous position\u0022 amid Iran\u0027s deadly crackdown on anti-regime protests."
    },
    {
      "Title": "Zelensky declares energy emergency as biting cold persists",
      "Link": "https://www.bbc.com/news/articles/cq6vm677z76o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T03:35:12+00:00",
      "Source": "BBC News",
      "Summary": "The move comes as US President Donald Trump said Ukraine is \u0022less ready\u0022 than the Russian president to make a peace deal."
    },
    {
      "Title": "Denmark warns of \u0027fundamental disagreement\u0027 after White House talks on Greenland",
      "Link": "https://www.bbc.com/news/articles/cx20vzz0g8vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T02:56:22+00:00",
      "Source": "BBC News",
      "Summary": "There was no major breakthrough during the meeting, and President Trump reiterated his interest in acquiring the island shortly afterwards."
    },
    {
      "Title": "Two Palestine Action hunger strikers end protest after 73 days",
      "Link": "https://www.bbc.com/news/articles/cwy1q98qyego?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T02:10:33+00:00",
      "Source": "BBC News",
      "Summary": "The BBC understands that one of the protesters was taken to hospital earlier on Wednesday in a poor condition."
    },
    {
      "Title": "The best e-reader to buy right now",
      "Link": "https://www.theverge.com/23769068/best-ebook-readers",
      "Published": "2026-01-15T00:54:43+00:00",
      "Source": "The Verge",
      "Summary": "Any ebook reader will let you cram a Beauty and the Beast-sized library’s worth of books in your pocket, but so will your phone. An ebook reader offers a more book-like reading experience, with fewer distractions and less eye strain, and many include extra features, like adjustable frontlighting. Some really are pocketable. Others are waterproof [\u0026#8230;]"
    },
    {
      "Title": "X claims it has stopped Grok from undressing people, but of course it hasn’t",
      "Link": "https://www.theverge.com/news/862372/x-grok-ai-policy-update-deepfake-bikini-poses",
      "Published": "2026-01-15T00:46:54+00:00",
      "Source": "The Verge",
      "Summary": "Following the proliferation of the nonconsensual sexual deepfakes on X, the platform has detailed changes to the Grok account\u0027s ability to edit images of real people. They match the changes reported on Tuesday by The Telegraph, as Grok\u0027s responses to prompts like \u0022put her in a bikini\u0022 became censored. But in tests of the feature [\u0026#8230;]"
    },
    {
      "Title": "Serial houseplant killer? Here\u0027s how to keep them alive",
      "Link": "https://www.bbc.com/news/articles/c1lr8vy2v69o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T00:30:21+00:00",
      "Source": "BBC News",
      "Summary": "The three easiest plants to keep alive and how to make sure  you keep them healthy all year round."
    },
    {
      "Title": "Why the UAE has incurred the wrath of Somalia  ",
      "Link": "https://www.bbc.com/news/articles/c99k4jxz0ndo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T00:27:47+00:00",
      "Source": "BBC News",
      "Summary": "The government in Mogadishu has accused the UAE of undermining its sovereignty."
    },
    {
      "Title": "Sanchez mistakes \u0027on me\u0027 - Rosenior defends Chelsea keeper",
      "Link": "https://www.bbc.com/sport/football/articles/c1kl8kelrmxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T00:01:59+00:00",
      "Source": "BBC News",
      "Summary": "Chelsea boss Liam Rosenior defends goalkeeper Robert Sanchez following two mistakes in his side\u0027s 3-2 defeat at home to Arsenal on Wednesday in their Carabao Cup semi-final first-leg tie."
    },
    {
      "Title": "Arsenal take step to ending semi-final nightmares - but regrets remain",
      "Link": "https://www.bbc.com/sport/football/articles/c0q48q8e47go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T23:51:55+00:00",
      "Source": "BBC News",
      "Summary": "Arsenal\u0027s 3-2 win at Chelsea seizes control of their EFL Cup tie - and overcoming their poor record in semi-finals will be the big positive for Mikel Arteta."
    },
    {
      "Title": "The Stream Deck Plus is back to its lowest price",
      "Link": "https://www.theverge.com/gadgets/862274/elgato-stream-deck-plus-controller-deal-sale",
      "Published": "2026-01-14T23:04:09+00:00",
      "Source": "The Verge",
      "Summary": "If you’re looking for a simple way to streamline your workflow, the Elgato Stream Deck Plus is a handy productivity tool for automating everyday tasks. Right now, it’s on sale for $159.99 ($40 off) at Amazon, Best Buy, and B\u0026#38;H Photo, which is its best price to date. Like the standard Stream Deck, the Stream [\u0026#8230;]"
    },
    {
      "Title": "From behind bars, Aung San Suu Kyi casts a long shadow over Myanmar",
      "Link": "https://www.bbc.com/news/articles/c3r197we875o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T23:01:28+00:00",
      "Source": "BBC News",
      "Summary": "The democracy campaigner has spent 20 years in total in detention, five of them since being overthrown by a coup."
    },
    {
      "Title": "Nasa astronauts begin \u0027bittersweet\u0027 medical evacuation from space station",
      "Link": "https://www.bbc.com/news/articles/c205r8n0276o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T22:28:03+00:00",
      "Source": "BBC News",
      "Summary": "The crew is expected to splash down off the coast of California in the early hours of Thursday local time."
    },
    {
      "Title": "Mane destroys Salah\u0027s Afcon dream again - will he get another chance?",
      "Link": "https://www.bbc.com/sport/football/articles/c4g5d10m5veo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T21:56:20+00:00",
      "Source": "BBC News",
      "Summary": "Mohamed Salah\u0027s Afcon dream was ended by Sadio Mane and Senegal on Wednesday night - but how many more chances will the Liverpool forward have to win the competition?"
    },
    {
      "Title": "Hillsborough Law campaigners say they cannot back proposed bill",
      "Link": "https://www.bbc.com/news/articles/cd9e73elv17o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T21:52:22+00:00",
      "Source": "BBC News",
      "Summary": "They are concerned security services will be exempt from a law designed to stop cover-ups."
    },
    {
      "Title": "Verizon’s wireless network is down for many people nationwide",
      "Link": "https://www.theverge.com/news/861956/verizon-is-down-outage-cell-wireless-service-sos-mode",
      "Published": "2026-01-14T21:40:10+00:00",
      "Source": "The Verge",
      "Summary": "The first big outage of 2026 is here, as Verizon customers across the US, including several of our phones, complain that service has been spotty or nonexistent starting at around noon ET, with phones switching to SOS Mode and being unable to connect. This cell service outage follows a \u0022software issue\u0022 that cut off service [\u0026#8230;]"
    },
    {
      "Title": "Naya Connect is a modular mechanical keyboard system for the indecisive",
      "Link": "https://www.theverge.com/news/862123/naya-connect-modular-mechanical-keyboard-kickstarter",
      "Published": "2026-01-14T21:38:30+00:00",
      "Source": "The Verge",
      "Summary": "Naya has already shipped one successful Kickstarter for a weird keyboard. The Naya Create was an ergonomic split deck with four swappable controller addons: a touchpad, a trackball, a rotary encoder, or a 6DoF spatial mouse. The Connect takes that modular concept, applies it to a more traditional flat keyboard form factor, and expands the [\u0026#8230;]"
    },
    {
      "Title": "Amazon didn’t have to go far to find its live-action Kratos",
      "Link": "https://www.theverge.com/games/862089/god-of-war-kratos-casting-amazone-prime-video",
      "Published": "2026-01-14T20:47:08+00:00",
      "Source": "The Verge",
      "Summary": "Amazon has announced the first cast member of its God of War live-action adaptation on Prime Video. Ryan Hurst, known for his work as Opie in Sons of Anarchy and Beta in The Walking Dead, will play the titular God of War, Kratos. Though the casting might come as a bit of a disappointment to [\u0026#8230;]"
    },
    {
      "Title": "\u0027I carried my wife\u0027s body for an hour and a half\u0027 - BBC hears stories of protesters killed in Iran",
      "Link": "https://www.bbc.com/news/articles/c8e54zp5j6no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T20:35:49+00:00",
      "Source": "BBC News",
      "Summary": "BBC Persian has received dozens of accounts from inside Iran. Defiant despite potential repercussions, the witnesses said they wanted to ensure the rest of the world knew of the violence against the protesters. "
    },
    {
      "Title": "BMW says electric M3 will be a ‘new level’ of performance",
      "Link": "https://www.theverge.com/news/861955/bmw-m3-electric-ev-quad-motor-neue-klasse",
      "Published": "2026-01-14T19:30:29+00:00",
      "Source": "The Verge",
      "Summary": "BMW teased its forthcoming all-electric M-series performance sedan today, promising that the quad-motor M3 sports car would feature specs that are truly next level when it arrives in 2027. The M3 will have four electric motors and simulated gear shifting, a feature that is quickly becoming a must-have for electrified sports cars. BMW says the [\u0026#8230;]"
    },
    {
      "Title": "I’ve tested 30 smart locks, and these are the best",
      "Link": "https://www.theverge.com/23393163/best-smart-door-lock",
      "Published": "2026-01-14T19:27:00+00:00",
      "Source": "The Verge",
      "Summary": "A smart lock is an easy solution to some common problems. Locked yourself out? Need to let a friend in to water the plants? Your latchkey kid lost their key? Hands are full, and it’s raining cats and dogs? A smart lock solves all of these problems and more. One of the best smart home [\u0026#8230;]"
    },
    {
      "Title": "Bose’s first-gen QC Ultra headphones have returned to their best price to date",
      "Link": "https://www.theverge.com/gadgets/861286/bose-quietcomfort-ultra-headphones-steam-detective-fest-sale-deal",
      "Published": "2026-01-14T18:56:54+00:00",
      "Source": "The Verge",
      "Summary": "This year’s CES introduced a bevy of unique headphones, including Fender’s first set and a pair that roll up to become a Bluetooth speaker when you want to share your music with friends. However, despite the interesting advancements, we doubt any of them will dethrone our favorite pair for travel: the Bose QuietComfort Ultra Headphones. [\u0026#8230;]"
    },
    {
      "Title": "Netflix’s first original podcasts star Pete Davidson and Michael Irvin",
      "Link": "https://www.theverge.com/news/861971/netflix-original-podcasts-pete-davidson-michael-irvin",
      "Published": "2026-01-14T18:56:28+00:00",
      "Source": "The Verge",
      "Summary": "Netflix is launching its first pair of original video podcasts, hosted by Saturday Night Live alum Pete Davidson and NFL commentator and former star Michael Irvin. While The Pete Davidson Show makes its debut on January 30th, you can find Irvin\u0027s The White House on the streaming service on January 19th. The two shows will [\u0026#8230;]"
    },
    {
      "Title": "Starlink reportedly made free in Iran - but protesters are taking huge risks by using it",
      "Link": "https://www.bbc.com/news/articles/c0r4veg0rrzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T18:15:52+00:00",
      "Source": "BBC News",
      "Summary": "The satellite technology has become a vital communications lifeline after the government shut down the internet last week. "
    },
    {
      "Title": "David Hockney says moving Bayeux Tapestry to UK is \u0027madness\u0027",
      "Link": "https://www.bbc.com/news/articles/c89qendv88yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T17:55:02+00:00",
      "Source": "BBC News",
      "Summary": "The artist claims it is too much of a risk to transport the centuries-old artwork from France."
    },
    {
      "Title": "Tehran morgue videos show the brutality of Iran\u0027s crackdown on protesters",
      "Link": "https://www.bbc.com/news/articles/cly3xpyvxzyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-14T16:58:31+00:00",
      "Source": "BBC News",
      "Summary": "Distressing footage reveals nearly 200 bodies with one victim identified as young as 16. "
    },
    {
      "Title": "\u0027Mental strength therapy\u0027 - Boxer Anthony Joshua returns to gym after car crash",
      "Link": "https://www.bbc.com/sport/boxing/articles/ce3ej719j0jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T07:45:14+00:00",
      "Source": "BBC News",
      "Summary": "British heavyweight Anthony Joshua returns to the gym following the recent car crash which killed two of his close friends and team members."
    },
    {
      "Title": "Rivalries \u0026 records - Australian Open key questions",
      "Link": "https://www.bbc.com/sport/tennis/articles/cpv7j1xvd4do?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T07:28:48+00:00",
      "Source": "BBC News",
      "Summary": "Era-defining rivalries continue and career Grand Slams could be unlocked as the Australian Open starts on Sunday."
    },
    {
      "Title": "Investigation after Air India jet engine sucks in cargo container at Delhi airport",
      "Link": "https://www.bbc.com/news/articles/czx1y99xpqlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T07:23:41+00:00",
      "Source": "BBC News",
      "Summary": "No-one was hurt, but the aircraft\u0027s engine was damaged and it has been grounded for repairs."
    },
    {
      "Title": "Mother demands TikTok \u0027accountability\u0027 after data kept from bereaved parents",
      "Link": "https://www.bbc.com/news/articles/cn8j1rgj07ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T07:21:31+00:00",
      "Source": "BBC News",
      "Summary": "Ellen Roome, from Gloucestershire, is one of a group of parents suing TikTok over online challenges."
    },
    {
      "Title": "Caretaker boss Carrick\u0027s best Man Utd moments",
      "Link": "https://www.bbc.com/sport/football/videos/c5yvgnd67zwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:55:19+00:00",
      "Source": "BBC News",
      "Summary": "With Michael Carrick returning to Manchester United as caretaker manager, BBC Sport takes a look back at some of his best moments for the club as a player in the Premier League."
    },
    {
      "Title": "\u0027We\u0027re in survival mode\u0027: The milk price crisis draining dairy farms",
      "Link": "https://www.bbc.com/news/articles/cedwgl8820vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:29:01+00:00",
      "Source": "BBC News",
      "Summary": "Adam and Lucy Johnstone have seen the money they receive for their milk tumble over the last three months. "
    },
    {
      "Title": "Wales to become only UK nation to lose free baby book scheme",
      "Link": "https://www.bbc.com/news/articles/ce8r34emj62o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:26:18+00:00",
      "Source": "BBC News",
      "Summary": "Parents say the scheme helps them bond with their babies and establish early literacy skills."
    },
    {
      "Title": "\u0027Win or go home\u0027 - who are your picks in wide-open Super Bowl race?",
      "Link": "https://www.bbc.com/sport/american-football/articles/cz6y0wny3z6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:18:45+00:00",
      "Source": "BBC News",
      "Summary": "The NFL play-offs are the most open - and \u0022most unusual\u0022 - they have been for years, but which two teams do you think will reach Super Bowl 60?"
    },
    {
      "Title": "TV doctor says ADHD and OCD diagnoses have \u0027changed my life\u0027",
      "Link": "https://www.bbc.com/news/articles/cwy8ekez554o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:17:08+00:00",
      "Source": "BBC News",
      "Summary": "Love Island star Dr Alex George is calling for improved waiting times for neurodivergent assessments."
    },
    {
      "Title": "Carrick \u0027right choice at this moment\u0027 - Rooney",
      "Link": "https://www.bbc.com/sport/football/articles/c0mkl4n493zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:13:32+00:00",
      "Source": "BBC News",
      "Summary": "Wayne Rooney says caretaker head coach Michael Carrick is the \u0022right choice at this moment in time\u0022 to \u0022steady the ship\u0022 at Manchester United."
    },
    {
      "Title": "From Fiji to Latvia - are cross-border leagues the future?",
      "Link": "https://www.bbc.com/sport/football/articles/cly5wy081y3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T06:13:03+00:00",
      "Source": "BBC News",
      "Summary": "The OFC Professional League kicks off this week and a Baltic League has been proposed, so is there a future for cross-border football competitions?"
    },
    {
      "Title": "The Papers: \u0027Sacked Jenrick defects\u0027 and \u0027Traitories\u0027",
      "Link": "https://www.bbc.com/news/articles/c99km7ym748o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T05:51:07+00:00",
      "Source": "BBC News",
      "Summary": "Former Conservative shadow minister Robert Jenrick joining Reform UK hours after he was sacked by Kemi Badenoch, is the main focus of Friday\u0027s papers. "
    },
    {
      "Title": "Casting is dead. Long live casting!",
      "Link": "https://www.theverge.com/column/861948/casting-netflix-dead",
      "Published": "2026-01-16T04:30:00+00:00",
      "Source": "The Verge",
      "Summary": "This is Lowpass by Janko Roettgers, a newsletter on the ever-evolving intersection of tech and entertainment, syndicated just for The Verge subscribers once a week. Last month, Netflix made the surprising decision to kill off a key feature: With no prior warning, the company removed the ability to cast videos from its mobile apps to [\u0026#8230;]"
    },
    {
      "Title": "Cuba counts cost of alliance after 32 troops killed in Venezuela",
      "Link": "https://www.bbc.com/news/articles/c0q4l3g183jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T02:49:01+00:00",
      "Source": "BBC News",
      "Summary": "The recent events in Venezuela have exposed the strategic risks of Cuba’s foreign entanglements. "
    },
    {
      "Title": "\u0027Baby, don\u0027t move\u0027: Australian woman wakes to find massive python on her chest",
      "Link": "https://www.bbc.com/news/articles/cdex34930r4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T02:32:14+00:00",
      "Source": "BBC News",
      "Summary": "Rachel Bloor had assumed the heavy weight on her chest was her dog."
    },
    {
      "Title": "Chris Mason: Is Farage\u0027s Reform really Conservatives 2.0?",
      "Link": "https://www.bbc.com/news/articles/c20d9dlypnzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T02:19:35+00:00",
      "Source": "BBC News",
      "Summary": "Reform UK is showing \u0027momentum and magnetism\u0027, but faces a familiar critique of being dubbed the Conservatives 2.0, the BBC\u0027s political editor writes. "
    },
    {
      "Title": "Meta has discontinued its metaverse for work, too",
      "Link": "https://www.theverge.com/tech/863209/meta-has-discontinued-its-metaverse-for-work-too",
      "Published": "2026-01-16T02:01:35+00:00",
      "Source": "The Verge",
      "Summary": "Two months before it changed its name to \u0022Meta,\u0022 Facebook CEO Mark Zuckerberg personally introduced us to his metaverse for work: Horizon Workrooms, envisioned as a virtual space for workers to collaborate. Today, the company announced it\u0027s shutting that space down: \u0022Meta has made the decision to discontinue Workrooms as a standalone app, effective February [\u0026#8230;]"
    },
    {
      "Title": "The best Sonos speakers to buy in 2026",
      "Link": "https://www.theverge.com/tech/652171/best-sonos-speakers",
      "Published": "2026-01-16T01:33:35+00:00",
      "Source": "The Verge",
      "Summary": "After the self-induced tumult Sonos went through last year, I can understand why some people are reluctant to spend money on the company’s products. But newly appointed CEO Tom Conrad has shown that he’s determined to get back on track and revitalize Sonos as the leading whole-home audio brand. The contentious mobile app is in [\u0026#8230;]"
    },
    {
      "Title": "Trump threatens to invoke Insurrection Act to quell anti-ICE protests in Minnesota",
      "Link": "https://www.bbc.com/news/articles/cwy15596p98o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T01:32:41+00:00",
      "Source": "BBC News",
      "Summary": "The rarely used law allows the president to use active-duty military personnel for law enforcement."
    },
    {
      "Title": "Venezuelan Nobel Peace Prize winner presents her medal to Trump",
      "Link": "https://www.bbc.com/news/articles/cx2w94wp4p1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T01:27:46+00:00",
      "Source": "BBC News",
      "Summary": "Trump thanked Venezuelan opposition leader María Corina Machado, calling it \u0022a wonderful gesture of mutual respect\u0022. "
    },
    {
      "Title": "I didn\u0027t give up, I let go. How I came to terms with not having children",
      "Link": "https://www.bbc.com/news/articles/cvgj8x7e12ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T01:01:50+00:00",
      "Source": "BBC News",
      "Summary": "After a decade of trying for a baby, Caroline and her husband decided they needed to build a different future."
    },
    {
      "Title": "Actor Timothy Busfield charged with sexually abusing boys on set of TV series",
      "Link": "https://www.bbc.com/news/articles/cj9rvkde0xxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:24:22+00:00",
      "Source": "BBC News",
      "Summary": "The actor starred in the West Wing TV series and is also known for the baseball film Field of Dreams."
    },
    {
      "Title": "Here are the best Apple Watch deals available right now",
      "Link": "https://www.theverge.com/21289209/best-apple-watch-deals",
      "Published": "2026-01-16T00:17:02+00:00",
      "Source": "The Verge",
      "Summary": "In September, Apple launched its latest fleet of smartwatches, including the Apple Watch Series 11, the SE 3, and the Ultra 3. Each wearable offers something a little different (their prices indicate their breadth of features), and we’re already starting to see big price drops. Additionally, we’re still recommending some recent predecessors in Apple’s portfolio, [\u0026#8230;]"
    },
    {
      "Title": "Hospitals with unsafe concrete expected to miss rebuild deadline ",
      "Link": "https://www.bbc.com/news/articles/c0r47199rwyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:12:54+00:00",
      "Source": "BBC News",
      "Summary": "Seven hospitals with Raac that were prioritised last year are not expected to be completed on time - some not until 2032/33. "
    },
    {
      "Title": "Leon to focus on London, stations and airports to revive fortunes, boss says",
      "Link": "https://www.bbc.com/news/articles/cd7z8j9j3ypo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:03:42+00:00",
      "Source": "BBC News",
      "Summary": "The fast food chain is closing its stores outside London as part of a restructuring plan."
    },
    {
      "Title": "Government to give cash payouts to people in financial crisis",
      "Link": "https://www.bbc.com/news/articles/cx2l74eykxdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:02:52+00:00",
      "Source": "BBC News",
      "Summary": "The replacement to the Household Support Fund aims to help people facing sudden difficulties."
    },
    {
      "Title": "Israel moves Yellow Line deeper into Gaza, satellite images show",
      "Link": "https://www.bbc.com/news/articles/ckgxl6zkenqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:02:44+00:00",
      "Source": "BBC News",
      "Summary": "Israel placed and later moved control markers in three areas, with placed deeper inside Gaza than maps suggested. "
    },
    {
      "Title": "Landscape beneath Antarctica\u0027s icy surface revealed in unprecedented detail",
      "Link": "https://www.bbc.com/news/articles/c9qpx2qqeq7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T00:00:21+00:00",
      "Source": "BBC News",
      "Summary": "Scientists believe the map could shed light on how Antarctica\u0027s vast ice sheet will respond to climate change."
    },
    {
      "Title": "Chinese woman\u0027s plea for help killing pigs draws thousands to her village",
      "Link": "https://www.bbc.com/news/articles/cx2y9805g8go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T23:47:47+00:00",
      "Source": "BBC News",
      "Summary": "The woman appealed for help after realising her father could not slaughter the pigs for a village feast alone."
    },
    {
      "Title": "\u0027We\u0027d been on high alert\u0027 - How Jenrick\u0027s dramatic sacking and defection unfolded",
      "Link": "https://www.bbc.com/news/articles/ce3ejzz78gxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T23:47:35+00:00",
      "Source": "BBC News",
      "Summary": "The secret discussions, bombshell leak and sacking which led to Robert Jenrick defecting to the Reform party. "
    },
    {
      "Title": "Grok undressed the mother of one of Elon Musk’s kids — and now she’s suing",
      "Link": "https://www.theverge.com/news/863097/ashley-st-clair-elon-musk-grok-undressing-lawsuit",
      "Published": "2026-01-15T23:33:29+00:00",
      "Source": "The Verge",
      "Summary": "Ashley St. Clair, the mother of one of X owner Elon Musk\u0027s children, is suing his company for enabling its AI to virtually strip her down into a bikini without her consent. St. Clair is one of the many people over the past couple weeks who have found themselves undressed without permission by X\u0027s AI [\u0026#8230;]"
    },
    {
      "Title": "Dave Filoni takes charge of Star Wars as new president of Lucasfilm",
      "Link": "https://www.theverge.com/entertainment/863065/dave-filoni-lucasfilm-president-star-wars",
      "Published": "2026-01-15T23:04:52+00:00",
      "Source": "The Verge",
      "Summary": "There\u0027s a new name in charge of stewarding Star Wars at Lucasfilm. The studio just announced that Dave Filoni - best-known for his work on The Mandalorian and The Clone Wars - will be taking over as president. Former president Kathleen Kennedy, whose departure had been rumored for some time, will be stepping down and [\u0026#8230;]"
    },
    {
      "Title": "Natural Cycles launches wristband to replace thermometers for its FDA-cleared birth control app",
      "Link": "https://www.theverge.com/news/863046/natural-cycles-wristband-digital-birth-control",
      "Published": "2026-01-15T22:46:27+00:00",
      "Source": "The Verge",
      "Summary": "Natural Cycles, the company behind a controversial FDA-cleared birth control app, is replacing its thermometer with a wristband that measures skin temperature, heart rate, and movement during sleep. The newly-launched wristband costs $129.99 and syncs with the Natural Cycles app, which uses an algorithm to determine a person\u0027s \u0022daily fertility status.\u0022 Users can already track [\u0026#8230;]"
    },
    {
      "Title": "You can save over $1,500 on LG’s 65-inch C5 OLED TV",
      "Link": "https://www.theverge.com/gadgets/862989/lg-c5-oled-tv-ebay-deal-sale",
      "Published": "2026-01-15T22:23:59+00:00",
      "Source": "The Verge",
      "Summary": "LG might have just revealed its new C6 OLED TVs at CES 2026, but we still don’t know when they’ll actually hit stores. If you don’t want to wait — or spend a couple thousand dollars on a brand new model — the current-gen LG C5 OLED is a fantastic option now the 65-inch model [\u0026#8230;]"
    },
    {
      "Title": "The best alternatives to Spotify for listening to music",
      "Link": "https://www.theverge.com/22910685/music-listening-service-spotify-apple-youtube-amazon",
      "Published": "2026-01-15T22:19:01+00:00",
      "Source": "The Verge",
      "Summary": "Spotify is probably one of the most well-known music services available (if not the most popular) around - and it seems that the company it taking advantage of that. As of this month, Spotify announced that it was raising its prices, the third time since 2023. If that concerns you (especially if you\u0027re a current [\u0026#8230;]"
    },
    {
      "Title": "Asus says it\u0026#8217;s dropping the RTX 5070 Ti as the memory shortage squeezes supply",
      "Link": "https://www.theverge.com/news/863000/asus-nvidia-rtx-5070-ti-5060-ti-supply-rumors",
      "Published": "2026-01-15T22:06:21+00:00",
      "Source": "The Verge",
      "Summary": "On Thursday, Hardware Unboxed reported that Asus is winding down production of its RTX 5070 Ti, saying, Asus \u0022explicitly told us this model is currently facing a supply shortage and, as such, they have placed the model into end-of-life status.\u0022 They added that the same applies to Asus\u0027s 16GB RTX 5060 Ti, and mentioned how [\u0026#8230;]"
    },
    {
      "Title": "Watch: Troops and vessels from European Nato allies arrive in Greenland",
      "Link": "https://www.bbc.com/news/videos/c0q4lplxzzlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T21:41:48+00:00",
      "Source": "BBC News",
      "Summary": "The limited deployment involves Germany, France, Sweden, Norway, Finland, the Netherlands and the UK."
    },
    {
      "Title": "Iran authorities demanding large sums for return of protesters\u0027 bodies, BBC told",
      "Link": "https://www.bbc.com/news/articles/c4g5md1n1yxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T20:19:13+00:00",
      "Source": "BBC News",
      "Summary": "Multiple sources have told BBC Persian that security forces will not release bodies unless relatives hand over money. "
    },
    {
      "Title": "Jenrick Joins Reform!",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mv8m8v?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T19:29:00+00:00",
      "Source": "BBC News",
      "Summary": "Second helpings of Newscast as Robert Jenrick confirms his defection to Reform."
    },
    {
      "Title": "Weekly quiz: Where are BTS kicking off their comeback tour?",
      "Link": "https://www.bbc.com/news/articles/cn401prgx4jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T19:21:41+00:00",
      "Source": "BBC News",
      "Summary": "How much attention did you pay to what happened in the world over the past seven days?"
    },
    {
      "Title": "After agony in Morocco, what\u0027s next for Salah with club and country?",
      "Link": "https://www.bbc.com/sport/football/articles/cvgnp90ngqwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T18:05:56+00:00",
      "Source": "BBC News",
      "Summary": "What does Mohamed Salah\u0027s future hold for Liverpool and Egypt after their Afcon disappointment?"
    },
    {
      "Title": "How the US, China and Russia are vying for influence in Africa",
      "Link": "https://www.bbc.co.uk/sounds/play/w3ct719w?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "The US, China and Russia all have interests in Central Africa"
    },
    {
      "Title": "When does the Nasa Moon mission launch and who are the Artemis II crew?",
      "Link": "https://www.bbc.com/news/articles/c0q4w3l0wdvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T07:50:56+00:00",
      "Source": "BBC News",
      "Summary": "The first crewed Moon mission in 50 years could launch in February, ahead of a future lunar landing."
    },
    {
      "Title": "Allen up against it \u0026 more drama in Chicago - NFL play-off predictions",
      "Link": "https://www.bbc.com/sport/american-football/articles/cj9rwz0p83po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T07:16:55+00:00",
      "Source": "BBC News",
      "Summary": "BBC Sport\u0027s panel of NFL experts run the rule over the four Divisional Round games being played this weekend as we edge closer to Super Bowl 60."
    },
    {
      "Title": "Plaid Cymru would take minority government over coalition, leader says",
      "Link": "https://www.bbc.com/news/articles/c4grqnjr1qxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T07:15:40+00:00",
      "Source": "BBC News",
      "Summary": "Polling suggests Plaid or Reform UK could win the Senedd election - but fall short of getting a majority."
    },
    {
      "Title": "Jenrick\u0027s move is massive - but could it cause a bigger fight on the right?",
      "Link": "https://www.bbc.com/news/articles/cy9yxwqwjxgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T06:55:28+00:00",
      "Source": "BBC News",
      "Summary": "He\u0027s a big political character adapting to a new political tribe, but his move could be swallowed by a poisonous row."
    },
    {
      "Title": "\u0027Results, results\u0027 - how Guardiola outlasted five Man Utd bosses",
      "Link": "https://www.bbc.com/sport/football/articles/crkrznz15lro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T06:39:04+00:00",
      "Source": "BBC News",
      "Summary": "Pep Guardiola will take on a sixth different Manchester United boss in Saturday\u0027s derby as he approaches a decade at City, but how has he outlasted all of those before Michael Carrick?"
    },
    {
      "Title": "Who else has been named to join Trump to oversee \u0027Gaza\u0027s stabilisation\u0027?",
      "Link": "https://www.bbc.com/news/articles/c9vx7kn33elo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T06:32:20+00:00",
      "Source": "BBC News",
      "Summary": "The White House has released the names of those who will oversee the next phase of the US president\u0027s peace plan for Gaza."
    },
    {
      "Title": "The Papers: \u0027Spy Jenrick\u0027 and \u0027Badenoch says Britain not broken\u0027",
      "Link": "https://www.bbc.com/news/articles/cjw1709n20qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T06:27:19+00:00",
      "Source": "BBC News",
      "Summary": "Former Conservative shadow minister Robert Jenrick\u0027s defection to Reform UK after his sacking by Kemi Badenoch continues to lead the papers."
    },
    {
      "Title": "Badenoch at odds with Jenrick over \u0027broken\u0027 Britain",
      "Link": "https://www.bbc.com/news/articles/cd0y723mr3eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T05:51:32+00:00",
      "Source": "BBC News",
      "Summary": "The Conservative Party leader says telling voters their \u0022country is finished\u0022 only \u0022drags them down\u0022."
    },
    {
      "Title": "Lammy blocks Jimmy Mizen killer\u0027s open prison move",
      "Link": "https://www.bbc.com/news/articles/ckgle83e4llo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T05:12:17+00:00",
      "Source": "BBC News",
      "Summary": "The Ministry of Justice said the decision to block Jake Farhi\u0027s transfer was made for \u0022public protection\u0022."
    },
    {
      "Title": "Watch: Artificial avalanche tumbles down Russian mountain",
      "Link": "https://www.bbc.com/news/videos/c338r7zgydvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T03:27:30+00:00",
      "Source": "BBC News",
      "Summary": "Authorities deliberately triggered the avalanche on Mount Elbrus to release a build up of snow."
    },
    {
      "Title": "A faceless hacker stole my therapy notes – now my deepest secrets are online forever",
      "Link": "https://www.bbc.com/news/articles/c62nzxqw45eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T02:15:51+00:00",
      "Source": "BBC News",
      "Summary": "Meri-Tuuli Auer told her counsellor things about her life she didn\u0027t want her closest family to know."
    },
    {
      "Title": "The mysterious singer with millions of streams - but who (or what) is she?",
      "Link": "https://www.bbc.com/news/articles/cq6v83gq66eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T00:43:18+00:00",
      "Source": "BBC News",
      "Summary": "She has millions of Spotify listeners, but fans don\u0027t know what to believe about whether she\u0027s real."
    },
    {
      "Title": "Is fibre the new protein? The surprising health benefits of the latest wellness trend",
      "Link": "https://www.bbc.com/news/articles/c1lze6n0e6mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T00:34:11+00:00",
      "Source": "BBC News",
      "Summary": "Fibre is making a comeback and this is a wellbeing trend nutritionists are getting excited about."
    },
    {
      "Title": "Under fire from the sea, families in Odesa try to escape Russian barrage",
      "Link": "https://www.bbc.com/news/articles/cnvg70v1z0ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T00:14:00+00:00",
      "Source": "BBC News",
      "Summary": "Ukraine\u0027s third largest city has come under sustained attack on its ports in a Russian bid to sap morale."
    },
    {
      "Title": "Paracetamol is safe in pregnancy, says study refuting US president\u0027s claims about autism",
      "Link": "https://www.bbc.com/news/articles/c74vdgkw1kzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T00:13:47+00:00",
      "Source": "BBC News",
      "Summary": "Researchers say their gold-standard review should put an end to the debate over use of the common painkiller during pregnancy."
    },
    {
      "Title": "I signed as a goalkeeper at 16 - now I\u0027m 28 I run the club ",
      "Link": "https://www.bbc.com/news/articles/cz9vn7k9g4vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T23:23:22+00:00",
      "Source": "BBC News",
      "Summary": "Dan Armstrong joined Scottish League 1 side Queen of the South as a player - now he is chief executive."
    },
    {
      "Title": "A hotline to report vapers and caning if you\u0027re caught: Singapore\u0027s e-cigarette crackdown",
      "Link": "https://www.bbc.com/news/articles/c3387lrz5g4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T23:16:35+00:00",
      "Source": "BBC News",
      "Summary": "The city-state wants to stamp out e-cigarettes with harsh penalties including caning and fines."
    },
    {
      "Title": "Sir Tony Blair appointed to Trump\u0027s \u0027Board of Peace\u0027 for Gaza",
      "Link": "https://www.bbc.com/news/articles/c07xv92vrz2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T23:15:34+00:00",
      "Source": "BBC News",
      "Summary": "The former UK prime minister and US Secretary of State Marco Rubio will sit on the \u0022founding executive board\u0022, the White House says."
    },
    {
      "Title": "Google is appealing a judge’s search monopoly ruling",
      "Link": "https://www.theverge.com/news/863710/google-search-antitrust-monopoly-appeal",
      "Published": "2026-01-16T22:36:55+00:00",
      "Source": "The Verge",
      "Summary": "Google is appealing a federal court\u0027s decision ruling it an illegal online search monopolist. The company filed a notice to appeal on Friday, requesting a pause on the court-ordered remedies meant to restore competition to the online search market. \u0022As we have long said, the Court\u0027s August 2024 ruling ignored the reality that people use [\u0026#8230;]"
    },
    {
      "Title": "Nine-try Bath thump Edinburgh to win Pool 2",
      "Link": "https://www.bbc.com/sport/rugby-union/articles/cx2y99n0q1wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T22:33:43+00:00",
      "Source": "BBC News",
      "Summary": "Bath seal top spot in Pool 2 and a home last-16 match in the Investec Champions Cup with a nine-try thrashing of Edinburgh."
    },
    {
      "Title": "Arrests after youth pictured with machete in central Edinburgh ",
      "Link": "https://www.bbc.com/news/articles/c9qpnv2q84lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T21:39:51+00:00",
      "Source": "BBC News",
      "Summary": "Police said firearms officers were among those who responded to reports of youths carrying bladed weapons"
    },
    {
      "Title": "Trump threatens new tariffs on countries opposed to Greenland takeover ",
      "Link": "https://www.bbc.com/news/articles/c9qpy952xvno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T21:27:56+00:00",
      "Source": "BBC News",
      "Summary": "The president made the threat while a bipartisan group of US lawmakers were visiting Denmark in the hope of easing tensions over the territory. "
    },
    {
      "Title": "Trump and Mid-Atlantic governors want tech companies to pay for new power plants",
      "Link": "https://www.theverge.com/news/863620/data-centers-ai-power-auction-trump",
      "Published": "2026-01-16T20:51:18+00:00",
      "Source": "The Verge",
      "Summary": "The Trump administration and a bipartisan group of governors are pressuring the PJM Interconnection, the biggest electricity market in the US, to hold a power auction meant to spur a massive buildout of new power plants. Together, they\u0027re \u0022urging\u0022 PJM to hold an \u0022emergency\u0022 auction for companies to procure electricity over 15-year contracts. The unusually [\u0026#8230;]"
    },
    {
      "Title": "Fortnite blocks creators from selling prize wheel spins",
      "Link": "https://www.theverge.com/news/863597/fortnite-creators-steal-the-brainrot-prize-wheel-spins-block",
      "Published": "2026-01-16T20:20:42+00:00",
      "Source": "The Verge",
      "Summary": "Epic Games is making a big change to the rules for Fortnite creators just days after allowing them to publish experiences with in-game transactions. Beginning January 20th, experiences - which Epic Games calls \u0022islands\u0022 - will not be able to offer in-island transactions as \u0022a \u0027spin\u0027 or \u0027increased luck\u0027 for a prize wheel,\u0022 according to [\u0026#8230;]"
    },
    {
      "Title": "Google brings its AI videomaker to Workspace users",
      "Link": "https://www.theverge.com/news/863570/google-flow-ai-video-generator-workspace",
      "Published": "2026-01-16T19:37:52+00:00",
      "Source": "The Verge",
      "Summary": "Google is expanding access to its AI videomaking tool. Launched last May, Flow was initially only available to Google AI Pro and AI Ultra subscribers, but now, those with Business, Enterprise, and Education Workspace plans can access it, too. Flow uses Google\u0027s AI video generation model Veo 3.1 to generate eight-second clips based on a [\u0026#8230;]"
    },
    {
      "Title": "The two things AMD subtly revealed at CES that actually excite me",
      "Link": "https://www.theverge.com/tech/862861/amd-ces-2026-socketed-laptop-chips-strix-halo-price",
      "Published": "2026-01-16T19:25:12+00:00",
      "Source": "The Verge",
      "Summary": "As we predicted, the world\u0027s biggest consumer electronics show was a bit of a bust for gamers this year! CES 2026 brought us several neat gamepads, but barely any handhelds and no new desktop GPUs - not from Nvidia, not from Intel, and not from AMD. But if you dig deep, AMD said two things [\u0026#8230;]"
    },
    {
      "Title": "Exiled crown prince urges world to help protesters topple Iran\u0027s government",
      "Link": "https://www.bbc.com/news/articles/c70lx085z85o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T19:07:26+00:00",
      "Source": "BBC News",
      "Summary": "Reza Pahlavi, a US-based opposition figure, called on the world to target Iran\u0027s Revolutionary Guards leadership."
    },
    {
      "Title": "\u0027No panic buy\u0027 - Guehi would cap £414m rebuild as Man City up title ante",
      "Link": "https://www.bbc.com/sport/football/articles/cwywey6yyzlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T19:06:44+00:00",
      "Source": "BBC News",
      "Summary": "Manchester City have upped the ante in the Premier League title race by flexing their muscles in the January transfer window."
    },
    {
      "Title": "What next for Iran\u0027s Supreme Leader?",
      "Link": "https://www.bbc.com/news/articles/cx2ygl4lpl1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T18:58:26+00:00",
      "Source": "BBC News",
      "Summary": "Despite the bloodbath of recent weeks, Ayatollah Khamenei might think he must plough on with an iron fist."
    },
    {
      "Title": "Price beats Littler to end 21-match winning streak",
      "Link": "https://www.bbc.com/sport/darts/articles/c5yvjddj74vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T18:54:14+00:00",
      "Source": "BBC News",
      "Summary": "World champion Luke Littler is knocked out of the Bahrain Masters quarter-finals by Gerwyn Price for the second year in a row."
    },
    {
      "Title": "West Midlands police chief retires over Israeli fans ban row",
      "Link": "https://www.bbc.com/news/articles/c77k670ez6yo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T18:51:33+00:00",
      "Source": "BBC News",
      "Summary": "Craig Guildford blames the \u0022political and media frenzy\u0022 as he confirms his decision to step down."
    },
    {
      "Title": "Verizon-owned Visible is offering outage credits, too",
      "Link": "https://www.theverge.com/news/863554/visible-verizon-outage-credit-january-2026",
      "Published": "2026-01-16T18:41:51+00:00",
      "Source": "The Verge",
      "Summary": "Customers of Visible Wireless, which is owned by Verizon, may be getting a $5 credit toward their next bill in response to a Verizon cell service outage earlier this week. Verizon customers were offered a $20 credit after the outage. As spotted by 9to5Google, a message sent to Visible customers explains: \u0022Yesterday we let you [\u0026#8230;]"
    },
    {
      "Title": "Ted Sarandos says Netflix will commit to 45-day theatrical releases",
      "Link": "https://www.theverge.com/streaming/863511/ted-sarandos-netflix-theatrical-movie-release-windows",
      "Published": "2026-01-16T18:24:07+00:00",
      "Source": "The Verge",
      "Summary": "Though Netflix\u0027s plan to buy Warner Bros. Discovery has prompted concerns about how the deal might hurt the movie theater business, the streamer\u0027s co-CEO says that there is nothing to worry about. In a new interview with The New York Times, Netflix co-CEO Ted Sarandos said that, should the WBD acquisition go through, the streamer [\u0026#8230;]"
    },
    {
      "Title": "Life-extending prostate cancer drug to be offered to thousands in England",
      "Link": "https://www.bbc.com/news/articles/cwywezx86nko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T18:00:47+00:00",
      "Source": "BBC News",
      "Summary": "Abiraterone will be available in a matter of weeks and will be offered to 7,000 men a year.\n"
    },
    {
      "Title": "Ads are coming soon to ChatGPT, starting with shopping links",
      "Link": "https://www.theverge.com/news/863428/openai-chatgpt-shopping-ads-test",
      "Published": "2026-01-16T18:00:00+00:00",
      "Source": "The Verge",
      "Summary": "ChatGPT will soon start showing you sponsored products or services if they\u0027re related to your conversation. In an announcement on Friday, OpenAI says it will start testing ads in the coming weeks for logged-in users in the US who use the app for free or have a ChatGPT Go subscription. The \u0022clearly labeled\u0022 ads will [\u0026#8230;]"
    },
    {
      "Title": "OpenAI releases a cheaper ChatGPT subscription",
      "Link": "https://www.theverge.com/news/863466/openai-chatgpt-go-global-release",
      "Published": "2026-01-16T18:00:00+00:00",
      "Source": "The Verge",
      "Summary": "OpenAI is expanding a low-cost subscription tier called ChatGPT Go to the US and the rest of the world. Go was released in India in August and later became available in another 170 countries prior to Friday\u0027s global release. \u0022In markets where Go has been available, we\u0027ve seen strong adoption and regular everyday use for [\u0026#8230;]"
    },
    {
      "Title": "Body found in search for missing girl, 15",
      "Link": "https://www.bbc.com/news/articles/c2d7l42r3yxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T16:36:16+00:00",
      "Source": "BBC News",
      "Summary": "Grace Keeling, 15, was swept into the sea at Withernsea along with her mother Sarah on 2 January."
    },
    {
      "Title": "Can Robert Jenrick “Unite The Right”?",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mvflvd?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T16:04:00+00:00",
      "Source": "BBC News",
      "Summary": "Adam, Laura and Joe analyse Robert Jenrick’s first interview as a Reform MP."
    },
    {
      "Title": "Wilson beats Robertson in classic to reach semi-finals",
      "Link": "https://www.bbc.com/sport/snooker/articles/cgezr3vx7w5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T15:25:45+00:00",
      "Source": "BBC News",
      "Summary": "Kyren Wilson beats Neil Robertson 6-5 in a classic final-frame decider to book his place in the semi-finals of the Masters against Wu Yize."
    },
    {
      "Title": "The Jan 6th Capitol riots five years on… Why America is still divided",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mvdyxz?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T14:21:00+00:00",
      "Source": "BBC News",
      "Summary": "Republicans are using a new committee to question the events of January 6th 2021."
    },
    {
      "Title": "Brothers who own award-winning chip shops enjoy healthy rivalry",
      "Link": "https://www.bbc.com/news/articles/cjdjy3r9dm5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T15:18:04+00:00",
      "Source": "BBC News",
      "Summary": "Emir and Ouday Hikary\u0027s south Wales businesses have both made the top 10 UK takeaways."
    },
    {
      "Title": "His mum fainted while she was driving - he steered them to safety",
      "Link": "https://www.bbc.com/news/articles/cx2p0rk3y45o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-15T06:15:35+00:00",
      "Source": "BBC News",
      "Summary": "Zac, 12, is commended for his actions in steering the car to safety after his mum fainted."
    },
    {
      "Title": "Player helps ball girl after collapse at Australian Open",
      "Link": "https://www.bbc.com/sport/tennis/articles/crmleyxl4kpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T07:44:16+00:00",
      "Source": "BBC News",
      "Summary": "Turkish player Zeynep Sonmez helps a ball girl after she collapsed during day one of the 2026 Australian Open."
    },
    {
      "Title": "Big chains accused of masquerading as independent restaurants on delivery apps",
      "Link": "https://www.bbc.com/news/articles/c0q53w1wzjjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T07:39:56+00:00",
      "Source": "BBC News",
      "Summary": "Justina John says independent restaurants are \u0022small fish trying to swim with the sharks\u0022."
    },
    {
      "Title": "Around 1,500 soldiers on standby for deployment to Minneapolis, officials say",
      "Link": "https://www.bbc.com/news/articles/c74v0pxg2nvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T07:28:47+00:00",
      "Source": "BBC News",
      "Summary": "The troops are an option should Donald Trump decide to use them to quell anti-ICE protests in the city, an official tells CBS News."
    },
    {
      "Title": "\u0027Literal lifesavers\u0027 rescue nine-month-old baby trapped in burning car",
      "Link": "https://www.bbc.com/news/articles/cvgjvrggnvno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T07:27:59+00:00",
      "Source": "BBC News",
      "Summary": "Wesley Beynon and Marc Willding are hailed heroes after pulling baby Lilah from the flames."
    },
    {
      "Title": "How Malaga-born Diaz became Morocco\u0027s national icon",
      "Link": "https://www.bbc.com/sport/football/articles/cgrdqq5w5ldo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T06:43:13+00:00",
      "Source": "BBC News",
      "Summary": "\u0022100% Spanish\u0022 and \u0022100% Moroccan\u0022 - Africa Cup of Nations final awaits Brahim Diaz, who has become an icon and the symbol of a modern and ambitious Morocco."
    },
    {
      "Title": "Faisal Islam: Trump\u0027s Greenland threats to allies are without parallel",
      "Link": "https://www.bbc.com/news/articles/cx2gjdx241wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T06:38:17+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s latest threats will baffle the leaders of allied nations, writes the BBC\u0027s economics editor. "
    },
    {
      "Title": "British qualifier Fery causes first shock of Australian Open by beating Italian seed",
      "Link": "https://www.bbc.com/sport/tennis/articles/clywqv1evx5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T06:18:52+00:00",
      "Source": "BBC News",
      "Summary": "British qualifier Arthur Fery claims another notable Grand Slam scalp by stunning 20th seed Flavio Cobolli on day one of the Australian Open."
    },
    {
      "Title": "The Papers: \u0027Blackmail over Greenland\u0027 and \u0027Jenrick\u0027s bizarre plot\u0027",
      "Link": "https://www.bbc.com/news/articles/c0q479q4qd2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T05:24:37+00:00",
      "Source": "BBC News",
      "Summary": "Trump\u0027s imposition of tariffs over Greenland and a memo about Robert Jenrick\u0027s defection to Reform make Sunday\u0027s papers."
    },
    {
      "Title": "US judge restricts ICE response to Minneapolis protesters",
      "Link": "https://www.bbc.com/news/articles/cvgprwlplqwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T05:14:58+00:00",
      "Source": "BBC News",
      "Summary": "The legal order comes ahead of planned weekend protests and counter protests in the city amid ongoing immigration enforcement actions. "
    },
    {
      "Title": "\u0027I let team down\u0027, says tearful Allen as Super Bowl wait goes on",
      "Link": "https://www.bbc.com/sport/american-football/articles/cx2wn19xwj3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T04:57:24+00:00",
      "Source": "BBC News",
      "Summary": "Josh Allen endures more play-off heartache as Denver beat Buffalo while Seattle also move within one win of the Super Bowl."
    },
    {
      "Title": "Harry\u0027s war with the press is back in court. But this time it\u0027s different",
      "Link": "https://www.bbc.com/news/articles/cj0ny6p62d5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T02:22:46+00:00",
      "Source": "BBC News",
      "Summary": "This is the Duke of Sussex\u0027s third major court battle accusing newspaper groups of unlawful behaviour."
    },
    {
      "Title": "British Gas took 15 months to refund me £1,500. It\u0027s absurd",
      "Link": "https://www.bbc.com/news/articles/c62n9qp3gezo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T01:32:14+00:00",
      "Source": "BBC News",
      "Summary": "Beth Kojder said it was frustrating it took so long to get her money back, given the ombudsman had ruled in her favour nearly a year ago."
    },
    {
      "Title": "Nasa\u0027s mega Moon rocket arrives at launch pad for Artemis II mission",
      "Link": "https://www.bbc.com/news/articles/cly148lvyevo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T01:22:46+00:00",
      "Source": "BBC News",
      "Summary": "Final preparations now get underway for the first crewed mission to the Moon in more than 50 years."
    },
    {
      "Title": "Half American, half Canadian: Take a ride in a car welded from two front ends",
      "Link": "https://www.bbc.com/news/videos/c89q0e9dvpwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:54:22+00:00",
      "Source": "BBC News",
      "Summary": "The owner of this quirky vehicle says it gets a \u0022lot of smiles per gallon\u0022 on the streets of Detroit."
    },
    {
      "Title": "Watch: Fishing on a frozen river for respite from the war in Ukraine",
      "Link": "https://www.bbc.com/news/videos/cy09vw9172qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:46:58+00:00",
      "Source": "BBC News",
      "Summary": "On the frozen surface of Kyiv\u0027s River Dnipro, men are fishing to take their minds off the war with Russia."
    },
    {
      "Title": "I left my toxic mums\u0027 group because I\u0027d had enough of being judged",
      "Link": "https://www.bbc.com/news/articles/cn42q39qg4ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:10:16+00:00",
      "Source": "BBC News",
      "Summary": "Women describe experiences dealing with ostracisation and toxic behaviour from other mothers."
    },
    {
      "Title": "Gangland killing at a funeral shocks idyllic French island",
      "Link": "https://www.bbc.com/news/articles/c620nq38y6po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:08:38+00:00",
      "Source": "BBC News",
      "Summary": "Corsica is shaken by the shooting, which brings into stark relief one of the highest murder rates in France."
    },
    {
      "Title": "Heated Rivalry author thought ice-hockey romance was too steamy for TV",
      "Link": "https://www.bbc.com/news/articles/cj4lwey7e1vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:08:19+00:00",
      "Source": "BBC News",
      "Summary": "Rachel Reid thought her books, about an illicit relationship between two star hockey players, were \u0022unadaptable\u0022."
    },
    {
      "Title": "A deadly fire swept through a nightclub in just 90 seconds. I got out",
      "Link": "https://www.bbc.com/news/articles/czejykzg77po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:08:10+00:00",
      "Source": "BBC News",
      "Summary": "Twenty-two years before the Swiss ski resort fire, Gina escaped a near-identical disaster. Would you know what to do if it happened to you?"
    },
    {
      "Title": "From surge in patriotism to fewer US trips - Trump\u0027s impact on Canada ",
      "Link": "https://www.bbc.com/news/articles/crmlvym2e3eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T00:07:52+00:00",
      "Source": "BBC News",
      "Summary": "The first year of Donald Trump\u0027s second term has had a profound effect on Canada, from its politics and economy to the way Canadians shop and travel."
    },
    {
      "Title": "\u0027Young 40s\u0027: Gen Z has found a new way to mock millennials for their style in South Korea",
      "Link": "https://www.bbc.com/news/articles/c78vw30p1d2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T23:08:39+00:00",
      "Source": "BBC News",
      "Summary": "Even the iPhone, long considered the preserve of the youth, has been recast as a tacky trademark of Young 40s."
    },
    {
      "Title": "US strike in Syria kills man linked to attack on soldiers, officials say",
      "Link": "https://www.bbc.com/news/articles/cm2jdklp5m8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T23:02:50+00:00",
      "Source": "BBC News",
      "Summary": "The US Central Command  said in a statement that Bilal Hasan al-Jasim was killed in the attack on Friday."
    },
    {
      "Title": "Missed opportunity for Arsenal - but were they denied \u0027clear penalty\u0027?",
      "Link": "https://www.bbc.com/sport/football/articles/cx2p7dkxxgpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T22:13:08+00:00",
      "Source": "BBC News",
      "Summary": "Arsenal have moved seven points clear at the top of the Premier League after a 0-0 draw at Nottingham Forest - but should the Gunners have been awarded a penalty?"
    },
    {
      "Title": "Iran supreme leader acknowledges thousands killed during recent protests",
      "Link": "https://www.bbc.com/news/articles/ckglee733wno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T20:14:57+00:00",
      "Source": "BBC News",
      "Summary": "Ayatollah Ali Khamenei says some deaths were “inhuman” and “savage” but blames the US. "
    },
    {
      "Title": "What a seventh term for 81-year-old leader means for Uganda",
      "Link": "https://www.bbc.com/news/articles/cx20qj1pwrwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T19:55:16+00:00",
      "Source": "BBC News",
      "Summary": "Yoweri Museveni has won a record seventh term in elections after promising that the fledgling oil sector will boost the economy."
    },
    {
      "Title": "Was this the day Spurs fans finally lost all faith in Frank?",
      "Link": "https://www.bbc.com/sport/football/articles/c78v4vpgp15o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T19:18:06+00:00",
      "Source": "BBC News",
      "Summary": "Was the dismal home loss to struggling West Ham the day Spurs fans finally lost all faith in head coach Thomas Frank, asks chief football writer Phil McNulty?"
    },
    {
      "Title": "Molly Russell\u0027s dad says under-16 social media ban would be wrong",
      "Link": "https://www.bbc.com/news/articles/cpwn1vjy0y5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T18:57:12+00:00",
      "Source": "BBC News",
      "Summary": "The online safety campaigner says it is better to enforce current laws than use \u0022sledgehammer\u0022 techniques."
    },
    {
      "Title": "Health board admits fatal infections probably caused by water system",
      "Link": "https://www.bbc.com/news/articles/c1klwleymy0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T18:43:56+00:00",
      "Source": "BBC News",
      "Summary": "NHS Greater Glasgow and Clyde had consistently denied its water system was responsible for causing infections which led to the deaths of cancer patients."
    },
    {
      "Title": "Disney deleted a Thread because people kept putting anti-fascist quotes from its movies in the replies",
      "Link": "https://www.theverge.com/news/863980/disney-deleted-anti-fascist-thread",
      "Published": "2026-01-17T18:38:13+00:00",
      "Source": "The Verge",
      "Summary": "\u0022Share a Disney quote that sums up how you\u0027re feeling right now!\u0022 That\u0027s what Disney posted on Threads the other day, and people immediately replied with lines from Star Wars, The Hunchback of Notre Dame, and even Mary Poppins. The throughline between all the quotes: they were pretty pointedly anti-fascist and clearly aimed at the [\u0026#8230;]"
    },
    {
      "Title": "Ant and Dec sorry after \u0027insensitive\u0027 podcast promo prompts backlash",
      "Link": "https://www.bbc.com/news/articles/c78enz4xeddo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-17T17:51:22+00:00",
      "Source": "BBC News",
      "Summary": "A social media video publicising their new podcast drew criticism for evoking \u0022suicide imagery\u0022. "
    },
    {
      "Title": "The Setapp Mobile iOS store is shutting down on February 16th",
      "Link": "https://www.theverge.com/news/863978/setapp-mobile-ios-store-shutdown",
      "Published": "2026-01-17T17:36:54+00:00",
      "Source": "The Verge",
      "Summary": "Setapp Mobile seemed like one of the many alternative app markets with promise that launched in the wake of the EU\u0027s Digital Markets Act (DMA). While the law may have forced Apple to allow third-party app stores on its devices, it couldn\u0027t make users actually embrace them. MacPaw, the Ukrainian developer behind the subscription-based Setapp, [\u0026#8230;]"
    },
    {
      "Title": "The LG C5 and Apple’s M4 Mac Mini are both steeply discounted this weekend",
      "Link": "https://www.theverge.com/gadgets/863503/apple-mac-mini-m4-lg-c5-oled-tv-deal-sale",
      "Published": "2026-01-17T15:38:25+00:00",
      "Source": "The Verge",
      "Summary": "Happy Saturday, folks! This week, Best Buy kicked off its so-called “Winter Sale,” introducing a whole host of price cuts that range from not-so-good to legitimately great, at least for this time of year. We’ll be publishing many of the highlights in a dedicated news post tomorrow, though, per usual, not all of this week’s [\u0026#8230;]"
    },
    {
      "Title": "All You Need Is Kill is a dazzling movie with the soul of a video game",
      "Link": "https://www.theverge.com/entertainment/862881/all-you-need-is-kill-review",
      "Published": "2026-01-17T15:00:00+00:00",
      "Source": "The Verge",
      "Summary": "While Hollywood has repeatedly tried adapting stories from Japanese manga, vanishingly few of them have been as good as Edge of Tomorrow - Warner Bros.\u0027 2014 live-action film based on Hiroshi Sakurazaka\u0027s sci-fi light novel All You Need Is Kill. Edge of Tomorrow wasn\u0027t a one-to-one translation of All You Need Is Kill\u0027s original story [\u0026#8230;]"
    },
    {
      "Title": "A cute frog game that remixes Nintendo\u0026#8217;s best",
      "Link": "https://www.theverge.com/games/860917/big-hops-review-pc-nintendo-switch-ps5",
      "Published": "2026-01-17T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "While playing Big Hops, a new 3D platformer starring an adorable frog, I kept feeling like I was breaking the game - and, like with The Legend of Zelda: Tears of the Kingdom, breaking it is kind of the point. In Big Hops, you play as a frog named Hop. Early on, Hop is taken [\u0026#8230;]"
    },
    {
      "Title": "Minnesota wants to win a war of attrition",
      "Link": "https://www.theverge.com/policy/863632/minnesota-walz-trump-sousveillance-ice",
      "Published": "2026-01-17T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "As masked and armed men in combat armor swarmed throughout the Twin Cities, Gov. Tim Walz took to primetime television to ask Minnesotans to film ICE. The videos, he said, would \u0022create a database of the atrocities against Minnesotans - not just to establish a record for posterity, but to bank evidence for future prosecution.\u0022 [\u0026#8230;]"
    },
    {
      "Title": "Fear and blogging (and prerelease laptop testing) in Las Vegas",
      "Link": "https://www.theverge.com/tech/862985/asus-zenbook-a16-snapdragon-x2-ces-early-testing-hands-on",
      "Published": "2026-01-17T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "At CES, I did what you\u0027re not supposed to do: I brought a pre-production laptop to use as my primary workhorse during a hectic event. The unproven rifle in question is the new Arm-based Asus Zenbook A16. It\u0027s a 16-inch laptop that weighs less than a 13-inch MacBook Air and comes with a high-end Snapdragon [\u0026#8230;]"
    },
    {
      "Title": "Our favorite cozy game is back",
      "Link": "https://www.theverge.com/tech/863614/animal-crossing-3-rip-netflix-cowork-installer",
      "Published": "2026-01-17T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Hi, friends! Welcome to Installer No. 112, your guide to the best and Verge-iest stuff in the world. (If you\u0027re new here, welcome, I hope your home is warmer than mine right now, and also you can read all the old editions at the Installer homepage.) This week, I\u0027ve been reading about WhatsApp and Gavin [\u0026#8230;]"
    },
    {
      "Title": "TCL’s PlayCube projector is more fun than a Rubik’s Cube",
      "Link": "https://www.theverge.com/reviews/863910/tcl-playcube-portable-projector-review-battery",
      "Published": "2026-01-17T08:55:35+00:00",
      "Source": "The Verge",
      "Summary": "The best all-in-one portable projector is the one that makes all the right compromises. It needs to balance image and sound quality with battery life and responsiveness in a device that\u0027s not too expensive and small enough to take anywhere. TCL\u0027s fun little PlayCube delivers the right mix to justify paying $800 for a 1080p [\u0026#8230;]"
    },
    {
      "Title": "The best deals on MacBooks right now",
      "Link": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
      "Published": "2026-01-16T23:48:15+00:00",
      "Source": "The Verge",
      "Summary": "Apple currently sells MacBooks equipped with its own M-series processors in a wide range of sizes and price points, all of which run the company’s newest operating system, macOS 26. Purchasing a new MacBook can be complicated if you’re trying to figure out what specs you need, but finding a deal on a relatively speedy [\u0026#8230;]"
    },
    {
      "Title": "More than 60 Labour MPs urge PM to ban social media for under-16s",
      "Link": "https://www.bbc.com/news/articles/c1dk0g5yk06o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T08:06:50+00:00",
      "Source": "BBC News",
      "Summary": "The MPs says the UK \u0022risks being left behind\u0022 if it does not adopt a ban similar to one in Australia."
    },
    {
      "Title": "Japan PM Takaichi set to call snap election",
      "Link": "https://www.bbc.com/news/articles/c1dk0x0v6pdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T07:06:07+00:00",
      "Source": "BBC News",
      "Summary": "Since taking office last October, Sanae Takaichi has enjoyed high public support."
    },
    {
      "Title": "High-speed train collision in Spain kills at least 39",
      "Link": "https://www.bbc.com/news/articles/cedw6ylpynyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T07:01:17+00:00",
      "Source": "BBC News",
      "Summary": "More than 400 passengers were on board the trains that derailed near the city of Córdoba in Spain\u0027s worst rail crash in more than a decade. "
    },
    {
      "Title": "Red cards, VAR and offside laws facing Ifab review",
      "Link": "https://www.bbc.com/sport/football/articles/czdq0m2z0emo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:55:05+00:00",
      "Source": "BBC News",
      "Summary": "The Ifab\u0027s annual business meeting in London will discuss changes to the laws for the Fifa World Cup and domestic leagues."
    },
    {
      "Title": "China hits growth goal after exports boom defied US tariffs",
      "Link": "https://www.bbc.com/news/articles/cgk8zd287myo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:40:23+00:00",
      "Source": "BBC News",
      "Summary": "Official figures suggest China\u0027s economy hit its target but analysts have cast doubt on the data."
    },
    {
      "Title": "US believes its power matters more than international law, UN chief tells BBC",
      "Link": "https://www.bbc.com/news/articles/c4g0zx0llpzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:17:06+00:00",
      "Source": "BBC News",
      "Summary": "António Guterres says Washington\u0027s \u0022clear conviction\u0022 is that multilateral solutions are irrelevant."
    },
    {
      "Title": "Carrick gave fans \u0027taste\u0027 of Ferguson era - Rooney",
      "Link": "https://www.bbc.com/sport/football/articles/cly5gr43ww7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:10:38+00:00",
      "Source": "BBC News",
      "Summary": "Wayne Rooney says Man Utd\u0027s younger fans got a \u0022taste of what it was like under Sir Alex Ferguson\u0022 in the win over Man City - and hopes it is a glimpse of what is to come under Michael Carrick."
    },
    {
      "Title": "Jones left in tears as players battle injuries \u0026 cramp in Melbourne",
      "Link": "https://www.bbc.com/sport/tennis/articles/c1kl0z9e27go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:05:55+00:00",
      "Source": "BBC News",
      "Summary": "Injury wrecks Francesca Jones\u0027 hopes of earning a first Australian Open main-draw win, while Marina Stakusic is taken off court on a wheelchair on day two."
    },
    {
      "Title": "\u0027Credit-score company encouraged me to borrow again when I was nearly debt-free\u0027",
      "Link": "https://www.bbc.com/news/articles/c4g0m1j4042o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T05:53:46+00:00",
      "Source": "BBC News",
      "Summary": "A woman who had nearly paid off a £10,000 debt was sent emails suggesting she could apply for new credit cards."
    },
    {
      "Title": "The Papers: \u0027EU weighs up €93bn retaliation\u0027 and \u0027Raducanu\u0027s fine start\u0027",
      "Link": "https://www.bbc.com/news/articles/cz7yp923gz8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T05:35:56+00:00",
      "Source": "BBC News",
      "Summary": "The fallout from Donald Trump\u0027s tariff threat to EU allies that oppose his campaign to annex Greenland dominates Monday\u0027s papers."
    },
    {
      "Title": "Fourteen dead, dozens missing in massive Pakistan mall fire",
      "Link": "https://www.bbc.com/news/articles/c150pg5dvp2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T05:22:01+00:00",
      "Source": "BBC News",
      "Summary": "The blaze at the Gul Plaza in Karachi raged for more than 24 hours before it was put out."
    },
    {
      "Title": "Andrew Rosindell quits Tories and defects to Reform UK",
      "Link": "https://www.bbc.com/news/articles/c98jn1wywdyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T04:42:43+00:00",
      "Source": "BBC News",
      "Summary": "His defection comes days after former shadow justice minister Robert Jenrick joined Reform."
    },
    {
      "Title": "How crypto criminals stole $700 million from people - often using age-old tricks",
      "Link": "https://www.bbc.com/news/articles/c93w30gl5jno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:48:24+00:00",
      "Source": "BBC News",
      "Summary": "As crypto wealth continues to grow, criminals are mixing sophisticated hacks with deception, and in some cases, real life violence."
    },
    {
      "Title": "\u0027Shameful\u0027 and \u0027terrible look\u0027 - the chaos that marred Senegal\u0027s Afcon triumph",
      "Link": "https://www.bbc.com/sport/football/articles/c70ljednyl6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:20:02+00:00",
      "Source": "BBC News",
      "Summary": "Senegal beat Morocco to win the Africa Cup of Nations for a second time - but only after the final was overshadowed when they temporarily refuse to play after the hosts are awarded a controversial stoppage time-penalty with the match 0-0. "
    },
    {
      "Title": "Alzheimer\u0027s finger-prick blood test could transform diagnosis, experts say",
      "Link": "https://www.bbc.com/news/articles/cq5y85e8d2xo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:16:36+00:00",
      "Source": "BBC News",
      "Summary": "An international trial involving 1,000 volunteers will aim to detect biomarkers associated with the condition."
    },
    {
      "Title": "Will Frank and Glasner see the season out?",
      "Link": "https://www.bbc.com/sport/football/videos/c5yxpgkgn53o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:12:34+00:00",
      "Source": "BBC News",
      "Summary": "Match of the Day\u0027s Kelly Cates, Joe Hart and Ellen White discuss whether it is possible for Tottenham manager Thomas Frank and Crystal Palace boss Oliver Glasner to remain at their clubs until the end of the season."
    },
    {
      "Title": "Hispanic voters sent Trump back to power. Now some are souring",
      "Link": "https://www.bbc.com/news/articles/clym85ev64lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:05:05+00:00",
      "Source": "BBC News",
      "Summary": "After sending Trump to the White House in a historic shift, some Latinos feel he\u0027s not improving the economy."
    },
    {
      "Title": "Socks, salsa and stand-up comedy... easy ways to find joy in January",
      "Link": "https://www.bbc.com/news/articles/cql4e2yele4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:04:16+00:00",
      "Source": "BBC News",
      "Summary": "It might be the most miserable time of the year but there is something you can do about that."
    },
    {
      "Title": "Faisal Islam: Global disruption looms large over biggest-ever Davos",
      "Link": "https://www.bbc.com/news/articles/cx2p3e245npo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:00:33+00:00",
      "Source": "BBC News",
      "Summary": "Expect the World Economic Forum this week to be both the centre of the world and totally bizarre."
    },
    {
      "Title": "\u0027The finest in the world\u0027: Why the US is buying icebreakers from Finland",
      "Link": "https://www.bbc.com/news/articles/c0q48d71ke8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T00:00:19+00:00",
      "Source": "BBC News",
      "Summary": "The Nordic nation leads the way when it comes to both the design and construction of the vessels."
    },
    {
      "Title": "Prince Harry to appear in court in legal action against Daily Mail publishers",
      "Link": "https://www.bbc.com/news/videos/clyz1d1lqqro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T23:58:17+00:00",
      "Source": "BBC News",
      "Summary": "Prince Harry is to give evidence in London High Court on Thursday as part of legal battle against the publishers of the Daily Mail."
    },
    {
      "Title": "Trump tests boundaries of his power as Minnesota pushes back ",
      "Link": "https://www.bbc.com/news/articles/cpqy5q1eeywo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T23:02:54+00:00",
      "Source": "BBC News",
      "Summary": "The streets of Minneapolis feel like a battle of wills between a Republican US president and a Democratic city and state."
    },
    {
      "Title": "Government pulls Hillsborough Law debate after backlash",
      "Link": "https://www.bbc.com/news/articles/c5yvldj47v9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T22:52:36+00:00",
      "Source": "BBC News",
      "Summary": "It was facing a potential rebellion by some Labour MPs over how the law would apply to security services."
    },
    {
      "Title": "Syria agrees ceasefire with Kurdish-led forces after two weeks of clashes",
      "Link": "https://www.bbc.com/news/articles/c4gwk37ewvwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T22:25:31+00:00",
      "Source": "BBC News",
      "Summary": "President Ahmed al-Sharaa said the deal would allow the Syrian state to reassert control over most areas."
    },
    {
      "Title": "\u0027Arsenal will never forgive themselves if they don\u0027t win title now\u0027",
      "Link": "https://www.bbc.com/sport/football/articles/cm24736mrm7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T20:43:29+00:00",
      "Source": "BBC News",
      "Summary": "This is Mikel Arteta and Arsenal\u0027s \u0022now or never\u0022 moment as Premier League title rivals stumble badly, says chief football writer Phil McNulty."
    },
    {
      "Title": "You need to listen to the cosmic horror-comedy podcast Welcome to Night Vale",
      "Link": "https://www.theverge.com/column/864078/cosmic-horror-comedy-podcast-welcome-to-night-vale",
      "Published": "2026-01-18T20:30:00+00:00",
      "Source": "The Verge",
      "Summary": "It\u0027s relatively rare for a podcast to last 14 years, especially a fiction one. In fact, as far as I can tell, Welcome to Night Vale is the longest continually running fiction podcast out there. (Some will argue it\u0027s actually We\u0027re Alive, but that has taken a few significant breaks between seasons.) The story of [\u0026#8230;]"
    },
    {
      "Title": "Rail disruption warning after engineering overruns",
      "Link": "https://www.bbc.com/news/articles/cdjnrdl8d24o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T19:22:23+00:00",
      "Source": "BBC News",
      "Summary": "National Rail warns of disruption until the end of Monday after weekend work not finished in time."
    },
    {
      "Title": "Cancer patients \u0027warned for years\u0027 about hospital water infections",
      "Link": "https://www.bbc.com/news/articles/czx3n6p136do?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T19:17:01+00:00",
      "Source": "BBC News",
      "Summary": "John Cuddihy told BBC Scotland News his late daughter\u0027s experiences \u0022must continue to echo beyond her lifetime\u0022."
    },
    {
      "Title": "Microsoft’s first Windows 11 update of 2026 stopped some computers from shutting down",
      "Link": "https://www.theverge.com/news/864032/microsofts-out-of-band-windows-11-update-bug",
      "Published": "2026-01-18T16:46:15+00:00",
      "Source": "The Verge",
      "Summary": "Microsoft released its first security update of 2026 for Windows 11 on January 13th. Just four days later, it was forced to release an emergency out-of-band update to fix some pretty serious bugs, the first one introduced. The security patch was stopping some systems from shutting down or hibernating properly, and also preventing some users [\u0026#8230;]"
    },
    {
      "Title": "BBC demands tighter vetting after Apprentice candidate\u0027s offensive social media posts",
      "Link": "https://www.bbc.com/news/articles/czdqr5ly39zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T16:43:39+00:00",
      "Source": "BBC News",
      "Summary": "A contestant due to appear on the forthcoming series is found to have previously posted offensive messages on social media."
    },
    {
      "Title": "Here are the 10 deals worth grabbing from Best Buy’s winter sales event",
      "Link": "https://www.theverge.com/gadgets/863660/best-buy-winter-sale-2026-oled-tvs-headphones-fitness-trackers-deal-sale",
      "Published": "2026-01-18T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Good deals are often hard to come by at the beginning of the year — which is precisely what makes Best Buy’s Winter Sale worth checking out. The ongoing sales event features discounts on everything from big-ticket OLED TVs to smaller electronics, including fitness trackers that can help you achieve your New Year’s resolutions. There [\u0026#8230;]"
    },
    {
      "Title": "Trump’s Tariff Threats Over Greenland",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mvqbpz?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-18T13:34:00+00:00",
      "Source": "BBC News",
      "Summary": "The US president plans more tariffs on countries against his proposed Greenland takeover."
    },
    {
      "Title": "Kaoss Pad V is the first major upgrade to Korg’s touch-based effects in 13 years",
      "Link": "https://www.theverge.com/news/864003/korg-kaoss-pad-v-namm",
      "Published": "2026-01-18T13:30:00+00:00",
      "Source": "The Verge",
      "Summary": "The Kaoss Pad has seen many different iterations, but the mainline effect unit and sampler hasn\u0027t received an update since the launch of the KP3\u002B in 2013. Korg has finally given it the attention it deserves with the release of the Kaoss Pad V. Rather than a dramatic reimagining of what a Kaoss Pad is, [\u0026#8230;]"
    },
    {
      "Title": "Why Coinbase derailed the crypto industry’s political future",
      "Link": "https://www.theverge.com/policy/864008/senate-clarity-act-coinbase-crypto-market",
      "Published": "2026-01-18T13:10:00+00:00",
      "Source": "The Verge",
      "Summary": "January was going to be a landmark month for the crypto industry. The Senate would start negotiating the finer details of the CLARITY Act, a major law that would finally enshrine the fundamental structure of how the crypto market could legally operate in the United States: what digital assets counted as a security versus a [\u0026#8230;]"
    },
    {
      "Title": "Under Musk, the Grok disaster was inevitable",
      "Link": "https://www.theverge.com/column/863502/grok-deepfake-musk",
      "Published": "2026-01-18T13:00:00+00:00",
      "Source": "The Verge",
      "Summary": "This is The Stepback, a weekly newsletter breaking down one essential story from the tech world. For more on dystopian developments in AI, follow Hayden Field. The Stepback arrives in our subscribers\u0027 inboxes at 8AM ET. Opt in for The Stepback here. How it started You could say it all started with Elon Musk\u0027s AI [\u0026#8230;]"
    },
    {
      "Title": "The post-World War II era is over. What comes next?",
      "Link": "https://www.bbc.co.uk/sounds/play/w3ct715c?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-16T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "Did the rules-based order ever exist and what could replace it if it goes away?"
    },
    {
      "Title": "Roland’s Go:Mixer Studio turns your phone into a mobile music studio",
      "Link": "https://www.theverge.com/entertainment/864095/roland-gomixer-studio-namm",
      "Published": "2026-01-20T08:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Roland now offers a more capable audio mixer for phones and tablets with the launch of the Go:Mixer Studio. The Go:Mixer audio interface lineup has always been a bit limited, better suited for scrappy live streams and capturing quick demos on their phones than professional recording. The Go:Mixer Studio is an attempt to actually reach [\u0026#8230;]"
    },
    {
      "Title": "UK wage growth eases and payrolls drop",
      "Link": "https://www.bbc.com/news/articles/cddgrg87ly5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T07:50:03+00:00",
      "Source": "BBC News",
      "Summary": "Official figures show that the pace of private sector wage growth slowed to the lowest rate in five years."
    },
    {
      "Title": "Surfer injured in fourth shark attack in Australian state in 48 hours",
      "Link": "https://www.bbc.com/news/articles/cqxy3523nq2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T07:05:23+00:00",
      "Source": "BBC News",
      "Summary": "Authorities are warning people to stay out of the Australian state\u0027s waterways after recent rainfall."
    },
    {
      "Title": "\u0027Timid\u0027 Keys overcomes nerves to start title defence",
      "Link": "https://www.bbc.com/sport/tennis/articles/cdxjeleewk4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:49:30+00:00",
      "Source": "BBC News",
      "Summary": "Madison Keys overcomes nerves to begin her Australian Open title defence with victory over Grand Slam debutant Oleksandra Oliynykova."
    },
    {
      "Title": "The day I discovered the Everton contract Revie never signed",
      "Link": "https://www.bbc.com/sport/football/articles/cy8yp1nqd21o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:39:26+00:00",
      "Source": "BBC News",
      "Summary": "This is the story of how an unsigned contract that lay hidden in a bungalow for more than 50 years could have changed the course of English football."
    },
    {
      "Title": "\u0027Just bad luck\u0027: The teenage cousins living with inoperable brain tumours",
      "Link": "https://www.bbc.com/news/articles/c5yqrwn5z3lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:20:12+00:00",
      "Source": "BBC News",
      "Summary": "Lachlan Lindsay and Hazel Dempster were both diagnosed with brain tumours as children. "
    },
    {
      "Title": "Australia parliament votes on tighter gun controls after Bondi shooting",
      "Link": "https://www.bbc.com/news/articles/c20ge5qwdl2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:44:14+00:00",
      "Source": "BBC News",
      "Summary": "Parliament is also debating hate speech reforms after last month\u0027s deadly attack on a Jewish festival."
    },
    {
      "Title": "Spain to hold three days of mourning for victims of high-speed train crash",
      "Link": "https://www.bbc.com/news/articles/c2d7rk0865go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:26:03+00:00",
      "Source": "BBC News",
      "Summary": "At least 40 people died in Sunday\u0027s collision in  southern Spain, the worst crash the country has seen in more than a decade."
    },
    {
      "Title": "The Papers: \u0027Brooklyn goes nuclear\u0027 and UK teenagers \u0027face social media ban\u0027",
      "Link": "https://www.bbc.com/news/articles/c14rpdd3rn8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T05:14:00+00:00",
      "Source": "BBC News",
      "Summary": "Brooklyn Peltz Beckham\u0027s statement on his strained relationship with his parents features prominently on Tuesday\u0027s papers."
    },
    {
      "Title": "Northern Lights illuminate UK skies in hues of pink and green",
      "Link": "https://www.bbc.com/news/articles/c0q4pj5j729o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T04:13:18+00:00",
      "Source": "BBC News",
      "Summary": "The phenomenon known as the Aurora Borealis is the result of solar eruptions  sending particles that interact with the Earth\u0027s atmosphere."
    },
    {
      "Title": "Goodbye gator, see you later: San Francisco mourns its beloved albino alligator ",
      "Link": "https://www.bbc.com/news/articles/c62r0y2nkllo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:53:40+00:00",
      "Source": "BBC News",
      "Summary": "California names a street after reptile Claude, who won millions of hearts with his albinism."
    },
    {
      "Title": "\u0027Anger is healthy\u0027: Why women are smashing stuff up for fun",
      "Link": "https://www.bbc.com/news/articles/czjgkwvv7dvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:42:19+00:00",
      "Source": "BBC News",
      "Summary": "Why a reportedly growing number of women are paying to smash up old TVs and furniture in rage rooms."
    },
    {
      "Title": "Hidden cameras reveal what hedgehogs really get up to after dark ",
      "Link": "https://www.bbc.com/news/articles/cdjnr7lr7pzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:34:56+00:00",
      "Source": "BBC News",
      "Summary": "Hedgehogs are surprisingly common in UK gardens, with food a powerful attraction, say scientists."
    },
    {
      "Title": "The hospitals where waiting times are getting worse. Is yours one of them?",
      "Link": "https://www.bbc.com/news/articles/ckgjk89n2nyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:31:46+00:00",
      "Source": "BBC News",
      "Summary": "Nearly a quarter of hospital trusts in England have seen waiting times deteriorate in the past year."
    },
    {
      "Title": "More than 100 vehicles pile up on US motorway after crash",
      "Link": "https://www.bbc.com/news/videos/cly9kdklzrlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:15:14+00:00",
      "Source": "BBC News",
      "Summary": "Jack-knifed trucks were left strewn across the road after heavy snow in Ottawa Country, Michigan."
    },
    {
      "Title": "Confronted over Greenland, Europe is ditching its softly-softly approach to Trump",
      "Link": "https://www.bbc.com/news/articles/c0lx7j1lrwro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T01:04:54+00:00",
      "Source": "BBC News",
      "Summary": "Transatlantic relations aren\u0027t broken, though they are damaged. And if Europeans want to try to cut through with Trump, they\u0027ll have to stick together, writes Europe Editor Katya Adler"
    },
    {
      "Title": "Chris Pratt on new film Mercy: I asked to be locked into an executioner\u0027s chair",
      "Link": "https://www.bbc.com/news/articles/cy05drxx2nwo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:37:41+00:00",
      "Source": "BBC News",
      "Summary": "The Marvel star plays a detective with 90 minutes to prove to an AI judge he did not murder his wife."
    },
    {
      "Title": "Ros Atkins on...President Trump\u0027s year in numbers",
      "Link": "https://www.bbc.com/news/videos/cvgpr95npplo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:08:41+00:00",
      "Source": "BBC News",
      "Summary": "Executive orders, pardons, trips and Truth Social posts - the BBC’s Analysis Editor breaks down Donald Trump’s first year back in office, in numbers."
    },
    {
      "Title": "Greenland \u0027will stay Greenland\u0027, former Trump adviser declares",
      "Link": "https://www.bbc.com/news/articles/c98p6m0r53no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T00:00:23+00:00",
      "Source": "BBC News",
      "Summary": "Donald Trump\u0027s former chief economic adviser said the US president\u0027s actions are a negotiating tactic."
    },
    {
      "Title": "Who has made Troy\u0027s Premier League team of the week?",
      "Link": "https://www.bbc.com/sport/football/articles/c5y34dkjd83o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:37:06+00:00",
      "Source": "BBC News",
      "Summary": "After every round of Premier League matches this season, Troy Deeney gives us his team of the week. Do you agree with his choices?"
    },
    {
      "Title": "In pictures: Valentino\u0027s life and work - and the stars who shared his journey",
      "Link": "https://www.bbc.com/news/articles/c4gwkdm2w33o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:21:36+00:00",
      "Source": "BBC News",
      "Summary": "His creations have featured at countless red carpets and award ceremonies around the world."
    },
    {
      "Title": "Saved by \u0027special talent\u0027 - but did penalty award wrong Brighton?",
      "Link": "https://www.bbc.com/sport/football/articles/ce8egx0gn3lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:15:45+00:00",
      "Source": "BBC News",
      "Summary": "Charalampos Kostoulas earned Brighton a point with a stunning overhead kick but  were the Seagulls right to be angry over an earlier penalty award?"
    },
    {
      "Title": "I don\u0027t want to reconcile with family, says Brooklyn Peltz Beckham",
      "Link": "https://www.bbc.com/news/articles/ce3ekq4z5dyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T23:01:22+00:00",
      "Source": "BBC News",
      "Summary": "Speculation has been circulating in the press for months over a rift in the Beckham family."
    },
    {
      "Title": "Stunning late goal earns Brighton draw against Bournemouth",
      "Link": "https://www.bbc.com/sport/football/videos/c1kl81n2mpdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:46:01+00:00",
      "Source": "BBC News",
      "Summary": "Teenager Charalampos Kostoulas scores a stunning overhead kick to deny Bournemouth a rare away victory in the Premier League."
    },
    {
      "Title": "Water companies to face regular MOT-style checks in industry shake-up",
      "Link": "https://www.bbc.com/news/articles/cwygpg281dno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:30:04+00:00",
      "Source": "BBC News",
      "Summary": "The government says the industry will have \u0022nowhere to hide\u0022, but campaigners say the reforms do not go far enough."
    },
    {
      "Title": "UK to consult on social media ban for under 16s",
      "Link": "https://www.bbc.com/news/articles/cgm4xpyxp7lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T22:30:00+00:00",
      "Source": "BBC News",
      "Summary": "The government said it expected schools to be \u0022phone-free by default\u0022 as a result of the announcement."
    },
    {
      "Title": "Man Utd\u0027s complicated relationship with Class of 92",
      "Link": "https://www.bbc.com/sport/football/articles/cew84renxjgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T21:27:35+00:00",
      "Source": "BBC News",
      "Summary": "Manchester United and the class of 92 have a complicated relationship. But is it a problem?"
    },
    {
      "Title": "OpenAI’s 2026 ‘focus’ is ‘practical adoption’",
      "Link": "https://www.theverge.com/news/864229/openai-focus-practical-adoption-sarah-friar",
      "Published": "2026-01-19T21:05:30+00:00",
      "Source": "The Verge",
      "Summary": "OpenAI plans to focus on \u0022practical adoption\u0022 of AI in 2026, according to a blog post from CFO Sarah Friar. As the company spends a huge amount of money on infrastructure, OpenAI is working on \u0022closing the gap\u0022 on what AI can do and how people actually use it. \u0022The opportunity is large and immediate, [\u0026#8230;]"
    },
    {
      "Title": "Trump: “I No Longer Feel An Obligation To Think Purely Of Peace”",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mvydbn?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T21:01:00+00:00",
      "Source": "BBC News",
      "Summary": "European leaders respond to President Trump’s tariff threat."
    },
    {
      "Title": "How much can a city take?",
      "Link": "https://www.theverge.com/policy/864195/minneapolis-ice-invasion-organizing-immigration",
      "Published": "2026-01-19T21:00:00+00:00",
      "Source": "The Verge",
      "Summary": "I live in Minneapolis. I grew up not far from here, in a suburb of St. Paul; after stints on both coasts, my wife and I settled here to raise our daughters in a freezing state that had always welcomed us warmly. As the ongoing occupation by over 3,000 ICE agents stretches into its third [\u0026#8230;]"
    },
    {
      "Title": "A second US Sphere could come to Maryland",
      "Link": "https://www.theverge.com/tech/864192/sphere-entertainment-mini-venue-maryland-national-harbor",
      "Published": "2026-01-19T19:35:52+00:00",
      "Source": "The Verge",
      "Summary": "Sphere Entertainment, the company behind the eye-catching interactive venue in Las Vegas, has announced its \u0022intent to develop\u0022 another Sphere in Maryland that will be located 15 minutes south of Washington, DC. A timeline and exact location haven\u0027t been finalized, but the Maryland Sphere would be the company\u0027s second venue in the US, following plans [\u0026#8230;]"
    },
    {
      "Title": "Jacob Alon crowned Brits Critics\u0027 Choice winner",
      "Link": "https://www.bbc.com/news/articles/cg5g1gvn335o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T18:51:13+00:00",
      "Source": "BBC News",
      "Summary": "The Scottish folk singer edges out Sienna Spiro and Rose Gray to claim the prestigious prize."
    },
    {
      "Title": "Bungie’s Marathon shooter launches on March 5th",
      "Link": "https://www.theverge.com/news/864146/bungie-marathon-release-date-march-5th-price",
      "Published": "2026-01-19T16:41:50+00:00",
      "Source": "The Verge",
      "Summary": "Bungie is putting an official date on Marathon today, its delayed extraction shooter. The slick-looking shooter from the makers of Halo and Destiny was originally set to release in September, but will now launch on March 5th. Bungie will launch Marathon on Xbox Series S / X, PS5, and PC, priced at $39.99. Bungie initially [\u0026#8230;]"
    },
    {
      "Title": "Steve Rosenberg: Russia gloats over Greenland tensions",
      "Link": "https://www.bbc.com/news/articles/c17zpvkddpzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T16:26:34+00:00",
      "Source": "BBC News",
      "Summary": "The BBC\u0027s Russia editor Steve Rosenberg analyses why pro-Russian government papers are full of praise for Donald Trump\u0027s desire to buy Greenland."
    },
    {
      "Title": "Chris Mason: Starmer sticks to his strategy and picks his words carefully",
      "Link": "https://www.bbc.com/news/articles/ckgykp22yk7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T16:07:12+00:00",
      "Source": "BBC News",
      "Summary": "The prime minister is seeking to downplay how he intends to react to Trump\u0027s threat of tariffs."
    },
    {
      "Title": "Gamers love AI in game dev — they just don\u0026#8217;t know it yet, says Razer\u0026#8217;s CEO",
      "Link": "https://www.theverge.com/podcast/863361/razer-ceo-min-liang-tan-ces-2026-ai-gaming-project-ava-interview",
      "Published": "2026-01-19T15:00:00+00:00",
      "Source": "The Verge",
      "Summary": "We’re back to start the year off with a very special live interview with Razer CEO Min-Liang Tan, which we taped in front of a terrific audience at Brooklyn Bowl in Las Vegas during CES.\u0026#160; Razer is obviously best known for making mice, keyboards, and gaming PCs in its signature black and bright green, with [\u0026#8230;]"
    },
    {
      "Title": "This 5-foot lamp is a supersized tribute to the world’s most iconic pen",
      "Link": "https://www.theverge.com/tech/864127/seletti-bic-ballpoint-pen-pendant-lamp-maison-objet",
      "Published": "2026-01-19T14:47:48+00:00",
      "Source": "The Verge",
      "Summary": "Seletti, an Italian design brand known for everything from furniture to tableware, has debuted an unusual tribute to an icon of design: the Bic Cristal pen. To celebrate its 75th anniversary, Seletti has supersized the pen and replaced its ink cartridge with a long LED-filled tube to illuminate your living room, office, or that closet [\u0026#8230;]"
    },
    {
      "Title": "How could Europe respond to tariffs threat?",
      "Link": "https://www.bbc.com/news/articles/cgk8z8xxpgmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T14:13:10+00:00",
      "Source": "BBC News",
      "Summary": "Europe is weighing up how to counter the US president\u0027s move against some of America\u0027s closest allies."
    },
    {
      "Title": "Asus may have made its last phone",
      "Link": "https://www.theverge.com/news/864116/asus-may-have-made-its-last-phone",
      "Published": "2026-01-19T14:10:38+00:00",
      "Source": "The Verge",
      "Summary": "Asus chairman Jonney Shih told Taiwan\u0027s Inside that the company is done making phones for now, marking the end of its Zenfone and ROG Phone lines. \u0022Asus will no longer add new mobile phone models in the future,\u0022 Shih reportedly said (translated with Google Translate). He didn\u0027t entirely rule out a return though, instead saying [\u0026#8230;]"
    },
    {
      "Title": "Animal Crossing: New Horizons added just enough to suck me back in",
      "Link": "https://www.theverge.com/games/863747/animal-crossing-new-horizons-update-3-0-switch-2-quality-of-life",
      "Published": "2026-01-19T14:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Animal Crossing has always been anti-instant gratification. By design, you have to take your time, wait for days to pass in real time, and complete a seemingly endless list of chores to build a meaningful life with your animal friends. The slowness is part of its appeal. But with New Horizons, some of that slowness [\u0026#8230;]"
    },
    {
      "Title": "Threads overtakes X on mobile, but still lags far behind",
      "Link": "https://www.theverge.com/news/864099/threads-overtakes-x-daily-mobile-ios-android-users",
      "Published": "2026-01-19T11:53:33+00:00",
      "Source": "The Verge",
      "Summary": "After launching almost three years ago, Meta\u0027s Threads is now reportedly attracting more daily mobile users than rival platform X. According to Similarweb data shared by TechCrunch, Threads has 141.5 million daily active iOS and Android global app users as of January 7th, compared to 125 million users for Elon Musk\u0027s mobile platform. Similarweb reports [\u0026#8230;]"
    },
    {
      "Title": "England fans have \u0027every right to be annoyed, I made terrible mistake\u0027 - Brook",
      "Link": "https://www.bbc.com/sport/cricket/articles/c8rm34kxzxmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T08:08:00+00:00",
      "Source": "BBC News",
      "Summary": "Harry Brook says supporters have “every right to be annoyed” by his behaviour after he was punched by a nightclub bouncer on England’s tour of New Zealand that preceded the Ashes."
    },
    {
      "Title": "Out-of-sorts Raducanu beaten at Australian Open",
      "Link": "https://www.bbc.com/sport/tennis/articles/c620l640jz2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T07:47:21+00:00",
      "Source": "BBC News",
      "Summary": "Britain\u0027s Emma Raducanu is below-par in an Australian Open second-round defeat by Austria\u0027s Anastasia Potapova."
    },
    {
      "Title": "\u0027Really scary\u0027: Sydney residents react to shark attacks",
      "Link": "https://www.bbc.com/news/videos/cpwnk040qd1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:39:33+00:00",
      "Source": "BBC News",
      "Summary": "The BBC spoke to people in Sydney about the four shark attacks in 48 hours along Australia\u0027s New South Wales coast."
    },
    {
      "Title": "Mum demands answers over son found dead with stab wounds in a Home Office flat",
      "Link": "https://www.bbc.com/news/articles/cp9j0p1v247o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:19:16+00:00",
      "Source": "BBC News",
      "Summary": "Sheena Millar says she is still seeking answers despite a year-long investigation into the death of her son Mikhail."
    },
    {
      "Title": "Global markets on alert as Europe to suspend approval of US trade deal",
      "Link": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T06:10:20+00:00",
      "Source": "BBC News",
      "Summary": "The move follows renewed tensions between the US and EU, as Donald Trump pushes to acquire Greenland. "
    },
    {
      "Title": "Photos leaked to BBC show faces of hundreds killed in Iran\u0027s brutal protest crackdown",
      "Link": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T05:56:20+00:00",
      "Source": "BBC News",
      "Summary": "The images from one mortuary in Tehran were shown to families who went to identify their loved ones."
    },
    {
      "Title": "The Papers: Europe condemns Trump \u0027new colonialism\u0027 and \u0027Becks bites back\u0027",
      "Link": "https://www.bbc.com/news/articles/cnvg2r32rnno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T05:23:23+00:00",
      "Source": "BBC News",
      "Summary": "European leaders hitting back at Donald Trump\u0027s Greenland threat at the World Economic Forum in Davos dominates Wednesday\u0027s front pages."
    },
    {
      "Title": "Life sentence for man who killed Japan\u0027s ex-PM Shinzo Abe",
      "Link": "https://www.bbc.com/news/articles/c86v5lj39zpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T04:48:18+00:00",
      "Source": "BBC News",
      "Summary": "Abe\u0027s assassination stunned the country where there is virtually no gun crime."
    },
    {
      "Title": "Why is Emmanuel Macron wearing sunglasses indoors at Davos?",
      "Link": "https://www.bbc.com/news/articles/c4g050pdld3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T04:14:41+00:00",
      "Source": "BBC News",
      "Summary": "The French leader drew attention for his rebuke of Trump\u0027s tariff threat - and also his choice of eyewear."
    },
    {
      "Title": "One year in, Big Tech has out-maneuvered MAGA populists",
      "Link": "https://www.theverge.com/column/864759/big-tech-trump-one-year-in",
      "Published": "2026-01-21T03:33:00+00:00",
      "Source": "The Verge",
      "Summary": "Welcome to Regulator, a newsletter for Verge subscribers about the technology and the tech bros upending American politics and the Trump administration. If you\u0027re not a subscriber yet, and you\u0027re interested in Silicon Valley\u0027s adventures in sausage-making, you should do so here! It\u0027s Q1! Surely the corporate budget will allow for it. Precisely one year [\u0026#8230;]"
    },
    {
      "Title": "Will Trump get friendly welcome as world leaders meet in Davos?",
      "Link": "https://www.bbc.com/news/videos/c5y2qv39r3qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T03:23:22+00:00",
      "Source": "BBC News",
      "Summary": "As Trump pushes for Greenland, Davos may not provide the friendly stage he\u0027s accustomed to."
    },
    {
      "Title": "Driver killed in second deadly Spain train crash in days",
      "Link": "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T03:00:55+00:00",
      "Source": "BBC News",
      "Summary": "At least 37 people have been injured, five seriously, in a second crash, after Sunday\u0027s two-train collision in Andalusia. "
    },
    {
      "Title": "Woman who was groomed as teen \u0027insulted\u0027 after compensation claims denied",
      "Link": "https://www.bbc.com/news/articles/c4g0ed1v82ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:27:22+00:00",
      "Source": "BBC News",
      "Summary": "Fiona Goddard from Bradford says she feels \u0022gaslit\u0022 as she sought compensation for abuse."
    },
    {
      "Title": "Finger-prick blood test could be early warning for children with type 1 diabetes",
      "Link": "https://www.bbc.com/news/articles/c3684zddgl0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:19:40+00:00",
      "Source": "BBC News",
      "Summary": "A simple finger-prick blood test can find those at risk so they can get the right treatment."
    },
    {
      "Title": "Why doing a mix of exercise could be the key to longer life",
      "Link": "https://www.bbc.com/news/articles/cn0y9pqe2zro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:17:52+00:00",
      "Source": "BBC News",
      "Summary": "Don\u0027t just focus on one activity - doing a variety every week gives you more health benefits, a study suggests."
    },
    {
      "Title": "\u0027It\u0027s harder to sell tickets\u0027: Grassroots music venues struggle to make profit",
      "Link": "https://www.bbc.com/news/articles/c20d1lxlx3go?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T01:04:36+00:00",
      "Source": "BBC News",
      "Summary": "Thirty venues closed last year, and 6,000 staff were laid off as small venues saw their costs soar."
    },
    {
      "Title": "\u0027Good signs\u0027 or just buying time? Spurs remain divided on Frank future",
      "Link": "https://www.bbc.com/sport/football/articles/cj4lqy2np2zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:24:25+00:00",
      "Source": "BBC News",
      "Summary": "Many Tottenham fans have already lost faith in Thomas Frank - but did Tuesday\u0027s 2-0 win over Borussia Dortmund give cause for optimism?"
    },
    {
      "Title": "Sophie Turner on why being at your lowest is liberating",
      "Link": "https://www.bbc.com/news/articles/c2d743r9w7lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:20:01+00:00",
      "Source": "BBC News",
      "Summary": "The Game of Thrones star is leaning into the role of a disgruntled office worker in new drama Steal."
    },
    {
      "Title": "Snap settles social media addiction lawsuit ahead of trial",
      "Link": "https://www.bbc.com/news/articles/c62ndl2ydzxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:17:01+00:00",
      "Source": "BBC News",
      "Summary": "TikTok, YouTube and Meta remain defendants in the case, which is due to kick off next week."
    },
    {
      "Title": "Bellingham responds to partying claims with \u0027joke\u0027 drinking celebration",
      "Link": "https://www.bbc.com/sport/articles/c24g6r250veo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:05:40+00:00",
      "Source": "BBC News",
      "Summary": "Jude Bellingham responds to partying claims with a goal celebration in the Champions League win over Monaco."
    },
    {
      "Title": "Locked exits, panic and desperate calls for help: Survivors tell of mall fire horror",
      "Link": "https://www.bbc.com/news/articles/c1ev4z4n5dzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:03:08+00:00",
      "Source": "BBC News",
      "Summary": "The BBC speaks to eyewitnesses and survivors of the fire that ripped through a busy Pakistan shopping centre. "
    },
    {
      "Title": "Film about Palestinian girl\u0027s desperate plea was a \u0027way to not feel helpless\u0027, says director",
      "Link": "https://www.bbc.com/news/articles/clygr0ym00po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:01:05+00:00",
      "Source": "BBC News",
      "Summary": "Kaouther Ben Hani\u0027s Oscar hopeful, The Voice of Hind Rajab, tells the tale of a girl killed in Gaza."
    },
    {
      "Title": "Trump greenlit tiny Kei cars but will Americans actually buy them?",
      "Link": "https://www.bbc.com/news/articles/c17xvqlx8r8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:42+00:00",
      "Source": "BBC News",
      "Summary": "The president wants to bring to the US tiny vehicles, like those commonly seen on the streets of Japan."
    },
    {
      "Title": "Air India crash plane had record of safety defects, campaigners claim",
      "Link": "https://www.bbc.com/news/articles/czx1p47x589o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:38+00:00",
      "Source": "BBC News",
      "Summary": "Campaigners say they have evidence the plane had previously suffered a series of technical failures, including a fire."
    },
    {
      "Title": "Driving test cheating soars as candidates turn to Bluetooth headsets and impersonators",
      "Link": "https://www.bbc.com/news/articles/cx2g30wwmnno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T00:00:33+00:00",
      "Source": "BBC News",
      "Summary": "Experts blamed persistently long waits for practical tests while the DVSA blamed better detection."
    },
    {
      "Title": "The best AirPods to buy",
      "Link": "https://www.theverge.com/tech/645217/best-apple-airpods-pro",
      "Published": "2026-01-21T00:00:00+00:00",
      "Source": "The Verge",
      "Summary": "Whether you’re buying your first pair of AirPods or replacing a well-used older pair, it’s easy to understand why so many iPhone owners prefer Apple’s earbuds and headphones over other options. Apple has spent years gradually adding new features that work best — and sometimes only work at all — with the company’s own devices. [\u0026#8230;]"
    },
    {
      "Title": "\u0027Tears in my eyes\u0027 - Jesus enjoys \u0027dream night\u0027 in San Siro",
      "Link": "https://www.bbc.com/sport/football/articles/cwy1wr2xryxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T23:57:02+00:00",
      "Source": "BBC News",
      "Summary": "Gabriel Jesus says he had \u0022tears in my eyes\u0022 after scoring twice to help Arsenal win 3-1 at Inter Milan for a seventh successive win in the Champions League."
    },
    {
      "Title": "Alleged scam mastermind arrested after being exposed by BBC",
      "Link": "https://www.bbc.com/news/articles/cwy8v31kkv1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T23:43:38+00:00",
      "Source": "BBC News",
      "Summary": "Kuong Li featured in a 2023 BBC Eye investigation into alleged scam compounds in South East Asia."
    },
    {
      "Title": "Netflix earned $1.5 billion from ads in 2025",
      "Link": "https://www.theverge.com/news/864451/netflix-advertising-revenue-doubled-q4-2025-earnings",
      "Published": "2026-01-20T23:06:25+00:00",
      "Source": "The Verge",
      "Summary": "Netflix\u0027s advertising business more than doubled its advertising revenue to $1.5 billion from 2024 to 2025 - and it\u0027s on track to keep growing. \u0022We expect that [advertising] business to roughly double again in \u002726 to about $3 billion,\u0022 Netflix co-CEO Greg Peters said during an earnings call on Tuesday, hours ahead of its live [\u0026#8230;]"
    },
    {
      "Title": "Trump admin admits DOGE employees had access to off-limits Social Security data",
      "Link": "https://www.theverge.com/news/864643/doge-social-security-data-misuse",
      "Published": "2026-01-20T22:52:59+00:00",
      "Source": "The Verge",
      "Summary": "Department of Government Efficiency (DOGE) staffers working at the Social Security Administration (SSA) broke protocols, had more access to sensitive data on Americans than previously disclosed, and were in touch with a political advocacy group hunting for election fraud, the Trump administration admitted in a recent court filing. Justice Department officials told a federal court [\u0026#8230;]"
    },
    {
      "Title": "Netflix will revamp its mobile UI this year",
      "Link": "https://www.theverge.com/news/864646/netflix-mobile-ui-revamp-design-vertical-video",
      "Published": "2026-01-20T22:46:59+00:00",
      "Source": "The Verge",
      "Summary": "Netflix is working on a new mobile UI set to roll out later this year that will \u0022better serve the expansion of our business over the decade to come,\u0022 co-CEO Greg Peters said in an earnings call on Tuesday. The new mobile UI follows last year\u0027s big TV revamp that put a new banner front [\u0026#8230;]"
    },
    {
      "Title": "UK homes to get £15bn for solar and green tech to cut energy bills",
      "Link": "https://www.bbc.com/news/articles/ckgj7me00p0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:32:47+00:00",
      "Source": "BBC News",
      "Summary": "The government has announced the details of its long-awaited Warm Homes Plan which promises to cut energy bills."
    },
    {
      "Title": "FTC says it will appeal Meta antitrust loss",
      "Link": "https://www.theverge.com/news/864622/ftc-meta-antitrust-ruling-appeal",
      "Published": "2026-01-20T22:21:31+00:00",
      "Source": "The Verge",
      "Summary": "The Federal Trade Commission will appeal its loss in a landmark antitrust case against Meta, the agency announced Tuesday. US District Court Judge James Boasberg ruled in November that the government failed to prove that Meta had an illegal monopoly over a subset of social networking services meant for connecting with friends and family online. [\u0026#8230;]"
    },
    {
      "Title": "Spat deepens between Elon Musk and Ryanair\u0027s O\u0027Leary",
      "Link": "https://www.bbc.com/news/articles/ckgyzl4gd1do?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:08:15+00:00",
      "Source": "BBC News",
      "Summary": "Musk and Ryanair boss Michael O\u0027Leary have called each other \u0022idiots\u0022 in recent days"
    },
    {
      "Title": "Beckham vs Peltz Beckham: Could Brooklyn torpedo the family brand?",
      "Link": "https://www.bbc.com/news/articles/c3ve1r2674zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T22:05:28+00:00",
      "Source": "BBC News",
      "Summary": "Brooklyn\u0027s explosive post about Brand Beckham \u0022has ruptured it from within\u0022, one commentator says."
    },
    {
      "Title": "\u0027Battered in Bodo\u0027 - is this more than just a blip for Man City?",
      "Link": "https://www.bbc.com/sport/articles/crkr76gkxr7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T21:59:32+00:00",
      "Source": "BBC News",
      "Summary": "Manchester City suffered their very own \u0022hell of a beating\u0022 moment in Norway on Tuesday - now Pep Guardiola and his players must turn around their fortunes in an increasingly trying January."
    },
    {
      "Title": "Nova Launcher’s new owner might offer a version with ads",
      "Link": "https://www.theverge.com/news/864585/nova-launcher-instabridge-acquisition-owner-ads",
      "Published": "2026-01-20T20:55:04+00:00",
      "Source": "The Verge",
      "Summary": "Last year, Nova Launcher founder and sole developer Kevin Barry announced he had left Branch Metrics, Nova\u0027s parent company at the time - which followed an announcement from 2024 that nearly everyone working on the project had been laid off. But the launcher is getting new life: in a blog post on Tuesday, the Swedish [\u0026#8230;]"
    },
    {
      "Title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
      "Link": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T20:18:43+00:00",
      "Source": "BBC News",
      "Summary": "Trump\u0027s demands over Greenland are a rude awakening in a moment fraught with risk."
    },
    {
      "Title": "Google has finally killed the Stadia Bluetooth tool — but this person rescued it",
      "Link": "https://www.theverge.com/tech/864543/google-has-finally-killed-the-stadia-bluetooth-tool-but-this-person-rescued-it",
      "Published": "2026-01-20T19:50:46+00:00",
      "Source": "The Verge",
      "Summary": "Did you save your Google Stadia controller like I told you last month? It\u0027s still not too late. This week, Google has finally removed the tool that converts the now-useless controller into a decent Bluetooth gamepad. But there\u0027s another way. Christopher Klay, who previously developed the Stadia Enhanced browser extension, is one of many who [\u0026#8230;]"
    },
    {
      "Title": "Carney says old world order \u0027is not coming back\u0027",
      "Link": "https://www.bbc.com/news/articles/cly3d28p4p8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T18:49:50+00:00",
      "Source": "BBC News",
      "Summary": "Canada\u0027s prime minister said powerful countries are using economic weapons to pursue their interests, while affirming support for Greenland and Nato."
    },
    {
      "Title": "Samsung’s discounted microSD Express card more than doubles your Switch 2 storage",
      "Link": "https://www.theverge.com/gadgets/864404/samsung-p9-microsd-express-card-deal-sale",
      "Published": "2026-01-20T18:36:47+00:00",
      "Source": "The Verge",
      "Summary": "If you buy digital games for the Nintendo Switch 2, Samsung’s P9 microSD Express card offers an easier way to expand your storage without constantly deleting games to make room. It’s cheaper than other microSD cards, and it’s an even better value right now, with the 512GB version priced at $79.99 ($40 off) — just [\u0026#8230;]"
    },
    {
      "Title": "Life is Strange will bring the Max and Chloe story to an end in new game",
      "Link": "https://www.theverge.com/games/864438/life-is-strange-reunion-release-date-max-chloe",
      "Published": "2026-01-20T18:30:00+00:00",
      "Source": "The Verge",
      "Summary": "A little over a decade ago, Life is Strange burst onto the scene with a unique blend of teen drama and interactive storytelling. That first game told the story of Max Caulfield, who had the supernatural ability to reverse time, and her best friend Chloe Price. Now developer Deck Nine Games is finally bringing their [\u0026#8230;]"
    },
    {
      "Title": "Trump accuses UK of \u0022an act of GREAT STUPIDITY!\u0022",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mw2lg4?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T16:17:00+00:00",
      "Source": "BBC News",
      "Summary": "Chief Secretary to the Prime Minister Darren Jones responds to Trump’s Truth Social rant."
    },
    {
      "Title": "Greenland: Could the US regret alienating its Nato allies?",
      "Link": "https://www.bbc.co.uk/sounds/play/w3ct71d5?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump responded, “no comment” when asked if he\u0027d use force to seize Greenland."
    },
    {
      "Title": "Government borrowing falls by more than a third in December, figures show",
      "Link": "https://www.bbc.com/news/articles/clymd1pj887o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:51:46+00:00",
      "Source": "BBC News",
      "Summary": "More money than expected was collected through tax and higher National Insurance Contributions, although public sector spending also increased"
    },
    {
      "Title": "\u0027Ridiculous amount of games\u0027 - has Haaland played too much football?",
      "Link": "https://www.bbc.com/sport/football/articles/cy7mv3eg5nlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:50:56+00:00",
      "Source": "BBC News",
      "Summary": "Erling Haaland made a blistering start to the season but that prolific run of form has ground to a halt with only one goal in his past eight games."
    },
    {
      "Title": "Work for 2026 season \u0027unprecedented\u0027 for McLaren",
      "Link": "https://www.bbc.com/sport/formula1/articles/c3r1755jjx9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T07:01:32+00:00",
      "Source": "BBC News",
      "Summary": "McLaren team principal Andrea Stella says the world champions have faced an \u0022unprecedented\u0022 amount of work as he looks ahead to the new season."
    },
    {
      "Title": "We were lied to, demeaned and smeared, say hospital inquiry families",
      "Link": "https://www.bbc.com/news/articles/c4g4e17g7yyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:52:39+00:00",
      "Source": "BBC News",
      "Summary": "The families call for those responsible for the issues at the Queen Elizabeth University Hospital in Glasgow to be held to account."
    },
    {
      "Title": "Gymnast Alice Kinsella prepares for rare return to elite competition after baby",
      "Link": "https://www.bbc.com/sport/gymnastics/articles/ckgzjyj4jkqo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:26:28+00:00",
      "Source": "BBC News",
      "Summary": "Olympic bronze medalist Alice Kinsella on her hopes of being the first British artistic gymnast to return to elite competition after childbirth."
    },
    {
      "Title": "Djokovic cruises into Australian Open third round",
      "Link": "https://www.bbc.com/sport/tennis/articles/c5y22d8ng29o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T06:23:06+00:00",
      "Source": "BBC News",
      "Summary": "Novak Djokovic will need to conserve energy if he is to make history at the Australian Open - and he has not dropped a set in the first two rounds."
    },
    {
      "Title": "The Papers: \u0027Trump hails Greenland deal\u0027 and \u0027All I want is a piece of ice\u0027",
      "Link": "https://www.bbc.com/news/articles/cly99w1zx4lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T05:33:23+00:00",
      "Source": "BBC News",
      "Summary": "Donald Trump\u0027s announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday\u0027s front pages."
    },
    {
      "Title": "Ghislaine Maxwell to testify before US Congress in Epstein probe",
      "Link": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T05:14:56+00:00",
      "Source": "BBC News",
      "Summary": "The convicted sex trafficker has previously said she would decline to answer questions unless she is granted immunity."
    },
    {
      "Title": "Hundreds of creatives warn against an AI slop future",
      "Link": "https://www.theverge.com/ai-artificial-intelligence/864951/human-artistry-campaign-ai-licensing-artists",
      "Published": "2026-01-22T05:01:00+00:00",
      "Source": "The Verge",
      "Summary": "Around 800 artists, writers, actors, and musicians signed on to a new campaign against what they call \u0022theft at a grand scale\u0022 by AI companies. The signatories of the campaign - called \u0022Stealing Isn\u0027t Innovation\u0022 - include authors George Saunders and Jodi Picoult, actors Cate Blanchett and Scarlett Johansson, and musicians like the band R.E.M., [\u0026#8230;]"
    },
    {
      "Title": "Bezos\u0027 Blue Origin announces satellite rival to Musk\u0027s Starlink",
      "Link": "https://www.bbc.com/news/articles/cn0yydwe89jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T03:15:27+00:00",
      "Source": "BBC News",
      "Summary": "Blue Origin will be focused on businesses and governments, while Starlink also offers services to individual customers."
    },
    {
      "Title": "US allies won\u0027t forget Trump Greenland crisis",
      "Link": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:52:28+00:00",
      "Source": "BBC News",
      "Summary": "Despite talk of a deal over Greenland, it will be hard for US allies to return to business as usual, writes the BBC’s diplomatic correspondent. "
    },
    {
      "Title": "Massive winter storm expected to bury much of US in snow and ice ",
      "Link": "https://www.bbc.com/news/articles/cg7yy9xm1v1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:26:01+00:00",
      "Source": "BBC News",
      "Summary": "Officials, including airport authorities in several major cities, are warning travellers to brace for significant delays amid the severe winter weather."
    },
    {
      "Title": "Ex-intelligence officer in Austria\u0027s biggest spy trial for years",
      "Link": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T01:00:06+00:00",
      "Source": "BBC News",
      "Summary": "Egisto Ott, 63, denies charges of handing over information to Russian agents."
    },
    {
      "Title": "Starmer warned of Labour rebellion if leasehold reforms watered down",
      "Link": "https://www.bbc.com/news/articles/czx3gz6pq90o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:57:24+00:00",
      "Source": "BBC News",
      "Summary": "Former minister Justin Madders tells the BBC Labour must stick to its pledge to cap ground rents."
    },
    {
      "Title": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
      "Link": "https://www.bbc.com/news/articles/cx2yd455rd0o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:43:18+00:00",
      "Source": "BBC News",
      "Summary": "Nicky Perfect shares three practical tricks she learnt which will help you handle daily parenting battles."
    },
    {
      "Title": "Ashton Kutcher: Hollywood isn\u0027t to blame for pushing unrealistic beauty standards",
      "Link": "https://www.bbc.com/news/articles/cddgrp0yvg1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:40:20+00:00",
      "Source": "BBC News",
      "Summary": "The actor stars in The Beauty,  which explores the negative impact of a world full of beautiful people."
    },
    {
      "Title": "Blockbusters, battles and Brits: Hollywood gears up for Oscar nominations",
      "Link": "https://www.bbc.com/news/articles/ce9yx4d3kjzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:24:18+00:00",
      "Source": "BBC News",
      "Summary": "Sinners, Marty Supreme, Hamnet and One Battle After Another are all in contention this year."
    },
    {
      "Title": "\u0027He came here for these nights\u0027 - Wissa inspires Newcastle",
      "Link": "https://www.bbc.com/sport/football/articles/cy599yy9reyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:24:16+00:00",
      "Source": "BBC News",
      "Summary": "Eddie Howe says Yoane Wissa came to Newcastle \u0022for these nights\u0022 after his first Champions League goal at St James\u0027 Park."
    },
    {
      "Title": "Slot praises Salah return on important night for both",
      "Link": "https://www.bbc.com/sport/football/articles/cn0yyexlvrgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:03:51+00:00",
      "Source": "BBC News",
      "Summary": "Arne Slot praises the return of Mohamed Salah, with Liverpool\u0027s Champions League win in Marseille proving important for both."
    },
    {
      "Title": "Liverpool top English club in Deloitte Football Money League",
      "Link": "https://www.bbc.com/sport/football/articles/cx2kd52yxpdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T00:01:17+00:00",
      "Source": "BBC News",
      "Summary": "Liverpool become the top-earning Premier League club for the first time, according to analysis from financial firm Deloitte."
    },
    {
      "Title": "Why does Trump want Greenland and what could it mean for Nato and the EU?",
      "Link": "https://www.bbc.com/news/articles/c74x4m71pmjo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T23:25:51+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s repeated demands to control Greenland could threaten the Nato military alliance."
    },
    {
      "Title": "Blue Origin’s Starlink rival TeraWave promises 6-terabit satellite internet",
      "Link": "https://www.theverge.com/news/865282/blue-origin-terawave-satellite-6tb",
      "Published": "2026-01-21T23:22:57+00:00",
      "Source": "The Verge",
      "Summary": "SpaceX has the most internet-beaming satellites in its constellation, but the competition is coming, and now Jeff Bezos\u0027 space company, Blue Origin, has announced the TeraWave network. It says TeraWave will offer bandwidth of up to 6Tb available anywhere on Earth, for both upload and download. The only wrinkle? Even after satellite deployments are scheduled [\u0026#8230;]"
    },
    {
      "Title": "Chris Mason: Latest twist in Trump diplomacy brings relief for Starmer",
      "Link": "https://www.bbc.com/news/articles/c62wwre0jrro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T23:01:41+00:00",
      "Source": "BBC News",
      "Summary": "The row over Greenland risked uprooting the PM\u0027s carefully cultivated relationship with the US president."
    },
    {
      "Title": "Everyone can hear your TV in their headphones using this transmitter",
      "Link": "https://www.theverge.com/tech/864569/sennheiser-bluetooth-auracast-bta1-transmitter-hdr-275-wireless-headphones",
      "Published": "2026-01-21T23:00:00+00:00",
      "Source": "The Verge",
      "Summary": "As we\u0027ve previously lamented, one of Bluetooth\u0027s best modern features isn\u0027t being embraced by the tech world, but that\u0027s changing. Sennheiser has announced a new pair of wireless headphones and a transmitter designed for private TV watching that both use a Bluetooth feature called Auracast. Like tuning into a radio station broadcast from a tower, [\u0026#8230;]"
    },
    {
      "Title": "Here are the best Kindle deals right now",
      "Link": "https://www.theverge.com/21539047/best-amazon-kindle-deals",
      "Published": "2026-01-21T23:00:00+00:00",
      "Source": "The Verge",
      "Summary": "When it comes to finding a device to read ebooks, you have a few options to choose from. You can always buy a tablet or use your phone, but those devices are multipurpose and can be used for a ton of things, like surfing the web or doomscrolling on X or Bluesky. If you are [\u0026#8230;]"
    },
    {
      "Title": "Salah returns as Liverpool score three to beat Marseille",
      "Link": "https://www.bbc.com/sport/football/videos/cvg5w77wyxyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T22:26:57+00:00",
      "Source": "BBC News",
      "Summary": "Mohammad Salah returns to the Liverpool starting XI as Liverpool score three goals, including an intelligent Dominik Szoboszlai free kick, to beat Olympique Marseille."
    },
    {
      "Title": "Apple is reportedly working on an AirTag-sized AI wearable",
      "Link": "https://www.theverge.com/news/865212/apple-ai-pin-wearable-airtag-rumor",
      "Published": "2026-01-21T21:43:27+00:00",
      "Source": "The Verge",
      "Summary": "Apple is working on an AI-powered wearable pin with cameras and microphones designed to pick up a user\u0027s surroundings, according to a report from The Information. The rumored device is reportedly the size of an AirTag, with \u0022thin, flat, circular\u0022 housing made from aluminium and glass. The Information reports that Apple\u0027s rumored AI pin will [\u0026#8230;]"
    },
    {
      "Title": "Seven more countries agree to join Trump\u0027s Board of Peace",
      "Link": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T20:55:33+00:00",
      "Source": "BBC News",
      "Summary": "Seven Muslim-majority countries accept an invitation to Trump\u0027s new organisation, while Russia\u0027s Putin says he\u0027s considering joining."
    },
    {
      "Title": "Anthropic’s new Claude ‘constitution’: be helpful and honest, and don’t destroy humanity",
      "Link": "https://www.theverge.com/ai-artificial-intelligence/865185/anthropic-claude-constitution-soul-doc",
      "Published": "2026-01-21T20:36:18+00:00",
      "Source": "The Verge",
      "Summary": "Anthropic is overhauling Claude\u0027s so-called \u0022soul doc.\u0022 The new missive is a 57-page document titled \u0022Claude\u0027s Constitution,\u0022 which details \u0022Anthropic\u0027s intentions for the model\u0027s values and behavior,\u0022 aimed not at outside readers but the model itself. The document is designed to spell out Claude\u0027s \u0022ethical character\u0022 and \u0022core identity,\u0022 including how it should balance conflicting [\u0026#8230;]"
    },
    {
      "Title": "Apple is turning Siri into an AI bot that\u0026#8217;s more like ChatGPT",
      "Link": "https://www.theverge.com/news/865172/apple-siri-ai-chatbot-chatgpt",
      "Published": "2026-01-21T20:26:47+00:00",
      "Source": "The Verge",
      "Summary": "Apple is planning a big Siri overhaul that will transform the voice assistant into an AI chatbot built directly into its iPhone and Mac, according to Bloomberg reporter Mark Gurman. The update is reportedly coming later this year and will replace the existing Siri interface, allowing users to interact with the assistant by both typing [\u0026#8230;]"
    },
    {
      "Title": "Jibes are wearing thin for many of Europe\u0027s leaders",
      "Link": "https://www.bbc.com/news/articles/cd9ez1nj3n3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T20:03:49+00:00",
      "Source": "BBC News",
      "Summary": "The ball is in the court of European leaders ahead of Thursday\u0027s emergency EU meeting in Brussels, writes Nick Beake."
    },
    {
      "Title": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
      "Link": "https://www.bbc.com/news/articles/c70l9531pd1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T19:54:14+00:00",
      "Source": "BBC News",
      "Summary": "As Australia mourns the Bondi shooting victims, volunteers have been preserving tributes left in their honour."
    },
    {
      "Title": "Faisal Islam: What it was like inside the room for speech",
      "Link": "https://www.bbc.com/news/articles/cm24vjvy3n1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T19:22:59+00:00",
      "Source": "BBC News",
      "Summary": "Our economics editor says there was mixed reaction in the room during Trump\u0027s Davos speech."
    },
    {
      "Title": "Samsung Galaxy S26 battery pack leak points to Qi2 charging support",
      "Link": "https://www.theverge.com/news/865083/samsung-galaxy-s26-battery-pack-qi2-support",
      "Published": "2026-01-21T18:11:41+00:00",
      "Source": "The Verge",
      "Summary": "It looks like Samsung is preparing to launch a new Qi2 battery pack for the upcoming Galaxy S26, which is rumored to support the upgraded charging standard. A report from Winfuture shows off leaked images of what appears to be the new accessory, outfitted with a magnetic Qi2 charging ring that delivers up to 15W [\u0026#8230;]"
    },
    {
      "Title": "Tetchy and emotional exchanges as Harry in court for what could be last time",
      "Link": "https://www.bbc.com/news/articles/c07x53vjegvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T17:59:51+00:00",
      "Source": "BBC News",
      "Summary": "The Duke of Sussex\u0027s manner showed how personal this was to him, delivering terse and sometimes tense answers."
    },
    {
      "Title": "Olivia Dean and Lola Young dominate Brit Award nominations",
      "Link": "https://www.bbc.com/news/articles/cx2yd148wj8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T17:45:05+00:00",
      "Source": "BBC News",
      "Summary": "A new wave of pop stars lead the shortlist, while Pulp pick up their first nomination in 30 years."
    },
    {
      "Title": "Volvo aims for an EV reset with the new EX60 crossover",
      "Link": "https://www.theverge.com/news/864561/volvo-ex60-range-price-specs",
      "Published": "2026-01-21T17:30:00+00:00",
      "Source": "The Verge",
      "Summary": "Volvo\u0027s EX60, with fast-charging capabilities and a brand-new electric architecture, made its official debut today, with the Swedish automaker positioning the crossover EV as a new direction for its battery-powered lineup. With up to 400 miles of estimated range and an 800-volt architecture for ultra-fast charging, the EX60 feels like a concerted effort by Volvo [\u0026#8230;]"
    },
    {
      "Title": "Ubisoft cancels Prince of Persia remake as part of major reorganization",
      "Link": "https://www.theverge.com/news/865060/ubisoft-prince-of-persia-sands-of-time-remake-canceled-reorganization",
      "Published": "2026-01-21T17:23:29+00:00",
      "Source": "The Verge",
      "Summary": "Ubisoft is announcing a major reorganization, and with the changes, it\u0027s refocusing its portfolio and canceling some games, including the beleaguered remake of Prince of Persia: The Sands of Time. With the reorganization, Ubisoft will focus its efforts on big open worlds and live service games and is making \u0022accelerated investments\u0022 in \u0022player-facing Generative AI.\u0022 [\u0026#8230;]"
    },
    {
      "Title": "Oldest cave painting of red claw hand could rewrite human creativity timeline",
      "Link": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-21T16:00:07+00:00",
      "Source": "BBC News",
      "Summary": "A stencilled outline of a hand found on the Indonesian island of Sulawesi is the world\u0027s oldest known cave painting, researchers say."
    },
    {
      "Title": "US officially leaves World Health Organization",
      "Link": "https://www.bbc.com/news/articles/cn9zznx8qdno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:42:44+00:00",
      "Source": "BBC News",
      "Summary": "Trump ordered the withdrawal a year ago, accusing the UN agency of failing to adopt reforms and mishandling the pandemic."
    },
    {
      "Title": "Social media firms have come to ban \u0027kicking and screaming\u0027, says Australia eSafety boss",
      "Link": "https://www.bbc.com/news/articles/c5y33xjmm3mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:01:41+00:00",
      "Source": "BBC News",
      "Summary": "As other nations consider similar laws, Julie Inman Grant told the BBC the ban is already exceeding expectations."
    },
    {
      "Title": "Botched insulation scheme was \u0027doomed to fail\u0027, say MPs",
      "Link": "https://www.bbc.com/news/articles/c8011kkdn5jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T07:00:06+00:00",
      "Source": "BBC News",
      "Summary": "Installers should be investigated by the Serious Fraud Office, an influential parliamentary committee has said."
    },
    {
      "Title": "Vietnam\u0027s leader returns to power with bold promises. Can he deliver? ",
      "Link": "https://www.bbc.com/news/articles/c20zzq8we8wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:59:50+00:00",
      "Source": "BBC News",
      "Summary": "To Lam resumes the role of communist party chief, the post he currently holds, for the next five years."
    },
    {
      "Title": "\u0027He\u0027s my son\u0027 - Emery on pushing Tielemans",
      "Link": "https://www.bbc.com/sport/football/articles/cy09974jwx9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:54:54+00:00",
      "Source": "BBC News",
      "Summary": "Aston Villa manager Unai Emery plays down a heated touchline incident with midfielder Youri Tielemans after substituting him against Fenerbahce."
    },
    {
      "Title": "A \u0027reckless teenager\u0027 misusing his confidence - the making of Pimblett",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/articles/cd0yvrl1myzo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:38:36+00:00",
      "Source": "BBC News",
      "Summary": "Paddy Pimblett\u0027s journey from reckless teenager to UFC superstar could be completed in Las Vegas on Saturday when he faces Justin Gaethje for the interim lightweight title at UFC 324."
    },
    {
      "Title": "\u0027Emotionally all over the place\u0027 - gritty Sabalenka wins",
      "Link": "https://www.bbc.com/sport/tennis/articles/c8j332v7e9xo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:09:18+00:00",
      "Source": "BBC News",
      "Summary": "World number one Aryna Sabalenka says she was \u0022emotionally all over the place\u0022 as she squeezes into the Australian Open fourth round."
    },
    {
      "Title": "Eight surprise takeaways from the Oscar nominations",
      "Link": "https://www.bbc.com/news/articles/cp3zzv40422o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:07:32+00:00",
      "Source": "BBC News",
      "Summary": "Paul Mescal and Chase Infiniti missed out, while other actors carried their films to a nomination."
    },
    {
      "Title": "\u0027I gave last 46p\u0027: Young people tell how they felt pressure to donate to emerging church",
      "Link": "https://www.bbc.com/news/articles/c8e59zrxrypo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T06:05:43+00:00",
      "Source": "BBC News",
      "Summary": "Former London ICC members tell the BBC they were pushed into making donations they could not afford."
    },
    {
      "Title": "US president stepped back over Greenland threat because he heard UK’s concerns, says Lammy",
      "Link": "https://www.bbc.com/news/articles/cm244zlnmkvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:59:34+00:00",
      "Source": "BBC News",
      "Summary": "The deputy PM says the US President rowed back on threats after UK stood up for Denmark\u0027s sovereignty."
    },
    {
      "Title": "Dozens of sanctioned Russian tankers navigate Channel despite UK vow of \u0027assertive\u0027 action",
      "Link": "https://www.bbc.com/news/articles/c2d77rr51rko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:58:03+00:00",
      "Source": "BBC News",
      "Summary": "Some 42 sanctioned tankers has passed through the Channel since 11 January, a BBC Verify analysis finds. "
    },
    {
      "Title": "Ukraine is battling to keep the lights on, this nuclear plant is vital in the fight",
      "Link": "https://www.bbc.com/news/articles/cp3zzqzgn28o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:57:55+00:00",
      "Source": "BBC News",
      "Summary": "The BBC gains rare access to the Khmelnytsky plant as Russian pummels Ukraine\u0027s energy grid."
    },
    {
      "Title": "The Papers: Zelensky\u0027s \u0027fiery\u0027 Davos speech and \u0027Operation Stop Burnham\u0027",
      "Link": "https://www.bbc.com/news/articles/cd0yyy1g842o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:56:10+00:00",
      "Source": "BBC News",
      "Summary": "More developments in Davos and the PM\u0027s allies moving to stop a potential leadership bid feature on Friday\u0027s front pages. "
    },
    {
      "Title": "Trump withdraws Canada\u0027s invite to  \u0027Board of Peace\u0027",
      "Link": "https://www.bbc.com/news/articles/cn7jjp8gl0jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T05:16:46+00:00",
      "Source": "BBC News",
      "Summary": "Trump did not provide a reason for the decision, which comes after Canada\u0027s PM Mark Carney warned of a \u0022rupture\u0022 in the US-led global order. "
    },
    {
      "Title": "\u0027I was in bed\u0027: How British actor Delroy Lindo heard about Oscar nomination",
      "Link": "https://www.bbc.com/news/videos/cy4qqek1ddyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T04:08:33+00:00",
      "Source": "BBC News",
      "Summary": "Lindo and his Sinners co-star Wunmi Mosaku are the only two UK actors nominated for an Oscar this year."
    },
    {
      "Title": "Teens among missing after landslide at  New Zealand campsite",
      "Link": "https://www.bbc.com/news/articles/c14rr5pnd80o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T02:50:33+00:00",
      "Source": "BBC News",
      "Summary": "The search continues for missing people after a landslide hit a popular campsite in Mount Maunganui."
    },
    {
      "Title": "Trump sparks anger over claim Nato troops avoided Afghan front line",
      "Link": "https://www.bbc.com/news/articles/czr444j671vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:34:42+00:00",
      "Source": "BBC News",
      "Summary": "The US president said allied troops had \u0022stayed a little back\u0022 during the war in Afghanistan."
    },
    {
      "Title": "BBC apologises to sacked presenter over homophobic abuse",
      "Link": "https://www.bbc.com/news/articles/cly51dzw86wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:23:13+00:00",
      "Source": "BBC News",
      "Summary": "An internal investigation found there was a case to answer over several incidents raised by former BBC Radio Cornwall presenter Jack Murley. "
    },
    {
      "Title": "Queen Elizabeth II statue will be standing and not on horseback",
      "Link": "https://www.bbc.com/news/articles/cx2ll7z7l22o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T01:05:34+00:00",
      "Source": "BBC News",
      "Summary": "The national memorial to the late Queen Elizabeth in St James\u0027s Park will not show her riding a horse as previously illustrated."
    },
    {
      "Title": "The TikTok deal is done, finally",
      "Link": "https://www.theverge.com/tech/866437/tiktok-usds-bytedance-sale-oracle-mgx",
      "Published": "2026-01-23T01:01:16+00:00",
      "Source": "The Verge",
      "Summary": "Just over a year after it briefly disappeared from app stores, TikTok in the US is now part of a new entity, TikTok USDS Joint Venture LLC. With approval from both the US and China closing on the schedule laid out in December, ByteDance\u0027s ownership of the new joint venture is now only 19.9 percent [\u0026#8230;]"
    },
    {
      "Title": "Ring can verify videos now, but that might not help you with most AI fakes",
      "Link": "https://www.theverge.com/news/866441/ring-verify-security-camera-ai-fakes-video-verification",
      "Published": "2026-01-23T00:57:41+00:00",
      "Source": "The Verge",
      "Summary": "Ring has launched a new Ring Verify tool that the company says can \u0022verify that Ring videos you receive haven\u0027t been edited or changed.\u0022 But since Ring won\u0027t verify videos that have been altered in any way, it probably won\u0027t be able to verify those videos you see on TikTok that look like they\u0027re from [\u0026#8230;]"
    },
    {
      "Title": "Hundreds of illegal waste tips operating in England - including 11 \u0027super sites\u0027",
      "Link": "https://www.bbc.com/news/articles/c1ev4yg1j1lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:55:46+00:00",
      "Source": "BBC News",
      "Summary": "A BBC investigation uncovers how criminals are operating huge illegal rubbish tips across the country."
    },
    {
      "Title": "Beyond Good and Evil 2 somehow survived the purge at Ubisoft",
      "Link": "https://www.theverge.com/games/866439/beyond-good-and-evil-2-somehow-survived-the-purge-at-ubisoft",
      "Published": "2026-01-23T00:53:25+00:00",
      "Source": "The Verge",
      "Summary": "In what world does Prince of Persia: The Sands of Time Remake get canceled amid corporate restructuring and yet BG\u0026#38;E2 does not? \u0022Beyond Good \u0026#38; Evil 2 remains a priority for us in the context of our strategy centered around Open World Adventures,\u0022 an unnamed Ubisoft spokesperson told Kotaku and Insider Gaming. The original Beyond [\u0026#8230;]"
    },
    {
      "Title": "Behind the scenes of Help 2, the star-studded charity album",
      "Link": "https://www.bbc.com/news/articles/cy4qqdy29d2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:16:04+00:00",
      "Source": "BBC News",
      "Summary": "Olivia Rodrigo, Arctic Monkeys and Pulp are among the artists who recorded new songs for War Child."
    },
    {
      "Title": "I tried hard to \u0027menopause mask\u0027 like so many women - but it can have consequences",
      "Link": "https://www.bbc.com/news/articles/c23e1n3ge29o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:14:56+00:00",
      "Source": "BBC News",
      "Summary": "Concealing symptoms of menopause can have knock-on effects for some women, such as increasing the risk of burnout"
    },
    {
      "Title": "Retired civil servants left in pension limbo ",
      "Link": "https://www.bbc.com/news/articles/cp9jkdx1gp8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T00:01:15+00:00",
      "Source": "BBC News",
      "Summary": "Civil service pension scheme failed to pay some pensions and lump sums after transferring to a new administrator."
    },
    {
      "Title": "How 55 seconds left Forest\u0027s Europa League hopes in balance",
      "Link": "https://www.bbc.com/sport/football/articles/c9vxx07nwdno?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T23:54:47+00:00",
      "Source": "BBC News",
      "Summary": "Nottingham Forest\u0027s hopes of a top-eight finish in the Europa League - and a straight route to the last 16 - are hanging by a thread after 55 costly seconds lead to defeat by Sporting Braga."
    },
    {
      "Title": "Samsung’s smallest Frame TVs have fallen to their lowest prices to date",
      "Link": "https://www.theverge.com/gadgets/866298/samsung-frame-tv-2025-43-50-inch-qled-woot-deal-sale",
      "Published": "2026-01-22T23:51:39+00:00",
      "Source": "The Verge",
      "Summary": "Unless you\u0026#8217;re dead set on picking up a larger panel, Samsung’s forthcoming 2026 Frame lineup represents a fairly minor upgrade. That makes last year’s model an easy rec for those on the hunt for an art-inspired 4K TV, especially given the 43- and 50-inch models are down to the lowest prices we’ve seen at Woot, [\u0026#8230;]"
    },
    {
      "Title": "A national tragedy 30 years ago united Australia. Why hasn\u0027t the Bondi shooting?",
      "Link": "https://www.bbc.com/news/articles/cx2yy4n1vlgo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T23:23:32+00:00",
      "Source": "BBC News",
      "Summary": "Political spats brewing since the tragedy last month have overshadowed a national day of mourning."
    },
    {
      "Title": "Chris Mason: Andy Burnham faces tricky run to win Labour crown",
      "Link": "https://www.bbc.com/news/articles/cvg553rk7zvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T22:40:55+00:00",
      "Source": "BBC News",
      "Summary": "The Greater Manchester mayor must overcome substantial obstacles in order to challenge Keir Starmer."
    },
    {
      "Title": "Nintendo is following up Alarmo with a weird Talking Flower in March",
      "Link": "https://www.theverge.com/tech/865618/nintendo-talking-flower-preorder-super-mario-wonder",
      "Published": "2026-01-22T22:17:23+00:00",
      "Source": "The Verge",
      "Summary": "After sharing a brief look at its new Talking Flower during a Nintendo Direct showcase last September that generated more questions than answers, Nintendo has finally revealed more details about what the interactive toy actually does and how much it costs. It shares some functionality with Nintendo\u0027s Alarmo alarm clock, but the Talking Flower seems [\u0026#8230;]"
    },
    {
      "Title": "Vimeo lays off ‘large portion’ of staff after Bending Spoons buyout",
      "Link": "https://www.theverge.com/news/866238/vimeo-layoffs-bending-spoons-acquisition",
      "Published": "2026-01-22T22:02:50+00:00",
      "Source": "The Verge",
      "Summary": "Vimeo is laying off employees around the globe just months after the Italian software company Bending Spoons acquired the platform for $1.38 billion, as reported earlier by Business Insider. Even though it\u0027s not clear how many people were laid off, Dave Brown, Vimeo\u0027s former brand VP, says in a post on LinkedIn that \u0022a large [\u0026#8230;]"
    },
    {
      "Title": "Epic and Google have a secret $800 million Unreal Engine and services deal",
      "Link": "https://www.theverge.com/policy/866140/epic-google-fortnite-android-unreal-deal-antitrust-settlement",
      "Published": "2026-01-22T21:47:07+00:00",
      "Source": "The Verge",
      "Summary": "A judge is questioning whether Epic Games and Google are settling their long-running antitrust fight partly because of a previously unannounced partnership involving the Unreal Engine, Fortnite, and Android. In a hearing in San Francisco today, the court revealed that Epic and Google have struck a new deal that apparently includes \u0022joint product development, joint [\u0026#8230;]"
    },
    {
      "Title": "Could Trump\u0027s bid to become peacemaker-in-chief sideline the struggling UN?",
      "Link": "https://www.bbc.com/news/articles/cn8jj228g2vo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T21:40:18+00:00",
      "Source": "BBC News",
      "Summary": "The US president has promised to \u0022end decades of suffering\u0022 but critics dismiss his Board of Peace as a vainglorious project."
    },
    {
      "Title": "Sen. Markey questions OpenAI about ‘deceptive advertising’ in ChatGPT",
      "Link": "https://www.theverge.com/news/865854/senator-ed-markey-ai-companies-chatbots-advertising",
      "Published": "2026-01-22T21:30:00+00:00",
      "Source": "The Verge",
      "Summary": "Sen. Ed Markey (D-MA) is pressing OpenAI about its move to bring ads to ChatGPT, and is asking several other companies whether they have similar plans. In letters to the CEOs of OpenAI, Anthropic, Google, Meta, Microsoft, Snap, and xAI, Markey writes that embedding ads into AI chatbots \u0022raises significant concerns for consumer protection, privacy, [\u0026#8230;]"
    },
    {
      "Title": "Tesla is finally doing unsupervised robotaxi rides",
      "Link": "https://www.theverge.com/transportation/866165/tesla-robotaxi-unsupervised-austin-texas-safety-monitor",
      "Published": "2026-01-22T21:23:19+00:00",
      "Source": "The Verge",
      "Summary": "Tesla is finally doing unsupervised robotaxi trips in Austin, Texas, according to a video posted on X. Elon Musk reposted the video, congratulating Tesla\u0027s AI team for the milestone. For months, Tesla\u0027s robotaxis in Austin and San Francisco have included safety monitors with access to a kill switch in case of emergency - a fallback [\u0026#8230;]"
    },
    {
      "Title": "Ring says it\u0026#8217;s not giving ICE access to its cameras",
      "Link": "https://www.theverge.com/news/866003/ring-ice-camera-access-flock",
      "Published": "2026-01-22T20:30:27+00:00",
      "Source": "The Verge",
      "Summary": "Ring\u0027s partnership with Flock is sparking renewed online backlash this week, with influencers calling for people to smash their Ring cameras and claiming the company is part of the surveillance state amid heightened concerns over ICE actions. Flock is an AI-powered surveillance camera company that has reportedly allowed government agencies - including ICE - to [\u0026#8230;]"
    },
    {
      "Title": "Harry Styles announces global tour ahead of fourth album release",
      "Link": "https://www.bbc.com/news/articles/c70lljdd2l9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T19:43:32+00:00",
      "Source": "BBC News",
      "Summary": "Shania Twain will be among the special guests set to appear on the Together, Together tour later this year."
    },
    {
      "Title": "What actually is Trump\u0027s \u0027Board of Peace\u0027?",
      "Link": "https://www.bbc.co.uk/sounds/play/p0mwlx55?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T19:34:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump has a bumper second day at Davos after Greendland \u0027deal\u0027."
    },
    {
      "Title": "Weekly quiz: How did this cow surprise scientists?",
      "Link": "https://www.bbc.com/news/articles/c86v5nj39g1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T17:42:37+00:00",
      "Source": "BBC News",
      "Summary": "How much attention did you pay to what happened in the world over the past seven days?"
    },
    {
      "Title": "Osaka has tense exchange with Cirstea at end of match",
      "Link": "https://www.bbc.com/sport/tennis/videos/cedww5w2vq2o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T16:56:49+00:00",
      "Source": "BBC News",
      "Summary": "Naomi Osaka has stern enounter with Sorana Cirstea, receiving a frosty handshake and a telling-off from the Romanian as she wins 6-3 4-6 6-2 at the Australian Open."
    },
    {
      "Title": "Sutton\u0027s predictions v \u0027Roy Keane\u0027 - Saipan star Hardwicke",
      "Link": "https://www.bbc.com/sport/football/articles/cn8j42l594mo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-22T16:44:15+00:00",
      "Source": "BBC News",
      "Summary": "BBC Sport football expert Chris Sutton takes on actor Éanna Hardwicke, who plays Roy Keane in the new film Saipan - and AI - with his predictions for this week\u0027s Premier League fixtures."
    },
    {
      "Title": "Is Canada leading the global resistance against Trump?",
      "Link": "https://www.bbc.co.uk/programmes/w3ct719x?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T10:00:00+00:00",
      "Source": "BBC News",
      "Summary": "Trump responded, “no comment” when asked if he\u0027d use force to seize Greenland."
    },
    {
      "Title": "The Loch Capsule dishwasher is small, fast, and efficient — it even sanitizes gadgets",
      "Link": "https://www.theverge.com/reviews/866476/loch-capsule-review-counter-dishwasher-vanlife-tiny-house",
      "Published": "2026-01-24T08:00:00+00:00",
      "Source": "The Verge",
      "Summary": "A dishwasher is a luxury item some people can\u0027t live without. It\u0027s one of the first major kitchen devices I bought just as soon as I could afford one. And now that the kids are grown, it\u0027s the appliance I thought I\u0027d miss most in my nomadic vanlife pursuits. Loch sent me its $459.99 / [\u0026#8230;]"
    },
    {
      "Title": "Pentagon to offer \u0027more limited\u0027 support to US allies in defence strategy shift",
      "Link": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T07:57:00+00:00",
      "Source": "BBC News",
      "Summary": "The Pentagon\u0027s new National Defense Strategy also says China is no longer the top security priority for the US."
    },
    {
      "Title": "Surviving bombs and hunger to become a professional tennis player",
      "Link": "https://www.bbc.com/sport/tennis/articles/cvgrrpp93y3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T07:37:50+00:00",
      "Source": "BBC News",
      "Summary": "Tennis is seen as a rich sport. But many stars, including Novak Djokovic and Elina Svitolina, have forged successful careers from humble beginnings."
    },
    {
      "Title": "Gaethje v Pimblett - predictions for UFC title fight",
      "Link": "https://www.bbc.com/sport/mixed-martial-arts/articles/c9dvv90759wo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:50:30+00:00",
      "Source": "BBC News",
      "Summary": "The world of MMA deliver their predictions for Paddy Pimblett\u0027s UFC lightweight interim title fight against Justin Gaethje on Saturday."
    },
    {
      "Title": "Tottenham, Bayern and a stand made of chairs - Palhinha\u0027s story",
      "Link": "https://www.bbc.com/sport/football/articles/c62ww08l0n6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:21:37+00:00",
      "Source": "BBC News",
      "Summary": "On-loan Tottenham midfielder Joao Palhinha chats to BBC Sport\u0027s Kelly Somers about his life and career."
    },
    {
      "Title": "How \u0027lucky\u0027 Sinner became biggest winner in near 40C Melbourne heat",
      "Link": "https://www.bbc.com/sport/tennis/articles/c1ev96w4xv6o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:14:57+00:00",
      "Source": "BBC News",
      "Summary": "Jannik Sinner\u0027s hopes of a third straight Australian Open title looked close to being over - then he benefitted from the heat creeping towards 40C."
    },
    {
      "Title": "Brighton inflict Everton\u0027s sixth straight home defeat in WSL",
      "Link": "https://www.bbc.com/sport/football/videos/cx2yjpy0v9qo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:08:13+00:00",
      "Source": "BBC News",
      "Summary": "Everton\u0027s wait for a first point at Goodison Park this season continues after Brighton hand them a sixth consecutive home defeat in the Women\u0027s Super League."
    },
    {
      "Title": "Women filmed in secret for TikTok content - and then harassed online",
      "Link": "https://www.bbc.com/news/articles/cr7jej2elyyo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T06:00:12+00:00",
      "Source": "BBC News",
      "Summary": "So-called manfluencers wearing smart glasses approach women and then post videos to TikTok."
    },
    {
      "Title": "\u0027Anger at Nato troop insult\u0027 and \u0027Trump delays Chagos surrender\u0027",
      "Link": "https://www.bbc.com/news/articles/cn408md7gdmo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:16:51+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s remarks about Nato troops in Afghanistan and his part in the Chagos Islands deal top the papers."
    },
    {
      "Title": "Four attacks in 48 hours: How east Australia\u0027s beaches became a \u0027perfect storm\u0027 for sharks",
      "Link": "https://www.bbc.com/news/articles/c0err023g5lo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:11:18+00:00",
      "Source": "BBC News",
      "Summary": "Human-shark encounters in Australia are rising - but experts are keen to point out it isn\u0027t the animals\u0027 fault."
    },
    {
      "Title": "Boy, 12, dies from injuries after Sydney shark attack",
      "Link": "https://www.bbc.com/news/articles/c2k98ql703no?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T05:10:24+00:00",
      "Source": "BBC News",
      "Summary": "Nico Antic was swimming in Sydney Harbour when he was attacked last Sunday."
    },
    {
      "Title": "Hundreds of Minnesota businesses close to protest ICE presence",
      "Link": "https://www.bbc.com/news/articles/c1dk67g4q91o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T03:55:30+00:00",
      "Source": "BBC News",
      "Summary": "Thousands of people have joined widespread protests against the weeks-long immigration crackdown in the state."
    },
    {
      "Title": "Are things going to get better for your finances?",
      "Link": "https://www.bbc.com/news/articles/cn42l3g3qvlo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T02:37:45+00:00",
      "Source": "BBC News",
      "Summary": "As Sir Keir Starmer makes the cost of living a government priority, we unpack the impact on family finances."
    },
    {
      "Title": "Pokémon cards: The \u0027liquid asset\u0027 increasingly attracting criminals",
      "Link": "https://www.bbc.com/news/articles/c70lk3w9krxo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T02:26:57+00:00",
      "Source": "BBC News",
      "Summary": "Cards related to the popular Japanese animation franchise have soared in value over recent years."
    },
    {
      "Title": "Chromebooks train schoolkids to be loyal customers, internal Google document suggests",
      "Link": "https://www.theverge.com/news/867138/google-chromebook-education-expansion-court-filings",
      "Published": "2026-01-24T01:21:41+00:00",
      "Source": "The Verge",
      "Summary": "Internal documents revealed as part of a child safety lawsuit hint at Google\u0027s plan to \u0022onboard kids\u0022 into its ecosystem by investing in schools. In this November 2020 presentation, Google writes that getting kids into its ecosystem \u0022leads to brand trust and loyalty over their lifetime,\u0022 as reported earlier by NBC News. The heavily-redacted documents, [\u0026#8230;]"
    },
    {
      "Title": "Leak: Nvidia is about to challenge ‘Intel Inside’ with as many as eight Arm laptops",
      "Link": "https://www.theverge.com/games/867056/leak-nvidia-n1-n1x-laptops-lenovo-dell",
      "Published": "2026-01-24T01:09:10+00:00",
      "Source": "The Verge",
      "Summary": "Intel and AMD have split the Windows laptop market for years, but the x86 players may be getting outnumbered. It\u0027s not just Apple MacBooks and MediaTek-based Chromebooks using Arm chips anymore. There are finally competent Qualcomm Snapdragon laptops running Windows, and - as soon as this spring - Nvidia will finally power Windows consumer laptops [\u0026#8230;]"
    },
    {
      "Title": "Explosive bust-ups, secret relationships and extreme reactions: The Traitors\u0027 best moments",
      "Link": "https://www.bbc.com/news/articles/cq84dp4zvy1o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:12:54+00:00",
      "Source": "BBC News",
      "Summary": "As another series ends, we look back at the most memorable moments from Stephen\u0027s facial expressions to Matt\u0027s proposition."
    },
    {
      "Title": "Stuck between the US and Russia, Canada must prove it can defend its Arctic territory",
      "Link": "https://www.bbc.com/news/articles/c9vx0p77pn8o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:05:27+00:00",
      "Source": "BBC News",
      "Summary": "Canada has been boosting its forces in the Arctic in the face of new threats - and US concerns. "
    },
    {
      "Title": "Tragic chapter on the trains sends rail superpower Spain into crisis",
      "Link": "https://www.bbc.com/news/articles/c0keelnyrvro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:03:57+00:00",
      "Source": "BBC News",
      "Summary": "Spain\u0027s vaunted reputation for its high-speed network has been humbled by disaster on the railways."
    },
    {
      "Title": "\u0027Half of my friends were killed\u0027 - the girls returning to a school caught up in war",
      "Link": "https://www.bbc.com/news/articles/cd9eeyz933jo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-24T00:03:52+00:00",
      "Source": "BBC News",
      "Summary": "Twins whose classmates were killed by shelling say their deaths have made them determined to finish their studies."
    },
    {
      "Title": "The Traitors stars serve up drama in nail-biting final",
      "Link": "https://www.bbc.com/news/articles/c301jg2dlmdo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T23:08:35+00:00",
      "Source": "BBC News",
      "Summary": "After three weeks, the latest series of The Traitors came to its dramatic climax in Friday\u0027s finale."
    },
    {
      "Title": "Police officers to be told they must get work licence or face dismissal",
      "Link": "https://www.bbc.com/news/articles/cn0kelpx734o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:52:28+00:00",
      "Source": "BBC News",
      "Summary": "The plans are part of a raft of measures aimed at the reform of police forces in England and Wales. "
    },
    {
      "Title": "Chagos Islands debate delayed as Tories call for halt to bill",
      "Link": "https://www.bbc.com/news/articles/cp372wz0z2zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:48:04+00:00",
      "Source": "BBC News",
      "Summary": "The legislation was due to be debated in Lords on Monday. "
    },
    {
      "Title": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested after years on the run",
      "Link": "https://www.bbc.com/news/articles/cj0nd8z1z59o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:24:59+00:00",
      "Source": "BBC News",
      "Summary": "Wedding, who had been on the FBI\u0027s Ten Most Wanted Fugitives list, is accused of running a transnational drug trafficking operation."
    },
    {
      "Title": "\u0027Trump should apologise\u0027: Anger of veterans and relatives",
      "Link": "https://www.bbc.com/news/articles/c20gzjnv9l5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:10:03+00:00",
      "Source": "BBC News",
      "Summary": "A total of 457 British service personnel were killed fighting in Afghanistan. "
    },
    {
      "Title": "Congress doesn’t seem to know if the TikTok deal complies with its law",
      "Link": "https://www.theverge.com/news/866977/tiktok-deal-congress-china",
      "Published": "2026-01-23T22:08:43+00:00",
      "Source": "The Verge",
      "Summary": "TikTok finally closed a deal meant to bring it into compliance with the law that should have banned it a year ago, and the lawmakers who passed that law still don\u0027t seem to know what\u0027s going on. The company announced Tuesday that its US service is now part of the separate TikTok USDS Joint Venture [\u0026#8230;]"
    },
    {
      "Title": "Chris Mason: Starmer\u0027s strongest rebuke yet for Trump",
      "Link": "https://www.bbc.com/news/articles/c9dvnlvzjw7o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T22:04:12+00:00",
      "Source": "BBC News",
      "Summary": "This past week could mark a turning point in the relationship between the UK prime minister and the US president."
    },
    {
      "Title": "Harry says sacrifices by Nato troops in Afghanistan deserve \u0027respect\u0027 after Trump comments",
      "Link": "https://www.bbc.com/news/articles/clym2l7d75eo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T21:50:47+00:00",
      "Source": "BBC News",
      "Summary": "The US president\u0027s comments have been condemned by international allies, including UK veterans and politicians."
    },
    {
      "Title": "England fans\u0027 World Cup arrest record shows Infantino joke inaccurate",
      "Link": "https://www.bbc.com/sport/football/articles/cj0nn0nzvmro?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T20:39:49+00:00",
      "Source": "BBC News",
      "Summary": "Did Fifa president Gianni Infantino lean into stereotypes about England fans being arrested at the World Cup?"
    },
    {
      "Title": "Watch: Starmer condemns Trump\u0027s remarks",
      "Link": "https://www.bbc.com/news/videos/c5y3jvrz3zko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T20:11:52+00:00",
      "Source": "BBC News",
      "Summary": "The UK was among several allies to join the US in Afghanistan from 2001, after it invoked Nato\u0027s collective security clause following the 9/11 terror attacks."
    },
    {
      "Title": "Meta is stopping teens from chatting with its AI characters",
      "Link": "https://www.theverge.com/news/866906/meta-teens-ai-characters-stop-block-new-version",
      "Published": "2026-01-23T19:50:59+00:00",
      "Source": "The Verge",
      "Summary": "Meta is \u0022temporarily pausing\u0022 the ability for teens to chat with its AI characters as it develops a \u0022new version\u0022 of the characters that will offer a \u0022better experience.\u0022 The company made the announcement in an update to a blog post from October where the company had detailed more parental controls for teen AI use. [\u0026#8230;]"
    },
    {
      "Title": "What TikTok’s new owners mean for your feed",
      "Link": "https://www.theverge.com/tech/866868/tiktok-usds-new-owners-algorithm-explained",
      "Published": "2026-01-23T19:10:51+00:00",
      "Source": "The Verge",
      "Summary": "TikTok is officially under new ownership in the US, and that could spell big changes for the video-sharing app. On January 22nd, ByteDance - TikTok\u0027s Chinese parent company - and a group of investors closed a $14 billion deal to spin off the platform\u0027s US operations, introducing a new slate of American executives. The Silver [\u0026#8230;]"
    },
    {
      "Title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
      "Link": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T19:02:50+00:00",
      "Source": "BBC News",
      "Summary": "Brits, Canadians and Danes were among those who saw the toughest fighting, writes the BBC\u0027s security correspondent."
    },
    {
      "Title": "Rayner to back calls for Burnham to be allowed to stand in by-election",
      "Link": "https://www.bbc.com/news/articles/c77kexz6k5zo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T18:33:50+00:00",
      "Source": "BBC News",
      "Summary": "The Greater Manchester mayor has until Saturday afternoon to decide if he wants to enter the contest to be Labour\u0027s candidate."
    },
    {
      "Title": "Former Tory councillor pleads guilty to drugging and raping wife over 13 years",
      "Link": "https://www.bbc.com/news/articles/c4grr3368n3o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T18:18:11+00:00",
      "Source": "BBC News",
      "Summary": "Philip Young admitted committing a number of sexual offences against Joanne Young over 13 years."
    },
    {
      "Title": "Casio teased a retro gaming-inspired sampler",
      "Link": "https://www.theverge.com/news/866709/casio-sx-c1-retro-gaming-inspired-sampler-at-namm",
      "Published": "2026-01-23T18:10:28+00:00",
      "Source": "The Verge",
      "Summary": "Casio showed up to NAMM (CES for music gear nerds) this year with a prototype sampler called the SX-C1 that looks every bit the lovechild of a Game Boy and an SP-404. The top has a directional pad and four buttons just like you\u0027d find on a game controller, flanking a 1.3-inch OLED screen. But [\u0026#8230;]"
    },
    {
      "Title": "The best instant cameras you can buy right now",
      "Link": "https://www.theverge.com/23133103/best-instant-cameras-fujifilm-polaroid-kodak",
      "Published": "2026-01-23T18:01:09+00:00",
      "Source": "The Verge",
      "Summary": "Even with the ability to take excellent photos with our phones and instantly share them across the world, there’s something magical about the old-school instant camera. With just a click of a button, you can capture a moment in a photo that you can see and touch almost immediately. Images captured by an instant camera [\u0026#8230;]"
    },
    {
      "Title": "Hang on, there’s a Trump Phone Ultra coming too?",
      "Link": "https://www.theverge.com/news/866601/trump-mobile-t1-ultra-phone-don-hendrickson-interview",
      "Published": "2026-01-23T17:27:22+00:00",
      "Source": "The Verge",
      "Summary": "Where\u0027s the Trump Phone? We\u0027re going to keep talking about it every week. We\u0027ve reached out, as usual, to ask about the Trump Phone\u0027s whereabouts. As usual, we\u0027re still waiting for a response. In the meantime, it turns out we might have two Trump Phones to worry about. The Trump Phone may be no more [\u0026#8230;]"
    },
    {
      "Title": "Robbie Williams breaks The Beatles\u0027 chart record",
      "Link": "https://www.bbc.com/news/articles/c93vv02wz3ko?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T16:59:47+00:00",
      "Source": "BBC News",
      "Summary": "The star\u0027s latest album, Britpop, debuts at number one, giving Williams his 16th solo UK chart-topper."
    },
    {
      "Title": "Marshall’s new hub connects to multiple Bluetooth speakers without pairing",
      "Link": "https://www.theverge.com/tech/866640/marshall-music-streaming-hub-heddon-bluetooth-auracast-speakers",
      "Published": "2026-01-23T16:54:01+00:00",
      "Source": "The Verge",
      "Summary": "Marshall has announced a new music streaming hub called the Heddon that can broadcast to multiple speakers using the Bluetooth Auracast feature that\u0027s finally starting to catch on. Similar to Sennheiser\u0027s BTA1 TV Transmitter announced earlier this week, the Heddon doesn\u0027t require wireless audio devices to go through a pairing process to stream audio, as [\u0026#8230;]"
    },
    {
      "Title": "Brooklyn Beckham\u0027s wedding DJ speaks about \u0027awkward\u0027 dance",
      "Link": "https://www.bbc.com/news/articles/cp8220err46o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-23T13:10:09+00:00",
      "Source": "BBC News",
      "Summary": "The groom has said his mother Victoria \u0022danced very inappropriately on me in front of everyone\u0022."
    },
    {
      "Title": "First all-female British team completes 8,000km Dakar Rally",
      "Link": "https://www.bbc.com/news/articles/c0erx543ww5o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T16:43:36+00:00",
      "Source": "BBC News",
      "Summary": "Marcella Kirk and Helen Tait-Wright complete the 8,000km (4,970-mile) Dakar Rally in Saudi Arabia."
    },
    {
      "Title": "The retired silversmith turning used candles into stoves for Ukraine",
      "Link": "https://www.bbc.com/news/articles/ce9yvd290l4o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:29:56+00:00",
      "Source": "BBC News",
      "Summary": "Mark Stevens has supplied thousands of candles to war damaged areas of Ukraine."
    },
    {
      "Title": "The 3,500-mile love story that started in an online horror game",
      "Link": "https://www.bbc.com/news/articles/cn42lnl4yw9o?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-20T06:13:20+00:00",
      "Source": "BBC News",
      "Summary": "Despite living in the same house, they are no longer able to video game together because of childcare."
    },
    {
      "Title": "My home bakery helps me cope with inoperable brain condition",
      "Link": "https://www.bbc.com/news/articles/c14r7z8mjezo?at_medium=RSS\u0026at_campaign=rss",
      "Published": "2026-01-19T06:00:54+00:00",
      "Source": "BBC News",
      "Summary": "Megan Jackson says baking is her \u0022coping mechanism\u0022 after an inoperable brain condition diagnosis."
    }
  ],
  "Prices": []
}